[
  {
    "timestamp": "2024-10-06T10:30:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Red Hat, el gigante de software empresarial, está siendo extorsionado por la banda ShinyHunters tras una importante filtración de datos.\nLa brecha, atribuida a Crimson Collective, comprometió 570GB de información desde su instancia GitLab, incluyendo 800 Customer Engagement Reports (CERs).\nEstos CERs contienen datos sensibles de clientes como Walmart, HSBC, Bank of Canada y American Express.\nShinyHunters ha publicado muestras de los datos robados y exige un rescate antes del 10 de octubre.",
    "palabras_claves": [
      "Red Hat",
      "ShinyHunters",
      "filtración de datos",
      "extorsión",
      "Customer Engagement Reports"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://www.bleepingcomputer.com/news/security/red-hat-data-breach-escalates-as-shinyhunters-joins-extortion/"
  },
  {
    "timestamp": "2024-10-06T10:30:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Oracle ha lanzado un parche de emergencia para una vulnerabilidad crítica (CVE-2025-61882) en su E-Business Suite, explotada activamente por el grupo de ransomware Cl0p. Este grupo ha robado datos y exigido rescates millonarios, aprovechando la falla para lograr ejecución remota de código y robo de credenciales. La actividad delictiva, que podría implicar a FIN11, comenzó en septiembre de 2025 y está siendo investigada por Mandiant y Google. Se han identificado indicadores de compromiso.",
    "palabras_claves": [
      "Oracle",
      "Cl0p",
      "vulnerabilidad",
      "ransomware",
      "fuga de datos"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://securityaffairs.com/183029/security/oracle-patches-critical-e-business-suite-flaw-exploited-by-cl0p-hackers.html"
  },
  {
    "timestamp": "2025-10-06T22:18:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Discord ha revelado una brecha de seguridad en un proveedor externo de soporte al cliente. La filtración expuso datos de usuarios que contactaron a sus equipos de soporte, incluyendo nombres, correos electrónicos, IPs y detalles de facturación. También se vieron afectadas imágenes de identificación gubernamental. Discord afirma que sus sistemas no fueron accedidos directamente y ha notificado a las autoridades.",
    "palabras_claves": [
      "data breach",
      "Discord",
      "filtración de datos",
      "ciberseguridad",
      "datos de usuario"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://securityaffairs.com/183039/data-breach/discord-discloses-third-party-breach-affecting-customer-support-data.html"
  },
  {
    "timestamp": "2025-10-07T14:56:42",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Microsoft ha vinculado al grupo cibercriminal Storm-1175 con la explotación de una vulnerabilidad crítica (CVE-2025-10035) en el software Fortra GoAnywhere. Esta explotación ha llevado al despliegue del ransomware Medusa, permitiendo inyección de comandos, ejecución remota de código y exfiltración de datos. El ataque ha estado activo desde al menos septiembre de 2025, afectando a organizaciones que utilizan GoAnywhere MFT y generando críticas por la falta de transparencia de Fortra.",
    "palabras_claves": [
      "ransomware",
      "vulnerabilidad",
      "ciberataque",
      "explotación",
      "GoAnywhere"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/microsoft-links-storm-1175-to.html"
  },
  {
    "timestamp": "2025-10-07T14:59:32",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Nueva investigación de LayerX revela que las herramientas de IA son el principal canal de exfiltración de datos corporativos, superando a SaaS en la sombra. Datos sensibles, incluyendo PII y PCI, se pegan con frecuencia en plataformas de IA generativa a través de cuentas personales no gestionadas, haciendo ineficaces las herramientas DLP tradicionales. Esto subraya un colapso de gobernanza crítico y la necesidad de adaptar las estrategias de seguridad para tratar la IA como una categoría empresarial central.",
    "palabras_claves": [
      "data exfiltration",
      "inteligencia artificial",
      "fuga de datos",
      "ciberseguridad",
      "seguridad empresarial"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/new-research-ai-is-already-1-data.html"
  },
  {
    "timestamp": "2025-10-07T15:00:17",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Este webinar de Tines, en colaboración con AWS, aborda la orquestación de la Gestión de Identidad y Acceso (IAM) en entornos híbridos complejos.\nExplora por qué IAM falla y cómo modernizar los flujos de trabajo de identidad para reducir silos.\nEl objetivo es mantener la agilidad y una postura de seguridad sólida, mitigando el riesgo operacional.",
    "palabras_claves": [
      "IAM",
      "identidad",
      "orquestación",
      "riesgo operacional",
      "seguridad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thn.news/identity-sync"
  },
  {
    "timestamp": "2025-10-07T15:01:10",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El malware XWorm 6.0 ha regresado con más de 35 plugins y capacidades mejoradas para el robo de datos, keylogging y ransomware. Se propaga a través de correos electrónicos de phishing y ha sido visto distribuyendo otras familias de malware, comprometiendo más de 18,459 dispositivos globalmente. Su modularidad lo convierte en una herramienta versátil para diversas acciones maliciosas.",
    "palabras_claves": [
      "XWorm",
      "malware",
      "robo de datos",
      "phishing",
      "ransomware"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/xworm-60-returns-with-35-plugins-and.html"
  },
  {
    "timestamp": "2025-10-07T15:08:06",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Akira afirma haber comprometido a Lautrec, una empresa con sede en Estados Unidos y una oficina en Canadá.\nSe exfiltraron más de 18GB de datos, incluyendo documentos corporativos esenciales e información personal.\nLa información comprometida pertenece a empleados y clientes de la compañía.",
    "palabras_claves": [
      "Akira ransomware",
      "filtración de datos",
      "brecha de seguridad",
      "datos corporativos",
      "información personal"
    ],
    "pais": "Estados Unidos",
    "sector": "Inmobiliario",
    "url": "https://t.co/oxQqhYCeu2"
  },
  {
    "timestamp": "2025-10-07T15:35:20",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Google DeepMind ha lanzado CodeMender, una IA que detecta y corrige automáticamente vulnerabilidades en el código, incluso reescribiéndolo. Ha aplicado 72 parches a proyectos de código abierto. Google también introduce un programa de recompensas por vulnerabilidades de IA para abordar inyecciones de prompts y jailbreaks.",
    "palabras_claves": [
      "vulnerabilidades",
      "inteligencia artificial",
      "CodeMender",
      "seguridad de software",
      "parches de seguridad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/googles-new-ai-doesnt-just-find.html"
  },
  {
    "timestamp": "2025-10-07T17:37:11",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Se ha detectado un aumento masivo en los escaneos dirigidos a los portales de inicio de sesión de Palo Alto Networks GlobalProtect y PAN-OS. La compañía de ciberinteligencia GreyNoise reportó un incremento del 500% en direcciones IP únicas, principalmente de EE.UU. Esta actividad sugiere esfuerzos de reconocimiento que podrían preceder nuevos ataques con exploits. Palo Alto Networks ha declarado no haber encontrado evidencia de compromiso.",
    "palabras_claves": [
      "scans",
      "Palo Alto Networks",
      "reconocimiento",
      "vulnerabilidad",
      "exploit"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://www.bleepingcomputer.com/news/security/massive-surge-in-scans-targeting-palo-alto-networks-login-portals/"
  },
  {
    "timestamp": "2025-10-08T00:06:51",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo aborda los desafíos del análisis forense digital en entornos cloud (AWS, Azure, GCP) comparado con el tradicional.\nSe destacan complejidades en la identificación, recopilación y preservación de evidencia digital debido a la naturaleza distribuida y virtualizada de la nube.\nTambién se detallan errores comunes de configuración que causan brechas de seguridad y sus indicadores forenses.\nUna preparación adecuada, herramientas especializadas y buenas prácticas son clave para una respuesta efectiva a incidentes.",
    "palabras_claves": [
      "análisis forense digital",
      "entornos cloud",
      "ciberseguridad",
      "brechas de seguridad",
      "evidencia digital"
    ],
    "pais": "",
    "sector": "",
    "url": "https://dreamlab.net/es/blog/principales-desafios-del-analisis-forense-digital-en-entornos-cloud/"
  },
  {
    "timestamp": "2025-10-08T07:22:01",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "OpenAI ha desarticulado tres grupos de hackers respaldados por estados (Rusia, Corea del Norte, China) que utilizaban ChatGPT para desarrollar malware, robar credenciales y realizar campañas de phishing. Los actores también llevaron a cabo operaciones de influencia dirigidas, entre otros, a intereses de EE. UU. La acción de OpenAI busca prevenir incidentes y fugas de datos al bloquear las cuentas utilizadas para estos fines.",
    "palabras_claves": [
      "ciberataque",
      "malware",
      "phishing",
      "credenciales comprometidas",
      "hacking"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/openai-disrupts-russian-north-korean.html"
  },
  {
    "timestamp": "2025-10-08T08:06:05",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El foro del juego 'Shin Megami Tensei' sufrió una \nbrecha de seguridad que resultó en el robo de 200,000 correos\nelectrónicos únicos y contraseñas cifradas. Este incidente \ndestaca las continuas amenazas de ciberseguridad y la \nimportancia de la protección de datos en plataformas digitales.",
    "palabras_claves": [
      "databreach",
      "ciberseguridad",
      "fuga de datos",
      "hackeo",
      "darkweb"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://twitter.com/DailyDarkWeb/status/1975832876827500935"
  },
  {
    "timestamp": "2025-10-08T11:02:56",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Se ha revelado una vulnerabilidad crítica (CVE-2025-53967) en el servidor Figma MCP, que permite la ejecución remota de código y el robo de datos. El fallo es una inyección de comandos debido al uso de entrada de usuario sin sanear. Imperva descubrió la falla, la cual ya fue parcheada en la versión 0.6.3, lanzada el 29 de septiembre de 2025. Esta vulnerabilidad subraya los riesgos de las herramientas de desarrollo impulsadas por IA.",
    "palabras_claves": [
      "vulnerabilidad",
      "ejecución remota de código",
      "Figma",
      "inyección de comandos",
      "seguridad de software"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/severe-figma-mcp-vulnerability-lets.html"
  },
  {
    "timestamp": "2025-10-08T11:23:46",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Salesforce ha confirmado su decisión de no negociar ni pagar un rescate a los atacantes responsables de un reciente robo de datos generalizado. La compañía comunicó esta postura a sus clientes, desafiando las demandas del grupo de extorsión Scattered LAPSUS$ Hunters. Los atacantes han respondido públicamente, instando a Salesforce a negociar y advirtiendo a los 39 clientes afectados que lo hagan directamente, ya que su proveedor no los salvará.",
    "palabras_claves": [
      "Salesforce",
      "robo de datos",
      "ransom",
      "Scattered LAPSUS$ Hunters",
      "clientes afectados"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://t.co/11T9i3hI8L"
  },
  {
    "timestamp": "2025-10-08T12:13:07",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Sarcoma ha afirmado haber comprometido a Charter Industrial Supply, un distribuidor familiar con sede en EE. UU.\nSe robaron 67 GB de archivos y bases de datos SQL durante el ataque.\nLa empresa se especializa en mangueras y accesorios industriales e hidráulicos, sirviendo a diversos mercados.",
    "palabras_claves": [
      "Sarcoma ransomware",
      "Charter Industrial Supply",
      "filtración de datos",
      "bases de datos SQL",
      "ataque cibernético"
    ],
    "pais": "United States",
    "sector": "Industrial",
    "url": "https://t.co/A4bmlqtKnM"
  },
  {
    "timestamp": "2025-10-08T12:15:25",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "LockBit, Qilin y DragonForce, tres prominentes grupos de ransomware, han formado una nueva alianza estratégica para intensificar sus ataques. Qilin ha sido el grupo más activo en los últimos meses, focalizando sus operaciones en organizaciones de Norteamérica. Esta coalición busca mejorar sus capacidades operacionales y expandir las amenazas a nuevos sectores y regiones.",
    "palabras_claves": [
      "ransomware",
      "ciberataque",
      "LockBit",
      "Qilin",
      "DragonForce"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/lockbit-qilin-and-dragonforce-join.html"
  },
  {
    "timestamp": "2025-10-08T12:31:28",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Akira ha afirmado haber comprometido a varias organizaciones, publicando sus detalles en su sitio de filtraciones en la dark web.\nAlegan haber exfiltrado un volumen significativo de datos sensibles de empresas estadounidenses como Cerenade Technology, Harbor Diesel & Equipment y J. Lorber Company.\nEl grupo amenaza con liberar la información personal y corporativa supuestamente comprometida.\nEste incidente subraya la continua amenaza de las operaciones de ransomware a diversas industrias.",
    "palabras_claves": [
      "Akira ransomware",
      "filtración de datos",
      "brecha de seguridad",
      "exfiltración",
      "dark web"
    ],
    "pais": "Estados Unidos",
    "sector": "",
    "url": "https://t.co/6McfSNP4Me"
  },
  {
    "timestamp": "2025-10-08T13:28:04",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La inteligencia artificial (IA) está revolucionando la ciberseguridad, optimizando la gestión de amenazas. Ayuda a los equipos de seguridad a deduplicar datos y priorizar riesgos eficazmente. Esta innovación es crucial para contrarrestar ataques automatizados y alinear la seguridad con los objetivos de negocio. Plataformas como PlexTrac están integrando IA para mejorar la gestión de vulnerabilidades y la reducción de riesgos.",
    "palabras_claves": [
      "ciberseguridad",
      "inteligencia artificial",
      "vulnerabilidad",
      "gestión de riesgos",
      "pentesting"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/09/automation-is-redefining-pentest.html"
  },
  {
    "timestamp": "2025-10-08T14:01:22",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers chinos están utilizando la herramienta de monitoreo de código abierto Nezha en una nueva ola de ataques. Emplean la inyección de logs para instalar web shells en paneles phpMyAdmin vulnerables. Esto les permite desplegar el malware Gh0st RAT, afectando a más de 100 máquinas a nivel mundial, con víctimas en Asia, EE.UU., Canadá, Colombia y Argentina.",
    "palabras_claves": [
      "hackeo",
      "malware",
      "vulnerabilidad",
      "ciberataque",
      "log poisoning"
    ],
    "pais": "USA, Colombia, Argentina",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/chinese-hackers-weaponize-open-source.html"
  },
  {
    "timestamp": "2025-10-08T14:37:42",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un grupo de amenazas autodenominado Scattered LAPSUS$ Hunters ha reclamado la autoría de una brecha de seguridad.\nDiversas corporaciones internacionales de tecnología, aviación y telecomunicaciones son las víctimas.\nEntre los afectados se encuentran Dell y Verizon (EE. UU.), Telstra, Kuwait Airways, Lycamobile y True Corporation & dtac.\nSe filtraron muestras de datos, incluyendo información personal y técnica sensible de las compañías.",
    "palabras_claves": [
      "Scattered LAPSUS$ Hunters",
      "breaching",
      "data samples",
      "leaked data",
      "corporations"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://t.co/ARQ9GzQKmA"
  },
  {
    "timestamp": "2025-10-08T17:06:11",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Una campaña de ciberataques está explotando sitios WordPress a través de inyecciones de JavaScript maliciosas para redirigir usuarios a páginas de phishing ClickFix. Estas páginas distribuyen ladrones de información (info-stealers). Se están utilizando nuevas técnicas como IUAM ClickFix Generator y el contrabando de caché, lo que reduce la barrera para los ciberdelincuentes. Investigadores de ciberseguridad advierten sobre la necesidad de asegurar los sitios WordPress.",
    "palabras_claves": [
      "ciberataque",
      "phishing",
      "malware",
      "exploit",
      "vulnerabilidad"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/hackers-exploit-wordpress-themes-to.html"
  },
  {
    "timestamp": "2025-10-09T02:51:23",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "CrowdStrike ha revelado y parcheado dos vulnerabilidades de severidad media (CVE-2025-42701 y CVE-2025-42706) en su sensor Falcon para Windows. Estas fallas permiten a un atacante con ejecución de código borrar archivos arbitrarios. Se han liberado las correcciones y no hay evidencia de explotación. Se insta a los clientes a actualizar sus sistemas.",
    "palabras_claves": [
      "vulnerabilidades",
      "Falcon sensor",
      "ejecución de código",
      "eliminación de archivos",
      "parches"
    ],
    "pais": "",
    "sector": "",
    "url": "https://cybersecuritynews.com/crowdstrike-falcon-windows-sensor-vulnerability/"
  },
  {
    "timestamp": "2025-10-09T07:04:59",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una vulnerabilidad crítica (CVE-2025-5947) en el tema Service Finder de WordPress permite a atacantes eludir la autenticación y obtener acceso administrativo a sitios web. Esta falla, que afecta a más de 6,100 clientes, ha sido explotada activamente desde agosto de 2025. El problema se corrigió en la versión 6.1 del plugin. Los administradores deben actualizar para prevenir el secuestro de sitios y la inserción de código malicioso.",
    "palabras_claves": [
      "exploit",
      "vulnerabilidad",
      "WordPress",
      "escalamiento de privilegios",
      "suplantación"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/critical-exploit-lets-hackers-bypass.html"
  },
  {
    "timestamp": "2025-10-09T07:20:55",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La inteligencia artificial se ha convertido en una herramienta clave para ataques como la suplantación de usuarios y la manipulación de datos. Las organizaciones deben implementar estrategias sólidas de seguridad de identidad, incluyendo defensas preventivas, autenticación inteligente y protección multicapa. Es crucial ajustar la autenticación para el phishing impulsado por IA, resistir el secuestro de sesiones y gestionar el \"shadow AI\" de manera efectiva.",
    "palabras_claves": [
      "AI-driven threats",
      "identity security",
      "phishing attacks",
      "access management",
      "authentication"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/expert-insights/2025/10/identity-and-ai-threats-developing.html"
  },
  {
    "timestamp": "2025-10-09T11:06:49",
    "categoria": "Noticias Locales (Chile) sobre Ciberfraude / Ciberataques",
    "resumen": "Un actor de amenazas afirma haber comprometido el Servicio de Registro Civil e Identificación (SRCEI) de Chile, entidad que gestiona el Registro Nacional de Vehículos Motorizados.\nSe reporta la exfiltración de más de 9.2 millones de registros, que incluyen una vasta cantidad de información personal sensible y datos de vehículos.\nEl SRCEI es la agencia gubernamental chilena responsable de mantener registros civiles vitales para la nación.\nEste incidente representa una fuga de datos masiva con información sensible de ciudadanos.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "Servicio de Registro Civil e Identificación",
      "exfiltrated data",
      "personal identification"
    ],
    "pais": "Chile",
    "sector": "Gobierno",
    "url": "https://t.co/t3oFEyhrJ5"
  },
  {
    "timestamp": "2025-10-09T12:38:45",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El boletín ThreatsDay de octubre de 2025 detalla múltiples ciberataques.\nLa campaña BlackStink ataca bancos latinoamericanos para robar fondos y realizar transferencias fraudulentas en tiempo real.\nHackers norcoreanos han sustraído más de $2 mil millones en criptomonedas, enfocándose en individuos de alto patrimonio.\nAdemás, se reportan vulnerabilidades en Microsoft Teams, Oracle E-Business Suite y otros sistemas tecnológicos clave.",
    "palabras_claves": [
      "ciberataque",
      "malware",
      "fraude financiero",
      "vulnerabilidad",
      "brecha de seguridad"
    ],
    "pais": "LATAM",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/threatsday-bulletin-ms-teams-hack-mfa.html"
  },
  {
    "timestamp": "2025-10-09T13:30:34",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El robo de tokens (OAuth, API y de sesión) es la principal causa de las brechas en entornos SaaS, permitiendo a atacantes evadir MFA. Incidentes recientes como los de Slack, CircleCI, Cloudflare/Okta y Salesloft/Drift, demuestran cómo un solo token comprometido puede otorgar acceso no autorizado a datos corporativos. La falta de visibilidad y monitoreo de los tokens en el ecosistema SaaS crea vulnerabilidades. Es crucial que las empresas fortalezcan la higiene de los tokens para prevenir estos ciberataques.",
    "palabras_claves": [
      "brecha de seguridad",
      "tokens",
      "SaaS",
      "credenciales comprometidas",
      "ciberataque"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/saas-breaches-start-with-tokens-what.html"
  },
  {
    "timestamp": "2025-10-09T13:56:35",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "SonicWall ha revelado que una parte no autorizada accedió a los archivos de respaldo de configuración de firewalls en la nube de sus clientes. Los archivos contienen credenciales cifradas y datos de configuración, lo que podría aumentar el riesgo de ataques dirigidos. La compañía está notificando a sus socios y clientes, y ha lanzado herramientas para ayudar en la evaluación y remediación de dispositivos, instando a los usuarios a verificar sus dispositivos y restablecer credenciales.",
    "palabras_claves": [
      "hackeo",
      "SonicWall",
      "firewall",
      "fuga de datos",
      "credenciales comprometidas"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/hackers-access-sonicwall-cloud-firewall.html"
  },
  {
    "timestamp": "2025-10-09T23:44:22",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "TaHiTI es un framework de \"threat hunting\" impulsado por inteligencia, desarrollado por el sector financiero holandés (FI-ISAC).\nSu objetivo es transformar las investigaciones ad hoc en cacerías repetibles, identificando brechas y mejorando las medidas de seguridad.\nIncluye la herramienta MaGMa para documentar y organizar los resultados de las actividades de caza de amenazas.\nEl marco busca una postura de seguridad más resiliente.",
    "palabras_claves": [
      "threat hunting",
      "TaHiTI",
      "ciberseguridad",
      "sector financiero",
      "inteligencia de amenazas"
    ],
    "pais": "Países Bajos",
    "sector": "Financiero",
    "url": "https://huntbook.predefender.com/part-1/frameworks/threathunting/tahiti/index.html"
  },
  {
    "timestamp": "2025-10-10T00:05:16",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo cibercriminal ShinyHunters está llevando a cabo una campaña de extorsión masiva contra docenas de empresas Fortune 500, incluyendo Salesforce, Red Hat y Discord. Han utilizado voice phishing para robar datos y amenazan con publicarlos si no se paga un rescate, además de explotar una vulnerabilidad de día cero en Oracle E-Business Suite. Varios miembros del grupo han sido acusados y sentenciados en EE.UU. y el Reino Unido, destacando el impacto en empresas de tecnología.",
    "palabras_claves": [
      "extorsión",
      "filtración de datos",
      "phishing",
      "vulnerabilidad",
      "ciberataque"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://krebsonsecurity.com/2025/10/shinyhunters-wage-broad-corporate-extortion-spree/"
  },
  {
    "timestamp": "2025-10-10T00:31:16",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "México enfrenta una alarmante escalada de ciberataques de phishing en 2025, impactando a 13.5 millones de personas. Estos ataques, que usan phishing como vector principal, afectan a sectores estratégicos como el financiero y empresarial. La falta de capacitación y legislación robusta agrava la vulnerabilidad, resultando en un incremento significativo de fraudes cibernéticos y pérdidas financieras. SILIKN subraya la urgencia de educación digital y actualización legal para proteger a usuarios y organizaciones.",
    "palabras_claves": [
      "ciberataques",
      "phishing",
      "fraude cibernético",
      "sector financiero",
      "SILIKN"
    ],
    "pais": "México",
    "sector": "Financiero",
    "url": "https://fortunaypoder.com/ciberseguridad/mexico-enfrenta-escalada-alarmante-de-ciberataques-de-phishing-silikn"
  },
  {
    "timestamp": "2025-10-10T09:40:50",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La compañía de ciberseguridad Huntress detectó la explotación activa de una vulnerabilidad de día cero (CVE-2025-11371) sin parchear en los productos Gladinet CentreStack y TrioFox. Esta falla de inclusión de archivos locales permite a los atacantes obtener claves de máquina para la ejecución remota de código. Tres clientes se han visto afectados, destacando riesgos críticos en el software empresarial.",
    "palabras_claves": [
      "explotación",
      "vulnerabilidad",
      "zero-day",
      "RCE",
      "Gladinet"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/from-lfi-to-rce-active-exploitation.html"
  },
  {
    "timestamp": "2025-10-10T10:34:22",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido la base de datos de inmigración de Migración Colombia y la está vendiendo en un foro de la dark web. Se asegura que contiene aproximadamente 1.5 millones de registros.\nLa información expuesta incluiría una amplia gama de detalles personales sensibles.",
    "palabras_claves": [
      "base de datos",
      "migración",
      "dark web",
      "registros",
      "datos personales"
    ],
    "pais": "Colombia",
    "sector": "",
    "url": "https://t.co/vsioIAjDW3"
  },
  {
    "timestamp": "2025-10-10T10:45:13",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Black Shrantac ha reivindicado un ataque contra Falco Electronics, una corporación multinacional mexicana de electrónica. Los atacantes afirman haber exfiltrado un total de 8 TB de datos. Falco Electronics es un importante diseñador y fabricante de componentes electrónicos para industrias como la conversión de energía y las telecomunicaciones.",
    "palabras_claves": [
      "ransomware",
      "Falco Electronics",
      "datos exfiltrados",
      "corporación mexicana",
      "telecomunicaciones"
    ],
    "pais": "México",
    "sector": "Electrónica",
    "url": "https://t.co/KNFPiP4uDZ"
  },
  {
    "timestamp": "2025-10-10T10:51:15",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a TraxNYC, una destacada marca de joyería de lujo con sede en Nueva York, conocida por sus clientes famosos. La supuesta brecha, ocurrida entre agosto y octubre de 2025, habría filtrado una base de datos con 182,326 registros de clientes. La información comprometida incluye una amplia gama de datos sensibles de clientes y pedidos.",
    "palabras_claves": [
      "brecha",
      "TraxNYC",
      "registros de clientes",
      "filtración de datos",
      "actor de amenazas"
    ],
    "pais": "USA",
    "sector": "",
    "url": "https://t.co/UhQUOO5CF8"
  },
  {
    "timestamp": "2025-10-10T10:52:10",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Investigadores de ciberseguridad han detectado 175 paquetes maliciosos en el registro npm utilizados para facilitar ataques de recolección de credenciales.\nEsta campaña, denominada Beamglea, ha afectado a más de 135 empresas industriales, tecnológicas y energéticas a nivel mundial.\nLos atacantes abusan de npm y la CDN de unpkg.com para alojar scripts de redirección a páginas de phishing, prellenando los campos de correo electrónico de las víctimas.\nLa técnica subraya la evolución de los actores de amenazas y el abuso de infraestructura legítima a escala.",
    "palabras_claves": [
      "paquetes maliciosos",
      "npm",
      "recolección de credenciales",
      "phishing",
      "scripts de redirección"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/175-malicious-npm-packages-with-26000.html"
  },
  {
    "timestamp": "2025-10-10T11:45:45",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Fortra ha revelado la cronología completa de la explotación activa de CVE-2025-10035, una vulnerabilidad crítica en su software GoAnywhere Managed File Transfer (MFT). La falla de deserialización permite la inyección de comandos sin autenticación y está siendo explotada desde al menos el 11 de septiembre de 2025. Microsoft vincula a un grupo de amenazas, Storm-1175, con el uso de esta vulnerabilidad para desplegar el ransomware Medusa. Fortra ha proporcionado hotfixes y recomienda a los usuarios restringir el acceso a la consola de administración y mantener el software actualizado.",
    "palabras_claves": [
      "CVE-2025-10035",
      "Fortra",
      "ransomware",
      "vulnerabilidad",
      "explotación"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/from-detection-to-patch-fortra-reveals.html"
  },
  {
    "timestamp": "2025-10-10T13:35:55",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Microsoft alerta sobre \"Payroll Pirates\" (Storm-2657), un actor de amenazas que secuestra cuentas de SaaS de RRHH como Workday en organizaciones de EE. UU. para desviar salarios de empleados. Los ataques utilizan ingeniería social y la falta de MFA. Se observaron 11 cuentas comprometidas en tres universidades desde marzo de 2025, distribuyendo más correos de phishing.",
    "palabras_claves": [
      "Payroll Pirates",
      "phishing",
      "SaaS",
      "salarios",
      "MFA"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/microsoft-warns-of-payroll-pirates.html"
  },
  {
    "timestamp": "2025-10-10T14:33:51",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Una campaña de malware denominada 'Stealit' utiliza la función Single Executable Application (SEA) de Node.js para distribuir Remote Access Trojans (RAT) a través de instaladores falsos de juegos y VPN. Este malware roba información sensible de navegadores, aplicaciones de mensajería, billeteras de criptomonedas y plataformas de juegos. Los actores de la amenaza ofrecen soluciones de extracción de datos, incluyendo la capacidad de desplegar ransomware en sistemas Windows y Android.",
    "palabras_claves": [
      "malware",
      "ransomware",
      "filtración de datos",
      "ciberataque",
      "criptomonedas"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/stealit-malware-abuses-nodejs-single.html"
  },
  {
    "timestamp": "2025-10-11T19:11:13",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Expertos alertan sobre un compromiso generalizado de dispositivos SonicWall SSL VPN que afecta a más de 100 cuentas de clientes. Los atacantes están utilizando credenciales válidas. Además, se menciona un incidente anterior donde se expusieron archivos de configuración de firewalls, y un aumento en la actividad del ransomware Akira que explota vulnerabilidades en dispositivos SonicWall.",
    "palabras_claves": [
      "compromiso generalizado",
      "SonicWall VPN",
      "ransomware",
      "CVE-2024-40766",
      "credenciales"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/experts-warn-of-widespread-sonicwall.html"
  },
  {
    "timestamp": "2025-10-11T19:17:28",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Actores de amenazas (Storm-2603, vinculados a actores estatales chinos) están utilizando Velociraptor, una herramienta DFIR de código abierto, en ataques de ransomware (Warlock, LockBit, Babuk). Explotan vulnerabilidades de SharePoint para obtener acceso inicial y una vulnerabilidad de escalada de privilegios en Velociraptor (CVE-2025-6264). Los atacantes modifican GPOs, desactivan protecciones en tiempo real y exfiltran datos. Rapid7, que mantiene Velociraptor, reconoce el mal uso de la herramienta.",
    "palabras_claves": [
      "ransomware",
      "Velociraptor",
      "Storm-2603",
      "privilege escalation",
      "LockBit"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/hackers-turn-velociraptor-dfir-tool.html"
  },
  {
    "timestamp": "2025-10-12T19:11:02",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Oracle ha emitido una alerta de seguridad sobre una nueva vulnerabilidad (CVE-2025-61884) en su E-Business Suite. Este fallo de alta gravedad, sin autenticación requerida, podría permitir el acceso no autorizado a datos sensibles en Oracle Configurator. La noticia sigue a la explotación de otra vulnerabilidad similar por hackers vinculados al grupo de ransomware Cl0p, quienes desplegaron diversas familias de malware para comprometer a docenas de organizaciones.",
    "palabras_claves": [
      "Oracle",
      "vulnerabilidad",
      "E-Business Suite",
      "acceso no autorizado",
      "ransomware"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/new-oracle-e-business-suite-bug-could.html"
  },
  {
    "timestamp": "2025-10-12T21:18:57",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un corresponsal de ciberseguridad de la BBC fue contactado por el grupo criminal Medusa, quienes le ofrecieron dinero para que facilitara un ciberataque a la BBC desde dentro. Los criminales buscaban acceder a los sistemas para instalar ransomware y extorsionar a la corporación, destacando la amenaza de los 'insider threats'. La noticia menciona un incidente previo en Brasil donde un trabajador de TI vendió sus credenciales, causando una pérdida de $100 millones a un banco. El reportero colaboró para entender la modus operandi del grupo.",
    "palabras_claves": [
      "insider threat",
      "ransomware",
      "Medusa",
      "ciberataque",
      "credenciales"
    ],
    "pais": "Brasil",
    "sector": "Financiero",
    "url": "https://www.bbc.com/news/articles/c3w5n903447o"
  },
  {
    "timestamp": "2025-10-13T05:17:41",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Se ha descubierto un nuevo malware Rust-based, ChaosBot, que utiliza canales de Discord para comando y control (C2) y ejecutar comandos en equipos comprometidos. Detectado en un entorno de servicios financieros, usa credenciales comprometidas y WMI para su despliegue. Además, una variante en C++, Chaos Ransomware, incorpora funciones destructivas para eliminar archivos y secuestrar el portapapeles para robar criptomonedas.",
    "palabras_claves": [
      "malware",
      "ransomware",
      "phishing",
      "ciberataque",
      "credenciales comprometidas"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/new-rust-based-malware-chaosbot-hijacks.html"
  },
  {
    "timestamp": "2025-10-13T06:54:35",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El troyano bancario Astaroth está utilizando GitHub para mantener sus operaciones y resistir los cierres de infraestructura. Este malware, distribuido a través de correos electrónicos de phishing con temática de DocuSign, se enfoca en robar credenciales bancarias y de criptomonedas. La campaña apunta principalmente a Brasil y otros países de América Latina. McAfee Labs ha identificado esta nueva táctica resiliente.",
    "palabras_claves": [
      "Astaroth",
      "banking trojan",
      "GitHub",
      "phishing",
      "data theft"
    ],
    "pais": "Brazil",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/astaroth-banking-trojan-abuses-github.html"
  },
  {
    "timestamp": "2025-10-13T07:15:34",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido el Lawrence Berkeley National Laboratory (LBNL), un laboratorio nacional de investigación científica del gobierno de EE. UU. La brecha de datos, supuestamente ocurrida en octubre de 2025, resultó en la exposición de archivos internos.\nLa información comprometida incluye el código fuente del laboratorio y herramientas internas. LBNL es operado por la Universidad de California en nombre del Departamento de Energía de EE. UU.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "data breach",
      "source code",
      "Lawrence Berkeley National Laboratory"
    ],
    "pais": "USA",
    "sector": "Gubernamental / Investigación",
    "url": "https://t.co/TN7QKgv8gc"
  },
  {
    "timestamp": "2025-10-13T07:35:35",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Crimson Collective ha asumido la responsabilidad por una importante fuga de datos en Loteria de Medellin (Lottired), una lotería estatal en Colombia. El grupo anunció en Telegram la exfiltración de más de 1 TB de datos comprimidos, incluyendo información personal y financiera sensible de ganadores de premios. Crimson Collective, conocido por atacar grandes corporaciones, ha tenido entre sus objetivos a Red Hat, Claro y Nintendo.",
    "palabras_claves": [
      "Crimson Collective",
      "fuga de datos",
      "Loteria de Medellin",
      "Colombia",
      "información financiera"
    ],
    "pais": "Colombia",
    "sector": "Financiero",
    "url": "https://t.co/tU9PX8JayB"
  },
  {
    "timestamp": "2025-10-13T08:02:55",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Obscura ha reivindicado un ciberataque contra la Ciudad de Michigan City, Indiana, EE. UU.\nEl incidente, que se confirmó el 9 de octubre de 2025, resultó en una interrupción de la red municipal y la exfiltración de 450 GB de datos.\nLos atacantes publicaron la información en la dark web, indicando que las negociaciones con la ciudad fallaron.\nAún no se detallan los tipos específicos de información comprometida.",
    "palabras_claves": [
      "ransomware",
      "Obscura",
      "ciberataque",
      "datos",
      "Michigan City"
    ],
    "pais": "United States",
    "sector": "Municipalidad",
    "url": "https://t.co/a0M4QQLARN"
  },
  {
    "timestamp": "2025-10-13T19:14:16",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El artículo advierte sobre el riesgo de JavaScript no monitoreado para minoristas en línea durante la temporada navideña de 2025. Destaca ataques del lado del cliente como Magecart y compromisos de la cadena de suministro, que permiten el robo de datos de pago. Subraya la falta de visibilidad de las herramientas de seguridad tradicionales y la importancia de implementar medidas de prevención para mitigar estos fraudes.",
    "palabras_claves": [
      "ciberataque",
      "fraude digital",
      "Magecart",
      "filtración de datos",
      "vulnerabilidad"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/why-unmonitored-javascript-is-your.html"
  },
  {
    "timestamp": "2025-10-13T19:14:52",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El botnet RondoDox ha expandido su alcance, explotando más de 50 vulnerabilidades en 30+ proveedores para ataques DDoS contra infraestructuras conectadas a internet. Se detectó una infraestructura \"loader-as-a-service\" que distribuye RondoDox, Mirai y Morte. Otros botnets como AISURU usan dispositivos IoT comprometidos en EE. UU., con operadores en Brasil. Una campaña en LATAM también ataca servicios RDP en EE. UU.",
    "palabras_claves": [
      "botnet",
      "vulnerabilidad",
      "DDoS",
      "malware",
      "IoT"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/researchers-warn-rondodox-botnet-is.html"
  },
  {
    "timestamp": "2025-10-13T23:22:56",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El ransomware Medusa, activo desde mediados de 2021, ha emergido como un actor clave en ciberdelincuencia, apuntando a víctimas de alto perfil como Toyota Financial Services.\nEsta sofisticada operación emplea una estrategia de doble extorsión, encriptando datos y amenazando con su publicación.\nSus métodos de infección incluyen phishing, explotación de RDP y vulnerabilidades, con origen sospechoso en Rusia.\nSe han registrado ataques significativos contra un sistema hospitalario, un proveedor de piezas automotrices y un gobierno municipal.",
    "palabras_claves": [
      "ransomware",
      "ciberataque",
      "doble extorsión",
      "vulnerabilidad",
      "phishing"
    ],
    "pais": "Estados Unidos",
    "sector": "Financiero",
    "url": "https://hackers-arise.com/the-medusa-ransomware-threat-anatomy-of-a-cybercrime-operation/"
  },
  {
    "timestamp": "2025-10-14T05:42:03",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Ciberinvestigadores han expuesto las sofisticadas capacidades del malware MonsterV2, distribuido por el actor de amenazas TA585 a través de campañas de phishing.\nEste malware funciona como troyano de acceso remoto, stealer y cargador, siendo vendido por un actor de habla rusa.\nLas campañas emplean señuelos temáticos del IRS de EE. UU. e inyecciones de JavaScript para su propagación.\nMonsterV2 es un malware avanzado que evita la infección en países de la Comunidad de Estados Independientes (CEI).",
    "palabras_claves": [
      "malware",
      "phishing",
      "ciberataque",
      "stealer",
      "TA585"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/researchers-expose-ta585s-monsterv2.html"
  },
  {
    "timestamp": "2025-10-14T07:14:03",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Investigadores identificaron paquetes maliciosos en npm, PyPI y RubyGems que exfiltran datos de desarrolladores a Discord. Un grupo norcoreano (\"Contagious Interview\") también usó 338 paquetes maliciosos en npm, robando credenciales y datos de billeteras de criptomonedas de desarrolladores Web3/blockchain. Esto subraya riesgos en la cadena de suministro de software y el uso de C2 gratuitos.",
    "palabras_claves": [
      "malware",
      "ciberataque",
      "filtración de datos",
      "credenciales comprometidas",
      "fraude financiero"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/npm-pypi-and-rubygems-packages-found.html"
  },
  {
    "timestamp": "2025-10-14T11:02:59",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La cuenta oficial de Instagram del FC Barcelona fue hackeada para promocionar un proyecto de criptomonedas falso en la plataforma Pump Fun. Los atacantes afirmaron falsamente que el club estaba \"construyendo algo masivo en Solana\", incitando a los seguidores a invertir. El token fraudulento subió y luego cayó, y el creador obtuvo casi 26.000 dólares en recompensas.",
    "palabras_claves": [
      "hackeo",
      "Instagram",
      "FC Barcelona",
      "crypto",
      "Pump Fun"
    ],
    "pais": "",
    "sector": "",
    "url": "https://protos.com/fc-barcelona-instagram-hacker-made-26k-in-pump-fun-rewards/"
  },
  {
    "timestamp": "2025-10-14T11:24:33",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un nuevo ataque de canal lateral, denominado Pixnapping, afecta a dispositivos Android (Google, Samsung) permitiendo robar códigos de autenticación de dos factores (2FA) y datos sensibles. Explota APIs de Android y un canal lateral de hardware (GPU.zip), siendo ejecutable por apps maliciosas sin permisos especiales. Google lanzó un parche (CVE-2025-48561) en septiembre de 2025, aunque existe un workaround y una vulnerabilidad para listar apps permanece sin solución.",
    "palabras_claves": [
      "Pixnapping",
      "Android",
      "autenticación de dos factores",
      "vulnerabilidad",
      "canal lateral"
    ],
    "pais": "",
    "sector": "Tecnología, Financiero",
    "url": "https://thehackernews.com/2025/10/new-pixnapping-android-flaw-lets-rogue.html"
  },
  {
    "timestamp": "2025-10-14T18:55:33",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Una campaña de phishing dirigida a usuarios colombianos utiliza notificaciones judiciales falsas.\nEl ataque distribuye el malware AsyncRAT a través de archivos .SVG adjuntos.\nEl objetivo es robar información, con la suplantación del Juzgado 17 Civil Municipal del Circuito de Bogotá.\nLa cadena de infección implica archivos SVG, HTA, VBS y PowerShell para inyectar el RAT en procesos de Windows.",
    "palabras_claves": [
      "phishing",
      "AsyncRAT",
      "malware",
      "ciberataque",
      "Colombia"
    ],
    "pais": "Colombia",
    "sector": "",
    "url": "https://www.seqrite.com/blog/judicial-notification-phish-colombia-svg-asyncrat/"
  },
  {
    "timestamp": "2025-10-14T18:55:59",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers chinos, identificados como Flax Typhoon, explotaron servidores ArcGIS de manera persistente durante más de un año. Utilizaron una extensión de objeto de servidor Java (SOE) modificada como web shell para establecer una puerta trasera. El ataque permitió la ejecución de comandos, la creación de un canal VPN encubierto y la obtención de credenciales de personal de TI.",
    "palabras_claves": [
      "hackeo",
      "ciberataque",
      "ArcGIS",
      "backdoor",
      "Flax Typhoon"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/chinese-hackers-exploit-arcgis-server.html"
  },
  {
    "timestamp": "2025-10-14T18:56:35",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo destaca la importancia de pasar de la concienciación a la caza de amenazas proactiva y la Gestión Continua de la Exposición a Amenazas (CTEM).\nSubraya las limitaciones de la concienciación por sí sola para prevenir brechas, abogando por marcos estructurados para validar continuamente la identidad, configuración y privilegios.\nEste enfoque identifica y elimina rutas de ataque antes de su explotación, transformando la seguridad de una detección reactiva a una prevención proactiva, mejorando la preparación organizacional.\nEl CISO en Residencia de XM Cyber explica cómo estas estrategias fortalecen las defensas contra ciberataques.",
    "palabras_claves": [
      "Threat hunting",
      "CTEM",
      "Ciberseguridad",
      "Prevención",
      "Vulnerabilidad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/moving-beyond-awareness-how-threat.html"
  },
  {
    "timestamp": "2025-10-15T05:41:38",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "SAP ha lanzado parches de seguridad para 13 vulnerabilidades en sus productos NetWeaver AS Java, SAP Print Service y SAP Supplier Relationship Management. Destacan tres fallos críticos (CVE-2025-42944, CVE-2025-42937, CVE-2025-42910) que permiten a atacantes ejecutar comandos arbitrarios, sobrescribir archivos del sistema o subir ejecutables maliciosos sin autenticación. Estas vulnerabilidades podrían llevar a la toma de control de servidores e impacto en la confidencialidad, integridad y disponibilidad. Se insta a los usuarios a aplicar las actualizaciones para mitigar los riesgos.",
    "palabras_claves": [
      "vulnerabilidad",
      "CVE",
      "ciberataque",
      "deserialization",
      "filtración de datos"
    ],
    "pais": "",
    "sector": "Enterprise Software",
    "url": "https://thehackernews.com/2025/10/new-sap-netweaver-bug-lets-attackers.html"
  },
  {
    "timestamp": "2025-10-15T06:23:02",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers están explotando activamente una vulnerabilidad crítica (CVE-2025-2611) en el software autodialer ICTBroadcast. La falla permite la ejecución remota de código sin autenticación mediante la inyección de comandos en cookies de sesión. Se han detectado alrededor de 200 instancias expuestas a estos ataques. La explotación se solapa con campañas previas que usaron el RAT Ratty.",
    "palabras_claves": [
      "hackeo",
      "vulnerabilidad",
      "exploit",
      "remote code execution",
      "ciberataque"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/hackers-target-ictbroadcast-servers-via.html"
  },
  {
    "timestamp": "2025-10-15T06:38:47",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Jay Chaudhry, CEO de Zscaler, discute cómo la IA Agéntica está transformando el negocio y la ciberseguridad, ofreciendo autonomía pero también nuevos riesgos como ataques de phishing más inteligentes. Enfatiza la seguridad de Zero Trust como clave para la protección.\nSugiere a las organizaciones adoptar la IA cuidadosamente, asegurando su infraestructura y estableciendo políticas robustas para los agentes de IA.",
    "palabras_claves": [
      "Agentic AI",
      "ciberseguridad",
      "Zero Trust",
      "phishing",
      "vulnerabilidad"
    ],
    "pais": "USA",
    "sector": "Ciberseguridad",
    "url": "https://thehackernews.com/videos/2025/10/exploring-agentic-ai-innovation-meets.html"
  },
  {
    "timestamp": "2025-10-15T06:54:47",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores de ciberseguridad han revelado dos fallas críticas (CVSS 10.0) en las unidades terminales remotas (RTU) Red Lion Sixnet. Estas vulnerabilidades, CVE-2023-40151 y CVE-2023-42770, permiten a atacantes no autenticados ejecutar comandos con privilegios de root. Esto podría otorgar a los ciberdelincuentes el control total de los sistemas industriales en sectores como energía, agua y manufactura. Se recomienda a los usuarios aplicar parches, ya que Red Lion emitió un aviso en junio de 2025 y CISA una alerta en noviembre de 2023.",
    "palabras_claves": [
      "vulnerabilidad",
      "CVSS 10.0",
      "control industrial",
      "RTUs",
      "ejecución remota de código"
    ],
    "pais": "",
    "sector": "Industrial",
    "url": "https://thehackernews.com/2025/10/two-cvss-100-bugs-in-red-lion-rtus.html"
  },
  {
    "timestamp": "2025-10-15T07:31:19",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a Teknobuilt, una empresa tecnológica socia de Oracle. El incidente, ocurrido en octubre de 2025, resultó en el robo y la filtración del código fuente propietario de la compañía. La información fue publicada en un foro de la dark web, mostrando un extenso repositorio comprometido.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "source code",
      "leak",
      "dark web forum"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://t.co/sTdDlVsaUz"
  },
  {
    "timestamp": "2025-10-15T07:57:35",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Killsec ha declarado haber comprometido a Global Go, una destacada compañía financiera en Perú, especializada en financiamiento de motocicletas.\nLa empresa fue añadida al sitio de fuga de datos del grupo, sugiriendo el impago de un rescate.\nLa brecha habría expuesto una cantidad significativa de información sensible de clientes y corporativa.",
    "palabras_claves": [
      "ransomware",
      "Killsec",
      "Global Go",
      "Perú",
      "fuga de datos"
    ],
    "pais": "Perú",
    "sector": "Financiero",
    "url": "https://t.co/zB3vOqaXxL"
  },
  {
    "timestamp": "2025-10-15T09:24:42",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Microsoft ha lanzado parches para 183 vulnerabilidades de seguridad, incluyendo dos zero-days de Windows (CVE-2025-24990, CVE-2025-59230) que están siendo explotados activamente. Una de estas vulnerabilidades de día cero afecta a todas las versiones de Windows y permite la elevación de privilegios. Estos problemas, junto con un bypass de Secure Boot en IGEL OS, han sido añadidos al catálogo de vulnerabilidades explotadas conocidas de CISA.",
    "palabras_claves": [
      "zero-day",
      "vulnerabilidad",
      "elevación de privilegios",
      "ciberseguridad",
      "Microsoft"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/two-new-windows-zero-days-exploited-in.html"
  },
  {
    "timestamp": "2025-10-15T15:00:11",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La compañía de ciberseguridad estadounidense F5 reveló que hackers patrocinados por estados violaron sus sistemas.\nLos atacantes obtuvieron acceso a largo plazo, robando código fuente y vulnerabilidades no divulgadas de su producto BIG-IP.\nAunque F5 afirma no tener evidencia de explotación, el gobierno de EE. UU. solicitó un retraso en la divulgación del incidente.\nF5 está revisando qué clientes tuvieron sus detalles de configuración robados, pero no hay impacto material en sus operaciones.",
    "palabras_claves": [
      "hackers",
      "código fuente",
      "vulnerabilidades",
      "BIG-IP",
      "F5"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología / Ciberseguridad",
    "url": "https://www.bleepingcomputer.com/news/security/hackers-breach-f5-to-steal-undisclosed-big-ip-flaws-source-code/"
  },
  {
    "timestamp": "2025-10-15T17:38:39",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo chino Jewelbug (Earth Alux) infiltró un proveedor de servicios de TI ruso por cinco meses en 2025, accediendo a repositorios de código y exfiltrando datos a Yandex Cloud. También atacó una organización gubernamental de Sudamérica en julio de 2025, desplegando malware avanzado. Utilizan herramientas legítimas y malware como FINALDRAFT y ShadowPad para ciberespionaje.",
    "palabras_claves": [
      "Jewelbug",
      "ciberespionaje",
      "filtración de datos",
      "cadena de suministro",
      "malware"
    ],
    "pais": "Sudamérica",
    "sector": "Servicios de TI",
    "url": "https://thehackernews.com/2025/10/chinese-threat-group-jewelbug-quietly.html"
  },
  {
    "timestamp": "2025-10-16T04:31:20",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La CISA de EE. UU. ha catalogado una vulnerabilidad crítica (CVE-2025-54253) en Adobe Experience Manager (AEM) bajo explotación activa. Con un CVSS de 10.0, este fallo permite la ejecución remota de código. Adobe lanzó parches en agosto de 2025. Las agencias federales deben aplicar las correcciones antes del 5 de noviembre de 2025.",
    "palabras_claves": [
      "vulnerabilidad",
      "ejecución remota de código",
      "Adobe AEM",
      "CISA",
      "explotación activa"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/cisa-flags-adobe-aem-flaw-with-perfect.html"
  },
  {
    "timestamp": "2025-10-16T09:43:16",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas ha desfigurado el sitio web clearnet de ShinyHunters, un grupo notorio de extorsión de datos. El mensaje en la página de inicio llama directamente a un individuo, insinuando un cisma o disputa interna. Los perpetradores afirman ser los \"verdaderos ShinyHunters\", apuntando a una división en una de las bandas de robo y extorsión de datos más agresivas.",
    "palabras_claves": [
      "threat actor",
      "ShinyHunters",
      "data extortion group",
      "defaced",
      "schism"
    ],
    "pais": "",
    "sector": "",
    "url": "https://t.co/QFqvwazng4"
  },
  {
    "timestamp": "2025-10-16T10:47:52",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El \"ThreatsDay Bulletin\" destaca una incautación de $15 mil millones en criptomonedas de redes de estafa en el sudeste asiático y un troyano bancario (Maverick) que afecta a usuarios brasileños de WhatsApp. También se reportan campañas de smishing que han robado más de $1 mil millones en EE. UU., una fuga de datos de pago en Unity Technologies y el desmantelamiento de una red de lavado de criptoactivos en Brasil.\n",
    "palabras_claves": [
      "ciberfraude",
      "criptomonedas",
      "phishing",
      "malware",
      "filtración de datos"
    ],
    "pais": "USA, Brazil, Colombia",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/threatsday-bulletin-15b-crypto-bust.html"
  },
  {
    "timestamp": "2025-10-16T11:08:33",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo explora los costos ocultos de las pruebas de penetración tradicionales, incluyendo gastos administrativos y complejidad en el alcance. Propone el enfoque \"Pen testing as a service (PTaaS)\" como una solución innovadora y rentable. Este modelo busca ofrecer cobertura continua de seguridad y detección de vulnerabilidades, minimizando interrupciones y costos innecesarios para las organizaciones.",
    "palabras_claves": [
      "Penetration testing",
      "ciberseguridad",
      "vulnerabilidad",
      "gestión de riesgos",
      "prevención de fraudes"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/beware-hidden-costs-of-pen-testing.html"
  },
  {
    "timestamp": "2025-10-16T11:41:04",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers explotaron una vulnerabilidad de día cero (CVE-2025-20352) en el SNMP de Cisco IOS y IOS XE para desplegar rootkits en sistemas Linux durante la \"Operation Zero Disco\". Estos rootkits permitieron la ejecución remota de código y acceso no autorizado persistente. La vulnerabilidad fue parcheada por Cisco tras ser activamente explotada.",
    "palabras_claves": [
      "hackeo",
      "ciberataque",
      "vulnerabilidad",
      "rootkit",
      "zero-day"
    ],
    "pais": "",
    "sector": "Tecnología / Telecomunicaciones",
    "url": "https://thehackernews.com/2025/10/hackers-deploy-linux-rootkits-via-cisco.html"
  },
  {
    "timestamp": "2025-10-16T14:21:00",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo analiza las plataformas AI-SOC como una solución crucial para los Centros de Operaciones de Seguridad (SOCs) que enfrentan una alta carga de alertas y posibles incidentes pasados por alto. Explora sus arquitecturas, modelos de implementación, riesgos y estrategias de adopción. El objetivo es mejorar la detección de amenazas, reducir la fatiga de los analistas y escalar la capacidad de seguridad, siendo una innovación vital para la ciberseguridad corporativa y de sectores regulados.",
    "palabras_claves": [
      "AI-SOC",
      "ciberseguridad",
      "automatización",
      "riesgos",
      "SOC"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/architectures-risks-and-adoption-how-to.html"
  },
  {
    "timestamp": "2025-10-16T14:36:47",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una nueva rootkit de Linux, LinkPro, fue descubierta tras el compromiso de una infraestructura de Amazon Web Services (AWS). Utiliza eBPF para ocultarse y se activa mediante \"magic TCP packets\". Los atacantes explotaron una vulnerabilidad de Jenkins (CVE-2024-23897) para desplegar malware en clusters de Kubernetes. Se sospecha de actores con motivaciones financieras.",
    "palabras_claves": [
      "rootkit",
      "eBPF",
      "Linux",
      "vulnerabilidad",
      "AWS"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/linkpro-linux-rootkit-uses-ebpf-to-hide.html"
  },
  {
    "timestamp": "2025-10-16T14:57:57",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un actor de amenazas con motivación financiera, UNC5142, está utilizando contratos inteligentes de blockchain para distribuir malware de robo de información a través de sitios web de WordPress comprometidos. La técnica, conocida como 'EtherHiding', oculta código malicioso en blockchains públicas como BNB Smart Chain. Los atacantes emplean un descargador JavaScript de múltiples etapas y tácticas de ingeniería social para infectar sistemas Windows y macOS. Google Threat Intelligence Group detectó 14,000 páginas web infectadas hasta junio de 2025.",
    "palabras_claves": [
      "malware",
      "ciberataque",
      "ciberfraude",
      "robo de identidad",
      "vulnerabilidad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/hackers-abuse-blockchain-smart.html"
  },
  {
    "timestamp": "2025-10-16T23:59:59",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Satélites sin cifrado exponen secretos de la Guardia Nacional, CFE y Telmex en México. Investigadores demostraron que una antena barata es suficiente para interceptar comunicaciones sensibles. Esta vulnerabilidad permite acceder a operaciones internas y representa un riesgo para la seguridad nacional, facilitando la vigilancia por parte de agencias de inteligencia extranjeras.",
    "palabras_claves": [
      "satélites",
      "cifrado",
      "vulnerabilidad",
      "exposición de datos",
      "ciberseguridad"
    ],
    "pais": "México",
    "sector": "Telecommunications",
    "url": "https://dossierpolitico.com/2025/10/15/satelites-sin-cifrado-exponen-secretos-de-la-guardia-nacional-cfe-telmex-y-el-mundo-una-antena-barata-basto-para-saberlo/"
  },
  {
    "timestamp": "2025-10-17T00:41:40",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Devman, un operador de ransomware, ha lanzado una plataforma Ransomware-as-a-Service (RaaS) en octubre de 2025, buscando reclutar afiliados. La plataforma permite la extorsión de empresas, incluyendo infraestructura crítica, con demandas d