[
  {
    "timestamp": "2024-10-06T10:30:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Red Hat, el gigante de software empresarial, está siendo extorsionado por la banda ShinyHunters tras una importante filtración de datos.\nLa brecha, atribuida a Crimson Collective, comprometió 570GB de información desde su instancia GitLab, incluyendo 800 Customer Engagement Reports (CERs).\nEstos CERs contienen datos sensibles de clientes como Walmart, HSBC, Bank of Canada y American Express.\nShinyHunters ha publicado muestras de los datos robados y exige un rescate antes del 10 de octubre.",
    "palabras_claves": [
      "Red Hat",
      "ShinyHunters",
      "filtración de datos",
      "extorsión",
      "Customer Engagement Reports"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://www.bleepingcomputer.com/news/security/red-hat-data-breach-escalates-as-shinyhunters-joins-extortion/"
  },
  {
    "timestamp": "2024-10-06T10:30:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Oracle ha lanzado un parche de emergencia para una vulnerabilidad crítica (CVE-2025-61882) en su E-Business Suite, explotada activamente por el grupo de ransomware Cl0p. Este grupo ha robado datos y exigido rescates millonarios, aprovechando la falla para lograr ejecución remota de código y robo de credenciales. La actividad delictiva, que podría implicar a FIN11, comenzó en septiembre de 2025 y está siendo investigada por Mandiant y Google. Se han identificado indicadores de compromiso.",
    "palabras_claves": [
      "Oracle",
      "Cl0p",
      "vulnerabilidad",
      "ransomware",
      "fuga de datos"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://securityaffairs.com/183029/security/oracle-patches-critical-e-business-suite-flaw-exploited-by-cl0p-hackers.html"
  },
  {
    "timestamp": "2025-10-06T22:18:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Discord ha revelado una brecha de seguridad en un proveedor externo de soporte al cliente. La filtración expuso datos de usuarios que contactaron a sus equipos de soporte, incluyendo nombres, correos electrónicos, IPs y detalles de facturación. También se vieron afectadas imágenes de identificación gubernamental. Discord afirma que sus sistemas no fueron accedidos directamente y ha notificado a las autoridades.",
    "palabras_claves": [
      "data breach",
      "Discord",
      "filtración de datos",
      "ciberseguridad",
      "datos de usuario"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://securityaffairs.com/183039/data-breach/discord-discloses-third-party-breach-affecting-customer-support-data.html"
  },
  {
    "timestamp": "2025-10-07T14:56:42",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Microsoft ha vinculado al grupo cibercriminal Storm-1175 con la explotación de una vulnerabilidad crítica (CVE-2025-10035) en el software Fortra GoAnywhere. Esta explotación ha llevado al despliegue del ransomware Medusa, permitiendo inyección de comandos, ejecución remota de código y exfiltración de datos. El ataque ha estado activo desde al menos septiembre de 2025, afectando a organizaciones que utilizan GoAnywhere MFT y generando críticas por la falta de transparencia de Fortra.",
    "palabras_claves": [
      "ransomware",
      "vulnerabilidad",
      "ciberataque",
      "explotación",
      "GoAnywhere"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/microsoft-links-storm-1175-to.html"
  },
  {
    "timestamp": "2025-10-07T14:59:32",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Nueva investigación de LayerX revela que las herramientas de IA son el principal canal de exfiltración de datos corporativos, superando a SaaS en la sombra. Datos sensibles, incluyendo PII y PCI, se pegan con frecuencia en plataformas de IA generativa a través de cuentas personales no gestionadas, haciendo ineficaces las herramientas DLP tradicionales. Esto subraya un colapso de gobernanza crítico y la necesidad de adaptar las estrategias de seguridad para tratar la IA como una categoría empresarial central.",
    "palabras_claves": [
      "data exfiltration",
      "inteligencia artificial",
      "fuga de datos",
      "ciberseguridad",
      "seguridad empresarial"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/new-research-ai-is-already-1-data.html"
  },
  {
    "timestamp": "2025-10-07T15:00:17",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Este webinar de Tines, en colaboración con AWS, aborda la orquestación de la Gestión de Identidad y Acceso (IAM) en entornos híbridos complejos.\nExplora por qué IAM falla y cómo modernizar los flujos de trabajo de identidad para reducir silos.\nEl objetivo es mantener la agilidad y una postura de seguridad sólida, mitigando el riesgo operacional.",
    "palabras_claves": [
      "IAM",
      "identidad",
      "orquestación",
      "riesgo operacional",
      "seguridad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thn.news/identity-sync"
  },
  {
    "timestamp": "2025-10-07T15:01:10",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El malware XWorm 6.0 ha regresado con más de 35 plugins y capacidades mejoradas para el robo de datos, keylogging y ransomware. Se propaga a través de correos electrónicos de phishing y ha sido visto distribuyendo otras familias de malware, comprometiendo más de 18,459 dispositivos globalmente. Su modularidad lo convierte en una herramienta versátil para diversas acciones maliciosas.",
    "palabras_claves": [
      "XWorm",
      "malware",
      "robo de datos",
      "phishing",
      "ransomware"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/xworm-60-returns-with-35-plugins-and.html"
  },
  {
    "timestamp": "2025-10-07T15:08:06",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Akira afirma haber comprometido a Lautrec, una empresa con sede en Estados Unidos y una oficina en Canadá.\nSe exfiltraron más de 18GB de datos, incluyendo documentos corporativos esenciales e información personal.\nLa información comprometida pertenece a empleados y clientes de la compañía.",
    "palabras_claves": [
      "Akira ransomware",
      "filtración de datos",
      "brecha de seguridad",
      "datos corporativos",
      "información personal"
    ],
    "pais": "Estados Unidos",
    "sector": "Inmobiliario",
    "url": "https://t.co/oxQqhYCeu2"
  },
  {
    "timestamp": "2025-10-07T15:35:20",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Google DeepMind ha lanzado CodeMender, una IA que detecta y corrige automáticamente vulnerabilidades en el código, incluso reescribiéndolo. Ha aplicado 72 parches a proyectos de código abierto. Google también introduce un programa de recompensas por vulnerabilidades de IA para abordar inyecciones de prompts y jailbreaks.",
    "palabras_claves": [
      "vulnerabilidades",
      "inteligencia artificial",
      "CodeMender",
      "seguridad de software",
      "parches de seguridad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/googles-new-ai-doesnt-just-find.html"
  },
  {
    "timestamp": "2025-10-07T17:37:11",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Se ha detectado un aumento masivo en los escaneos dirigidos a los portales de inicio de sesión de Palo Alto Networks GlobalProtect y PAN-OS. La compañía de ciberinteligencia GreyNoise reportó un incremento del 500% en direcciones IP únicas, principalmente de EE.UU. Esta actividad sugiere esfuerzos de reconocimiento que podrían preceder nuevos ataques con exploits. Palo Alto Networks ha declarado no haber encontrado evidencia de compromiso.",
    "palabras_claves": [
      "scans",
      "Palo Alto Networks",
      "reconocimiento",
      "vulnerabilidad",
      "exploit"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://www.bleepingcomputer.com/news/security/massive-surge-in-scans-targeting-palo-alto-networks-login-portals/"
  },
  {
    "timestamp": "2025-10-08T00:06:51",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo aborda los desafíos del análisis forense digital en entornos cloud (AWS, Azure, GCP) comparado con el tradicional.\nSe destacan complejidades en la identificación, recopilación y preservación de evidencia digital debido a la naturaleza distribuida y virtualizada de la nube.\nTambién se detallan errores comunes de configuración que causan brechas de seguridad y sus indicadores forenses.\nUna preparación adecuada, herramientas especializadas y buenas prácticas son clave para una respuesta efectiva a incidentes.",
    "palabras_claves": [
      "análisis forense digital",
      "entornos cloud",
      "ciberseguridad",
      "brechas de seguridad",
      "evidencia digital"
    ],
    "pais": "",
    "sector": "",
    "url": "https://dreamlab.net/es/blog/principales-desafios-del-analisis-forense-digital-en-entornos-cloud/"
  },
  {
    "timestamp": "2025-10-08T07:22:01",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "OpenAI ha desarticulado tres grupos de hackers respaldados por estados (Rusia, Corea del Norte, China) que utilizaban ChatGPT para desarrollar malware, robar credenciales y realizar campañas de phishing. Los actores también llevaron a cabo operaciones de influencia dirigidas, entre otros, a intereses de EE. UU. La acción de OpenAI busca prevenir incidentes y fugas de datos al bloquear las cuentas utilizadas para estos fines.",
    "palabras_claves": [
      "ciberataque",
      "malware",
      "phishing",
      "credenciales comprometidas",
      "hacking"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/openai-disrupts-russian-north-korean.html"
  },
  {
    "timestamp": "2025-10-08T08:06:05",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El foro del juego 'Shin Megami Tensei' sufrió una \nbrecha de seguridad que resultó en el robo de 200,000 correos\nelectrónicos únicos y contraseñas cifradas. Este incidente \ndestaca las continuas amenazas de ciberseguridad y la \nimportancia de la protección de datos en plataformas digitales.",
    "palabras_claves": [
      "databreach",
      "ciberseguridad",
      "fuga de datos",
      "hackeo",
      "darkweb"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://twitter.com/DailyDarkWeb/status/1975832876827500935"
  },
  {
    "timestamp": "2025-10-08T11:02:56",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Se ha revelado una vulnerabilidad crítica (CVE-2025-53967) en el servidor Figma MCP, que permite la ejecución remota de código y el robo de datos. El fallo es una inyección de comandos debido al uso de entrada de usuario sin sanear. Imperva descubrió la falla, la cual ya fue parcheada en la versión 0.6.3, lanzada el 29 de septiembre de 2025. Esta vulnerabilidad subraya los riesgos de las herramientas de desarrollo impulsadas por IA.",
    "palabras_claves": [
      "vulnerabilidad",
      "ejecución remota de código",
      "Figma",
      "inyección de comandos",
      "seguridad de software"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/severe-figma-mcp-vulnerability-lets.html"
  },
  {
    "timestamp": "2025-10-08T11:23:46",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Salesforce ha confirmado su decisión de no negociar ni pagar un rescate a los atacantes responsables de un reciente robo de datos generalizado. La compañía comunicó esta postura a sus clientes, desafiando las demandas del grupo de extorsión Scattered LAPSUS$ Hunters. Los atacantes han respondido públicamente, instando a Salesforce a negociar y advirtiendo a los 39 clientes afectados que lo hagan directamente, ya que su proveedor no los salvará.",
    "palabras_claves": [
      "Salesforce",
      "robo de datos",
      "ransom",
      "Scattered LAPSUS$ Hunters",
      "clientes afectados"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://t.co/11T9i3hI8L"
  },
  {
    "timestamp": "2025-10-08T12:13:07",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Sarcoma ha afirmado haber comprometido a Charter Industrial Supply, un distribuidor familiar con sede en EE. UU.\nSe robaron 67 GB de archivos y bases de datos SQL durante el ataque.\nLa empresa se especializa en mangueras y accesorios industriales e hidráulicos, sirviendo a diversos mercados.",
    "palabras_claves": [
      "Sarcoma ransomware",
      "Charter Industrial Supply",
      "filtración de datos",
      "bases de datos SQL",
      "ataque cibernético"
    ],
    "pais": "United States",
    "sector": "Industrial",
    "url": "https://t.co/A4bmlqtKnM"
  },
  {
    "timestamp": "2025-10-08T12:15:25",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "LockBit, Qilin y DragonForce, tres prominentes grupos de ransomware, han formado una nueva alianza estratégica para intensificar sus ataques. Qilin ha sido el grupo más activo en los últimos meses, focalizando sus operaciones en organizaciones de Norteamérica. Esta coalición busca mejorar sus capacidades operacionales y expandir las amenazas a nuevos sectores y regiones.",
    "palabras_claves": [
      "ransomware",
      "ciberataque",
      "LockBit",
      "Qilin",
      "DragonForce"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/lockbit-qilin-and-dragonforce-join.html"
  }
]