[
  {
    "timestamp": "2025-09-22T14:40:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La campaña de malware Shai-Hulud comprometió más de 180 paquetes de npm, incluyendo algunos de la empresa de ciberseguridad CrowdStrike, en un ataque a la cadena de suministro. Este malware auto-replicante roba credenciales de desarrolladores e infecta repositorios. El incidente destaca vulnerabilidades críticas en la gestión de dependencias de código abierto, impactando a empresas globalmente.",
    "palabras_claves": [
      "Shai-Hulud",
      "malware",
      "npm packages",
      "supply chain attack",
      "CrowdStrike"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://www.webpronews.com/shai-hulud-malware-hijacks-180-npm-packages-in-supply-chain-attack/"
  },
  {
    "timestamp": "2025-09-22T11:14:00-05:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La Oficina del Sheriff de la Parroquia de Orleans en Nueva Orleans, EE. UU., ha restaurado su sistema DocketMaster tras un ciberataque de ransomware. Este sistema, que permite el acceso público a registros judiciales y carcelarios, sufrió una interrupción, pero ahora está completamente operativo. El equipo de TI de la OPSO colaboró con socios de ciberseguridad locales, estatales y federales para su recuperación.",
    "palabras_claves": [
      "ciberataque",
      "ransomware",
      "DocketMaster",
      "Oficina del Sheriff",
      "restaurado"
    ],
    "pais": "USA",
    "sector": "Gobierno",
    "url": "https://ift.tt/kDr5pMY"
  },
  {
    "timestamp": "2025-09-22T17:14:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un nuevo método y herramienta de prueba de concepto, llamado EDR-Freeze, evade soluciones de seguridad como EDR y antivirus. Utiliza el sistema Windows Error Reporting (WER) de Microsoft para suspender procesos de seguridad desde el modo de usuario.\nLa técnica, descrita por el investigador TwoSevenOneThree (Zero Salarium), aprovecha una condición de carrera.\nFue probada exitosamente en Windows 11 24H2, congelando Windows Defender.\nAunque no es una vulnerabilidad directa, es una debilidad de diseño.",
    "palabras_claves": [
      "EDR",
      "EDR Bypass",
      "Endpoint Security",
      "Windows",
      "Security"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://ift.tt/WAwZUf4"
  }
]
