[
  {
    "timestamp": "2026-02-04T17:58:06",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Microsoft ha desarrollado un escáner ligero para detectar backdoors en modelos de lenguaje grandes (LLM) de código abierto. La herramienta busca señales internas distintivas en el comportamiento del modelo cuando se activan disparadores de ataque, como patrones de atención y fuga de datos de envenenamiento. Este avance busca mejorar la confianza en los sistemas de inteligencia artificial y no requiere entrenamiento adicional ni conocimiento previo del backdoor.",
    "palabras_claves": [
      "vulnerabilidad",
      "ciberataque",
      "inteligencia artificial",
      "backdoor",
      "prevención"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/microsoft-develops-scanner-to-detect.html"
  },
  {
    "timestamp": "2026-02-05T05:01:53",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores de ciberseguridad han descubierto una campaña activa de secuestro de tráfico web. Los atacantes explotan la vulnerabilidad React2Shell (CVE-2025-55182) para comprometer servidores NGINX y paneles de gestión Baota. Esto redirige el tráfico legítimo a servidores bajo su control, afectando TLDs asiáticos, gubernamentales y educativos, incluyendo .pe. Se utiliza un kit de herramientas con scripts para persistencia y para instalar configuraciones maliciosas, observándose post-explotación con cryptomining o reverse shells.",
    "palabras_claves": [
      "hackeo",
      "ciberataque",
      "vulnerabilidad",
      "NGINX",
      "React2Shell"
    ],
    "pais": "Perú",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/hackers-exploit-react2shell-to-hijack.html"
  },
  {
    "timestamp": "2026-02-05T06:29:08",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Se ha revelado una vulnerabilidad crítica (CVE-2026-25049) en la plataforma de automatización de flujos de trabajo n8n. Este fallo permite la ejecución de comandos arbitrarios del sistema a través de flujos de trabajo maliciosos, incluso por usuarios autenticados. La explotación exitosa puede llevar al compromiso del servidor, robo de credenciales y exfiltración de datos, afectando a cientos de miles de sistemas empresariales. Se recomienda la aplicación de parches y la restricción de permisos para mitigar el riesgo.",
    "palabras_claves": [
      "vulnerabilidad",
      "CVE",
      "ejecución de comandos",
      "n8n",
      "flujos de trabajo"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2026/02/critical-n8n-flaw-cve-2026-25049.html"
  },
  {
    "timestamp": "2026-02-05T08:06:11",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo predice 9 tendencias clave para la seguridad de la identidad en 2026. Se espera que la IA impulse la gobernanza de identidad y que los deepfakes fuercen el uso de biometría de \"vivacidad\". La autenticación sin contraseña será la norma, y la identidad será crucial para la seguridad OT/IoT y de máquinas. La computación cuántica exigirá nuevos estándares de cifrado y la seguridad de identidad se integrará en el desarrollo.",
    "palabras_claves": [
      "identity security",
      "AI",
      "deepfakes",
      "passwordless",
      "quantum computing"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/expert-insights/2026/02/9-identity-security-predictions-for-2026.html"
  },
  {
    "timestamp": "2026-02-05T13:09:30",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El boletín de ciberseguridad destaca tendencias clave en el panorama de amenazas. Se observa la industrialización del cibercrimen con infraestructuras compartidas y programas de afiliados, y ataques de suplantación de identidad a servicios en la nube y el sector financiero. También se reportan vulnerabilidades en plataformas de desarrollo como GitHub Codespaces y el uso de la IA para escalar privilegios en entornos cloud. La eficiencia operativa de los atacantes y la explotación de configuraciones legacy son hilos conductores.",
    "palabras_claves": [
      "ciberataque",
      "vulnerabilidad",
      "ransomware",
      "phishing",
      "ciberfraude"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/threatsday-bulletin-codespaces-rce.html"
  },
  {
    "timestamp": "2026-02-05T13:15:54",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo cibercriminal ShinyHunters ha comunicado el arresto de un segundo líder a través de su canal oficial de Telegram.\nAdicionalmente, se confirmó la suspensión de su cuenta de X, la cual no puede ser recuperada en este momento.\nEstos eventos sugieren una interrupción significativa en la estructura de liderazgo y presencia en línea del conocido grupo.",
    "palabras_claves": [
      "ShinyHunters",
      "líder",
      "arrestado",
      "Telegram",
      "X account"
    ],
    "pais": "",
    "sector": "",
    "url": "https://t.co/qQT833uRWu"
  },
  {
    "timestamp": "2026-02-05T17:50:05",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El botnet AISURU/Kimwolf lanzó un ataque DDoS récord de 31.4 Tbps en noviembre de 2025, detectado y mitigado por Cloudflare. Este incidente forma parte de un aumento significativo de los ataques DDoS, que se duplicaron en 2025. El botnet comprometió más de 2 millones de dispositivos Android, llevando a Google y Cloudflare a desmantelar la red de proxies IPIDEA. Los sectores más afectados incluyen telecomunicaciones y tecnología, con impacto en países como EE. UU. y Brasil.",
    "palabras_claves": [
      "botnet",
      "DDoS",
      "ciberataque",
      "malware",
      "Android"
    ],
    "pais": "",
    "sector": "Telecomunicaciones",
    "url": "https://thehackernews.com/2026/02/aisurukimwolf-botnet-launches-record.html"
  },
  {
    "timestamp": "2026-02-06T05:56:15",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El modelo de inteligencia artificial Claude Opus 4.6 de Anthropic ha descubierto más de 500 vulnerabilidades de alta gravedad en librerías de código abierto como Ghostscript y OpenSC. El LLM demuestra capacidades avanzadas en revisión y depuración de código sin herramientas especializadas. Las fallas identificadas ya han sido corregidas, destacando el potencial de la IA como herramienta crucial para la ciberdefensa y la mejora de tareas como análisis financieros.",
    "palabras_claves": [
      "inteligencia artificial",
      "vulnerabilidad",
      "ciberseguridad",
      "código abierto",
      "prevención"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/claude-opus-46-finds-500-high-severity.html"
  },
  {
    "timestamp": "2026-02-06T08:45:36",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Ciberinvestigadores descubrieron un ataque de cadena de suministro que comprometió paquetes de dYdX en npm y PyPI. Los atacantes distribuyeron versiones maliciosas con \"wallet stealers\" y malware RAT para robar credenciales de billeteras de criptomonedas. dYdX, un exchange descentralizado, alertó a los usuarios impactados a tomar medidas de seguridad urgentes. Este incidente sigue a ataques previos contra activos relacionados con dYdX.",
    "palabras_claves": [
      "ataque de cadena de suministro",
      "malware",
      "robo de credenciales",
      "dYdX",
      "criptomonedas"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/compromised-dydx-npm-and-pypi-packages.html"
  },
  {
    "timestamp": "2026-02-06T11:04:10",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Suno.com, una popular plataforma de generación de música con IA, ha sido presuntamente comprometida por una parte no autorizada. Un actor de amenazas está subastando una base de datos que afirma contener 60 millones de registros de usuarios y la organización completa de Git de la compañía, implicando el código fuente. La venta se describe como una \"única vez\" para el mejor postor.",
    "palabras_claves": [
      "comprometida",
      "base de datos",
      "registros de usuarios",
      "Git organization",
      "actor de amenazas"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://t.co/JKw4MPmsjf"
  },
  {
    "timestamp": "2026-02-06T12:09:41",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un grupo de ciberespionaje respaldado por un estado asiático, TGR-STA-1030, ha comprometido al menos 70 entidades gubernamentales y de infraestructura crítica en 37 países. El grupo ha estado activo desde enero de 2024, empleando correos de phishing y explotando vulnerabilidades N-day para desplegar malware como Diaoyu Loader y Cobalt Strike. Entre las víctimas se incluyen entidades de control fronterizo y ministerios de finanzas. TGR-STA-1030 mantiene acceso a las redes por meses para la recolección de inteligencia.",
    "palabras_claves": [
      "ciberespionaje",
      "ciberataque",
      "phishing",
      "malware",
      "vulnerabilidad"
    ],
    "pais": "",
    "sector": "Gobierno, Infraestructura Crítica, Financiero",
    "url": "https://thehackernews.com/2026/02/asian-state-backed-group-tgr-sta-1030.html"
  },
  {
    "timestamp": "2026-02-06T13:48:34",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La Agencia de Ciberseguridad y Seguridad de Infraestructura de EE. UU. (CISA) ha ordenado a las agencias federales remover dispositivos de red perimetrales sin soporte. El objetivo es reforzar la gestión del ciclo de vida de los activos y reemplazar equipos que no reciben actualizaciones de seguridad en 12 a 18 meses. Esta medida busca reducir la deuda técnica y mitigar riesgos de ciberataques de actores patrocinados por estados.",
    "palabras_claves": [
      "CISA",
      "ciberseguridad",
      "vulnerabilidad",
      "prevención",
      "redes federales"
    ],
    "pais": "USA",
    "sector": "",
    "url": "https://thehackernews.com/2026/02/cisa-orders-removal-of-unsupported-edge.html"
  },
  {
    "timestamp": "2026-02-08T07:48:12",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "OpenClaw ha integrado VirusTotal Scanning en su marketplace ClawHub para detectar habilidades maliciosas, tras el descubrimiento de cientos de ellas que podrían exfiltrar datos o inyectar backdoors. La iniciativa busca fortalecer la seguridad del ecosistema de agentes de IA, que presentan riesgos como la inyección de prompts y el acceso privilegiado a sistemas empresariales. China ha emitido una alerta sobre instancias mal configuradas de OpenClaw.",
    "palabras_claves": [
      "filtración de datos",
      "malware",
      "vulnerabilidad",
      "prompt injection",
      "ciberataque"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/openclaw-integrates-virustotal-scanning.html"
  },
  {
    "timestamp": "2026-02-09T08:12:45",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "BeyondTrust ha corregido una vulnerabilidad crítica de ejecución remota de código (RCE) pre-autenticación (CVE-2026-1731) en sus productos Remote Support y Privileged Remote Access. Esta falla, calificada con un CVSS de 9.9, podría permitir a un atacante no autenticado ejecutar comandos del sistema operativo. La explotación podría llevar a acceso no autorizado, exfiltración de datos y interrupción del servicio. La compañía insta a los clientes a aplicar los parches disponibles.",
    "palabras_claves": [
      "vulnerabilidad",
      "RCE",
      "BeyondTrust",
      "CVE-2026-1731",
      "exfiltración de datos"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2026/02/beyondtrust-fixes-critical-pre-auth-rce.html"
  },
  {
    "timestamp": "2026-02-09T09:29:15",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores han alertado sobre una campaña masiva de un gusano llamado TeamPCP, que explota infraestructuras cloud como Docker y Kubernetes para construir una plataforma de ciberdelincuencia. Este gusano es utilizado para exfiltrar datos, desplegar ransomware y realizar extorsiones. Los objetivos principales son entornos AWS y Microsoft Azure, afectando a empresas en varias regiones, incluyendo Canadá y EE.UU. La campaña se basa en vulnerabilidades conocidas y malas configuraciones.",
    "palabras_claves": [
      "gusano",
      "ciberataque",
      "filtración de datos",
      "ransomware",
      "vulnerabilidad"
    ],
    "pais": "U.S.",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/teampcp-worm-exploits-cloud.html"
  },
  {
    "timestamp": "2026-02-09T11:53:37",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Anubis ha reclamado haber comprometido a Rutherford Investment Company, una firma de inversión inmobiliaria en Estados Unidos. La brecha amenaza la reputación de la empresa y la confidencialidad de las transacciones de sus clientes. Los datos supuestamente comprometidos incluyen información financiera, afectando la privacidad de la firma. La compañía se especializa en comunidades de viviendas multifamiliares en California, Oregon y Washington.",
    "palabras_claves": [
      "Anubis ransomware group",
      "Rutherford Investment Company",
      "breach",
      "financial privacy",
      "real estate investment firm"
    ],
    "pais": "USA",
    "sector": "Inversión inmobiliaria",
    "url": "https://t.co/O5heEMnPKu"
  },
  {
    "timestamp": "2026-02-09T12:15:44",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La plataforma de análisis web de código abierto Matomo ha sido presuntamente comprometida.\nUn actor de amenazas ha puesto a la venta una base de datos supuestamente originada en matomo.org.\nLa filtración indica una exfiltración significativa de registros internos, aunque la autenticidad aún no ha sido confirmada.\nEl archivo comprometido se describe como un volcado de base de datos SQL.",
    "palabras_claves": [
      "Matomo",
      "comprometida",
      "base de datos",
      "exfiltración",
      "actor de amenazas"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://t.co/pMv2lQyEm1"
  },
  {
    "timestamp": "2026-02-09T12:43:37",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Farcaster, un protocolo de red social descentralizada desarrollado por Merkle Manufactory, ha sido supuestamente comprometido.\nLa filtración implica una base de datos significativa, etiquetada como “Farcaster Wallet”, que contiene perfiles de usuario y información de monederos de criptomonedas.\nLos datos, un conjunto JSON de 1.3 GB, habrían sido publicados en un servicio para compartir archivos a finales de 2025 y ahora están en circulación.",
    "palabras_claves": [
      "Farcaster",
      "comprometido",
      "filtración de datos",
      "cryptocurrency wallet",
      "datos de usuario"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://t.co/mqtkCaIM4i"
  },
  {
    "timestamp": "2026-02-09T16:37:22",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Threat actors exploited SolarWinds Web Help Desk vulnerabilities for remote code execution, enabling multi-stage intrusions. Microsoft observed these attacks, which involved lateral movement, credential theft (including DCSync), and persistence mechanisms. The U.S. CISA has added one of the exploited CVEs to its Known Exploited Vulnerabilities catalog. Organizations are advised to patch WHD instances, remove unauthorized RMM tools, and rotate credentials to mitigate risks.",
    "palabras_claves": [
      "SolarWinds",
      "vulnerabilidades",
      "ciberataque",
      "robo de credenciales",
      "ejecución de código remoto"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/solarwinds-web-help-desk-exploited-for.html"
  },
  {
    "timestamp": "2026-02-09T17:06:57",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo APT chino UNC3886 ha llevado a cabo una campaña de ciberespionaje dirigida al sector de telecomunicaciones de Singapur. Cuatro grandes operadores de telecomunicaciones fueron blanco de ataques sofisticados, utilizando exploits de día cero y rootkits para obtener acceso no autorizado. La Agencia de Ciberseguridad de Singapur (CSA) intervino sin que se reportara exfiltración de datos personales o interrupción de servicios.",
    "palabras_claves": [
      "ciberespionaje",
      "UNC3886",
      "telecomunicaciones",
      "zero-day",
      "APT"
    ],
    "pais": "Singapur",
    "sector": "Telecommunications",
    "url": "https://thehackernews.com/2026/02/china-linked-unc3886-targets-singapore.html"
  },
  {
    "timestamp": "2026-02-10T04:45:38",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Fortinet ha lanzado actualizaciones de seguridad para dos vulnerabilidades críticas en sus productos FortiClientEMS y FortiOS/FortiManager/FortiAnalyzer/FortiProxy/FortiWeb.\nUna vulnerabilidad (CVE-2026-21643) permite la ejecución de código arbitrario mediante SQL Injection.\nOtra vulnerabilidad (CVE-2026-24858) que permite acceso no autorizado, está siendo explotada activamente para crear cuentas de administrador, conceder acceso VPN y exfiltrar configuraciones de firewall.\nSe insta a los usuarios a aplicar los parches urgentemente para mitigar el riesgo de ciberataques.",
    "palabras_claves": [
      "vulnerabilidad",
      "ciberataque",
      "exploit",
      "filtración de datos",
      "Fortinet"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2026/02/fortinet-patches-critical-sqli-flaw.html"
  },
  {
    "timestamp": "2026-02-10T08:32:39",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Autoridades holandesas, incluyendo la Autoridad de Protección de Datos, confirmaron una filtración de datos tras ciberataques que explotaron vulnerabilidades zero-day (CVE-2026-1281 y CVE-2026-1340) en Ivanti Endpoint Manager Mobile (EPMM). Estos incidentes expusieron datos de contacto de empleados como nombres, correos y números de teléfono. La Comisión Europea y un proveedor de tecnología finlandés también reportaron ataques similares, evidenciando la explotación activa de estas vulnerabilidades en una plataforma de gestión empresarial.",
    "palabras_claves": [
      "vulnerabilidad",
      "zero-day",
      "exploit",
      "filtración de datos",
      "ciberataque"
    ],
    "pais": "Múltiple (Europa)",
    "sector": "Gubernamental",
    "url": "https://thehackernews.com/2026/02/dutch-authorities-confirm-ivanti-zero.html"
  },
  {
    "timestamp": "2026-02-10T09:19:57",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "WormGPT.AI, una plataforma de inteligencia artificial conocida por ofrecer modelos sin censura para hacking, ha sido supuestamente comprometida.\nRegistros detallados de más de 19,000 usuarios fueron filtrados en un foro de ciberdelincuencia.\nLa base de datos completa se ha puesto a disposición pública, revelando datos de los usuarios.\nLa filtración ocurrió en febrero de 2026, afectando a quienes utilizaron el servicio.",
    "palabras_claves": [
      "WormGPT.AI",
      "fuga de datos",
      "brecha de seguridad",
      "hacking",
      "ciberdelincuencia"
    ],
    "pais": "",
    "sector": "",
    "url": "https://t.co/Wp4OtLO8m9"
  },
  {
    "timestamp": "2026-02-10T10:40:30",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Warlock (Storm-2603) ha comprometido la red de SmarterTools, una empresa de software, el 29 de enero de 2026. La brecha se produjo al explotar vulnerabilidades sin parchear en un servidor SmarterMail. Los atacantes obtuvieron control del Active Directory y desplegaron ransomware, afectando a servidores Windows y clientes de SmarterTrack. La CISA y ReliaQuest han confirmado la explotación activa de estas fallas.",
    "palabras_claves": [
      "Warlock ransomware",
      "SmarterTools",
      "SmarterMail",
      "vulnerabilidad",
      "ciberataque"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/warlock-ransomware-breaches.html"
  },
  {
    "timestamp": "2026-02-10T14:07:47",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Según el informe Red Report 2026 de Picus Labs, los ciberatacantes están cambiando su estrategia de ataques disruptivos de ransomware a la persistencia silenciosa y la exfiltración de datos. La encriptación por impacto ha disminuido un 38% en 2025, mientras que el robo de credenciales es ahora una táctica principal. El 80% de las técnicas ATT&CK se centran en la evasión y el \"dwell time\" extendido. La IA se integra en el \"tradecraft\" existente, no lo redefine.",
    "palabras_claves": [
      "ransomware",
      "ciberataque",
      "filtración de datos",
      "credenciales comprometidas",
      "malware"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2026/02/from-ransomware-to-residency-inside.html"
  },
  {
    "timestamp": "2026-02-10T14:08:11",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La cumbre virtual gratuita Infosec Compliance Now 2026 abordará el futuro de la IA y el riesgo cibernético. Se centrará en la gobernanza de la IA, la gestión de riesgos cibernéticos, el monitoreo continuo de controles y la gestión de riesgos de terceros. Expertos de empresas como OpenAI y GitLab compartirán estrategias para mejorar la seguridad y el cumplimiento organizacional.",
    "palabras_claves": [
      "IA governance",
      "cyber risk management",
      "compliance",
      "continuous control monitoring",
      "third-party risk management"
    ],
    "pais": "",
    "sector": "Tecnología, Ciberseguridad, Finanzas",
    "url": "https://thn.news/infosec-risk-summit"
  },
  {
    "timestamp": "2026-02-10T14:59:15",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Instaladores falsos de 7-Zip están distribuyendo malware que convierte los PCs domésticos de las víctimas en nodos de una red de proxy residencial. Esta campaña utiliza un dominio falso y técnicas de ingeniería social, estableciendo el malware persistencia y evadiendo la detección. Estas redes de proxy suelen monetizarse para fraudes y otras actividades ilícitas.",
    "palabras_claves": [
      "malware",
      "ciberataque",
      "phishing",
      "troyano",
      "botnet"
    ],
    "pais": "",
    "sector": "",
    "url": "https://www.malwarebytes.com/blog/threat-intel/2026/02/fake-7-zip-downloads-are-turning-home-pcs-into-proxy-nodes?utm_campaign=brandsocial&utm_medium=social&utm_source=twitter"
  },
  {
    "timestamp": "2026-02-10T17:57:34",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Operativos de la República Popular Democrática de Corea (RPDC) se hacen pasar por profesionales en LinkedIn para infiltrarse en empresas, buscar beneficios económicos y financiar programas de armas. Utilizan solicitudes de empleo fraudulentas y campañas de 'entrevista contagiosa' para desplegar malware. Grupos de hackers norcoreanos también se enfocan en el robo de criptomonedas.",
    "palabras_claves": [
      "ciberataque",
      "ciberespionaje",
      "phishing",
      "malware",
      "criptomonedas"
    ],
    "pais": "",
    "sector": "Tecnología, Financiero",
    "url": "https://thehackernews.com/2026/02/dprk-operatives-impersonate.html"
  },
  {
    "timestamp": "2026-02-11T08:03:48",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El grupo de ciberdelincuentes UNC1069, vinculado a Corea del Norte, está atacando al sector de las criptomonedas. Utilizan señuelos generados por IA, videos deepfake y técnicas de ingeniería social para robar datos. Su objetivo final es el robo financiero, empleando nuevas familias de malware en sistemas Windows y macOS.",
    "palabras_claves": [
      "UNC1069",
      "criptomonedas",
      "ingeniería social",
      "malware",
      "fraude financiero"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/north-korea-linked-unc1069-uses-ai.html"
  },
  {
    "timestamp": "2026-02-11T09:05:45",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "ZAST.AI ha recaudado $6 millones en una ronda de financiación Pre-A para escalar su solución de seguridad de código impulsada por IA, que promete \"cero falsos positivos\". La tecnología de ZAST.AI descubre vulnerabilidades de día cero en proyectos de código abierto populares y genera automáticamente pruebas de concepto explotables. Esto ayuda a las empresas globales, incluidas las de Fortune Global 500, a reducir significativamente los ciclos de remediación de vulnerabilidades y los costos operativos de seguridad.",
    "palabras_claves": [
      "vulnerabilidad",
      "CVE",
      "0-day",
      "escalamiento de privilegios",
      "ciberseguridad"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/zastai-raises-6m-pre-to-scale-zero.html"
  },
  {
    "timestamp": "2026-02-11T09:53:58",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware BravoX ha listado seis nuevas organizaciones como víctimas en su sitio de filtración de datos.\nLos ataques afectaron empresas en Francia, Canadá y Estados Unidos.\nLos sectores incluyen servicios legales, procesamiento de alimentos, marketing, salud y manufactura.\nSe afirma que la información comprometida es extensa.",
    "palabras_claves": [
      "BravoX ransomware",
      "filtración de datos",
      "ciberataque",
      "organizaciones",
      "datos comprometidos"
    ],
    "pais": "",
    "sector": "",
    "url": "https://t.co/6whr6m0DI5"
  },
  {
    "timestamp": "2026-02-11T10:18:45",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Cl0p ha añadido 25 nuevas víctimas a su sitio de filtraciones en la dark web, señalando un aumento significativo en su actividad. Las organizaciones afectadas incluyen firmas de tecnología, inversión, servicios de TI, médicas y legales principalmente en EE. UU., Francia, India y Tailandia. El grupo afirma haber exfiltrado datos y amenaza con publicarlos pronto.",
    "palabras_claves": [
      "Cl0p ransomware",
      "filtración de datos",
      "ciberataque",
      "dark web",
      "organizaciones"
    ],
    "pais": "USA",
    "sector": "",
    "url": "https://t.co/GVGi6LM6mr"
  },
  {
    "timestamp": "2026-02-11T10:41:00",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Microsoft lanzó actualizaciones de seguridad para 59 vulnerabilidades, incluyendo seis zero-days explotados activamente en febrero de 2026. Estas actualizaciones abordan fallos críticos como escalamiento de privilegios, ejecución remota de código y suplantación en sus productos de software. La CISA ha añadido estas vulnerabilidades a su catálogo de riesgos conocidos. Además, Microsoft introduce iniciativas como Windows Baseline Security Mode para reforzar la seguridad del sistema.",
    "palabras_claves": [
      "vulnerabilidad",
      "ciberataque",
      "0-day",
      "escalamiento de privilegios",
      "exploit"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/microsoft-patches-59-vulnerabilities.html"
  },
  {
    "timestamp": "2026-02-11T11:36:18",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Telemon SRL, un Proveedor de Servicios de Internet (ISP) de República Dominicana, ha sido presuntamente comprometido en un incidente de extracción de datos. Un actor de amenazas liberó una base de datos robada, afectando a más de 42,000 usuarios. La información comprometida implica una fuga de datos significativa de la compañía.",
    "palabras_claves": [
      "data scrape",
      "filtración de datos",
      "ISP",
      "Telemon SRL",
      "República Dominicana"
    ],
    "pais": "República Dominicana",
    "sector": "Telecomunicaciones",
    "url": "https://t.co/5CXGji5wKT"
  },
  {
    "timestamp": "2026-02-11T11:42:47",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Semgrep anuncia su evento \"Semgrep Secure 2026\" para el 25 de febrero de 2026, enfocado en la seguridad del código para la era de la IA.\nSe presentará un motor AppSec multimodal que combina análisis determinista con razonamiento LLM.\nEl objetivo es eliminar falsos positivos y mejorar la detección de vulnerabilidades más allá de las herramientas SAST tradicionales.\nEsta innovación está dirigida a industrias como Fintech y SaaS & Cloud para reforzar la seguridad de las aplicaciones.",
    "palabras_claves": [
      "ciberseguridad",
      "IA",
      "vulnerabilidades",
      "SAST",
      "fintech"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thn.news/semgrep-secure-2026"
  },
  {
    "timestamp": "2026-02-11T14:22:06",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Esta guía analiza cinco ataques de ransomware significativos, incluyendo casos de Boeing, Ascension y Blue Yonder. Detalla cómo se desarrollaron estos incidentes, sus impactos empresariales y operativos, y ofrece inteligencia accionable. El objetivo es ayudar a los líderes de ciberseguridad a anticipar amenazas y fortalecer la resiliencia organizacional contra futuros ataques.",
    "palabras_claves": [
      "ransomware",
      "ciberataques",
      "resiliencia",
      "ciberseguridad",
      "organizaciones"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thn.news/attacks-changed-everything"
  },
  {
    "timestamp": "2026-02-12T01:55:23",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas está ofreciendo a la venta acceso no autorizado al firewall de una Agencia de Respuesta a Emergencias del Gobierno colombiano. La oferta incluye acceso Root RCE, shell y al panel de administración de red. Este incidente de seguridad afecta a una entidad gubernamental crítica en América Latina.",
    "palabras_claves": [
      "ciberataque",
      "gobierno",
      "firewall",
      "acceso no autorizado",
      "Colombia"
    ],
    "pais": "Colombia",
    "sector": "Gobierno",
    "url": "https://breachforums.bf/Thread-Colombian-Government-Emergency-Response-Agency"
  },
  {
    "timestamp": "2026-02-12T05:55:48",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Apple ha lanzado actualizaciones de seguridad para iOS, iPadOS, macOS, tvOS, watchOS y visionOS para corregir una vulnerabilidad de día cero (CVE-2026-20700) que ha sido activamente explotada. La falla, una corrupción de memoria en dyld, podría permitir la ejecución de código arbitrario en dispositivos afectados. Apple confirmó que la vulnerabilidad ha sido utilizada en ataques sofisticados dirigidos a individuos específicos. Google Threat Analysis Group (TAG) se le atribuye el descubrimiento y el informe de la vulnerabilidad.",
    "palabras_claves": [
      "Apple",
      "zero-day",
      "vulnerabilidad",
      "ciberataques",
      "código arbitrario"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/apple-fixes-exploited-zero-day.html"
  },
  {
    "timestamp": "2026-02-12T08:43:01",
    "categoria": "Noticias Locales (Chile) sobre Ciberfraude / Ciberataques",
    "resumen": "El grupo de ransomware Qilin ha afirmado haber comprometido varias organizaciones en América. Entre las víctimas se encuentran empresas de EE.UU., México y dos compañías chilenas: Conectados Chile S.A. y Ducasse Comercial Ltda. Qilin alega haber exfiltrado datos de estas entidades, aunque el recuento de archivos varía.",
    "palabras_claves": [
      "Qilin ransomware",
      "comprometido",
      "exfiltración de datos",
      "ciberataque",
      "Chile"
    ],
    "pais": "Chile",
    "sector": "",
    "url": "https://t.co/oBmYg8PHzt"
  },
  {
    "timestamp": "2026-02-12T09:19:28",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La plataforma CryptoXScanner ha sido presuntamente comprometida, resultando en la exposición de su base de datos de usuarios. Un actor de amenazas afirmó haber republicado los datos de 14,000 registros, que incluyen información personal. La brecha se habría producido el 11 de febrero de 2026 y los datos se intentaron vender por $300 en X.",
    "palabras_claves": [
      "CryptoXScanner",
      "exposición de datos",
      "base de datos",
      "ciberataque",
      "criptomoneda"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://t.co/MG6RaXs2oC"
  },
  {
    "timestamp": "2026-02-12T10:43:25",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La plataforma brasileña Repediu ha sido comprometida, resultando en la filtración de un vasto conjunto de datos.\nEl incidente, fechado en febrero de 2026, expuso información de más de 21.4 millones de clientes y 2,600 usuarios internos.\nLos datos incluyen registros detallados de clientes, leads y usuarios, publicados en un foro de ciberdelincuencia.\nAfecta a empresas del sector de gestión de restaurantes y entrega de alimentos, como ZigPay + WiFire.",
    "palabras_claves": [
      "Repediu",
      "filtración de datos",
      "ciberdelincuencia",
      "clientes",
      "Brasil"
    ],
    "pais": "Brasil",
    "sector": "Gestión de restaurantes y entrega de alimentos",
    "url": "https://t.co/D8lsAk0SxE"
  },
  {
    "timestamp": "2026-02-12T11:23:45",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Este white paper de Filigran presenta una guía práctica de defensa basada en inteligencia de amenazas. Detalla un proceso de seis etapas para alinear operaciones de seguridad con comportamientos de adversarios del mundo real. Aborda la priorización de defensas, la simulación de amenazas y la operacionalización de la inteligencia utilizando OpenCTI y OpenAEV. Busca mejorar la detección y respuesta continua.",
    "palabras_claves": [
      "Threat-Informed Defense",
      "ciberseguridad",
      "inteligencia de amenazas",
      "OpenCTI",
      "OpenAEV"
    ],
    "pais": "",
    "sector": "Ciberseguridad",
    "url": "https://thn.news/practical-threat-defense"
  },
  {
    "timestamp": "2026-02-12T11:53:55",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El boletín de The Hacker News del 12 de febrero de 2026 detalla múltiples amenazas y vulnerabilidades de ciberseguridad, incluyendo un RCE por prompt de IA y nuevos \"stealers\". Se destacan los ataques del troyano bancario Mispadu en México y Brasil, una estafa de criptomonedas de $73.6M, y el grupo de ransomware Coinbase Cartel. También se abordan vulnerabilidades en sistemas como Notepad y Google Looker.",
    "palabras_claves": [
      "ciberataque",
      "vulnerabilidad",
      "ransomware",
      "ciberfraude",
      "phishing"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/threatsday-bulletin-ai-prompt-rce.html"
  },
  {
    "timestamp": "2026-02-12T13:41:49",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Un estudio de 2026 revela que el 84% de los programas de seguridad empresarial están rezagados por no adoptar la Gestión Continua de Exposición a Amenazas (CTEM).\nLas organizaciones con CTEM muestran un 50% más de visibilidad de la superficie de ataque y mejor conciencia de amenazas.\nA pesar de una alta conciencia (87%), solo el 16% lo ha implementado debido a la inercia organizacional y prioridades contrapuestas.\nEsto subraya la importancia de CTEM para la resiliencia en ciberseguridad ante el aumento de ataques y costos de brechas.",
    "palabras_claves": [
      "Continuous Threat Exposure Management",
      "CTEM",
      "cybersecurity",
      "attack surface visibility",
      "breach prevention"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/the-ctem-divide-why-84-of-security.html"
  },
  {
    "timestamp": "2026-02-12T17:42:02",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores de ciberseguridad descubrieron el primer add-in malicioso para Microsoft Outlook, denominado 'AgreeToSteal', que robó más de 4,000 credenciales de Microsoft. El ataque explotó un add-in legítimo abandonado, reclamando su dominio expirado para alojar una página de inicio de sesión falsa. Este incidente subraya la vulnerabilidad en la cadena de suministro de los mercados de aplicaciones y la necesidad de un monitoreo continuo del contenido. La situación es preocupante debido a los permisos de los add-ins de Office y la confianza implícita en la tienda de Microsoft.",
    "palabras_claves": [
      "malicious Outlook add-in",
      "credenciales comprometidas",
      "ataque de cadena de suministro",
      "phishing",
      "brecha de seguridad"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/first-malicious-outlook-add-in-found.html"
  },
  {
    "timestamp": "2026-02-12T18:25:32",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El artículo revela que más del 90% de los dominios aparcados redirigen a contenido malicioso, estafas o malware. Esto ocurre mediante typosquatting y dominios expirados, donde se perfila al usuario para enviarlo a sitios fraudulentos. Infoblox descubrió que estas redirecciones a menudo afectan a IPs residenciales, citando a Scotiabank como ejemplo. Esta tendencia global subraya un riesgo creciente en la navegación directa.",
    "palabras_claves": [
      "parked domains",
      "typosquatting",
      "malware",
      "ciberfraude",
      "vulnerabilidad"
    ],
    "pais": "",
    "sector": "",
    "url": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/"
  },
  {
    "timestamp": "2026-02-12T18:28:15",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Google reporta que hackers patrocinados por estados (Corea del Norte, China, Irán) y grupos criminales están utilizando su IA Gemini para reconocimiento, ingeniería social y desarrollo de malware. Se destaca el uso por UNC2970 para perfilar objetivos de defensa y seguridad, y por UNC5356 con kits de phishing para robar credenciales de intercambios de criptomonedas. La IA es clave en la aceleración de ataques cibernéticos y la extracción de modelos.",
    "palabras_claves": [
      "hackers",
      "Gemini AI",
      "ciberataque",
      "phishing",
      "malware"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/google-reports-state-backed-hackers.html"
  },
  {
    "timestamp": "2026-02-12T18:41:52",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware The Gentlemen ha listado nuevas presuntas víctimas en su sitio de filtraciones en la dark web.\nEntre las organizaciones afectadas se encuentra Clark Foam Products, una empresa especializada en fabricación de espuma con sede en Estados Unidos.\nLas víctimas abarcan diversos sectores, incluyendo el aeroespacial, automotriz, médico y de empaques.",
    "palabras_claves": [
      "ransomware",
      "The Gentlemen",
      "Clark Foam Products",
      "dark web",
      "filtración de datos"
    ],
    "pais": "USA",
    "sector": "Fabricación",
    "url": "https://t.co/vkLns5qVx3"
  },
  {
    "timestamp": "2026-02-12T19:29:16",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "FIRST pronostica un aumento significativo en las vulnerabilidades publicadas (CVEs) para 2026, con una estimación mediana de 59,000.\nEste aumento exige a los equipos de seguridad preparar y dimensionar su capacidad de gestión de parches y detección.\nEl pronóstico, que incluye un rango de incertidumbre, busca optimizar la planificación estratégica y operativa.\nEs fundamental para la prevención y respuesta ante ciberamenazas futuras.",
    "palabras_claves": [
      "vulnerabilidad",
      "CVEs",
      "forecast",
      "patch management",
      "capacity planning"
    ],
    "pais": "",
    "sector": "",
    "url": "https://go.first.org/NvZWb"
  },
  {
    "timestamp": "2026-02-13T08:46:23",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores han detectado la explotación en vivo de una vulnerabilidad crítica (CVSS 9.9, CVE-2026-1731) en los productos BeyondTrust Remote Support y Privileged Remote Access. Esta falla permite a un atacante no autenticado ejecutar comandos del sistema operativo de forma remota, lo que podría conducir a acceso no autorizado y exfiltración de datos. La CISA de EE. UU. ha añadido cuatro vulnerabilidades adicionales a su catálogo KEV, incluyendo fallas en Apple iOS, Notepad++, SolarWinds y Microsoft Configuration Manager, destacando la rapidez con la que los ciberatacantes aprovechan las nuevas debilidades.",
    "palabras_claves": [
      "vulnerabilidad",
      "explotación",
      "ejecución de código remoto",
      "ciberataque",
      "filtración de datos"
    ],
    "pais": "U.S.",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/researchers-observe-in-wild.html"
  },
  {
    "timestamp": "2026-02-13T10:51:37",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "npm implementó una revisión de autenticación en diciembre de 2025 para reducir ataques a la cadena de suministro, usando tokens de sesión y MFA por defecto. Persisten vulnerabilidades debido al phishing de MFA y la MFA opcional. Se recomienda la adopción universal de OIDC y la obligatoriedad de MFA para uploads locales, para fortalecer la seguridad de la comunidad Node.js.",
    "palabras_claves": [
      "npm",
      "supply-chain",
      "autenticación",
      "MFA",
      "phishing"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/npms-update-to-harden-their-supply.html"
  },
  {
    "timestamp": "2026-02-13T11:43:27",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores han descubierto múltiples extensiones maliciosas de Google Chrome. Estas extenciones roban datos de negocio, incluyendo códigos 2FA de Meta Business Suite, contactos y datos analíticos. También se identificaron extensiones que secuestran cuentas de VKontakte y otras, disfrazadas de asistentes de IA, exfiltran credenciales y contenido de correos electrónicos de Gmail. Un informe adicional reveló 287 extensiones que envían el historial de navegación a corredores de datos.",
    "palabras_claves": [
      "ciberataque",
      "extensiones maliciosas",
      "filtración de datos",
      "robo de identidad",
      "Chrome"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/malicious-chrome-extensions-caught.html"
  },
  {
    "timestamp": "2026-02-13T13:24:13",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Dragonforce ha reivindicado la autoría de la intrusión en dos empresas en Estados Unidos: Yelete Group Inc (confección) y Empire Express (transporte).\nUtilizando tácticas de doble extorsión, el grupo amenazó con liberar una cantidad sustancial de datos robados.\nSe exfiltró una cantidad significativa de información de ambas organizaciones.\nEste incidente resalta la amenaza continua del ransomware para diversas industrias.",
    "palabras_claves": [
      "Dragonforce",
      "ransomware",
      "brecha de seguridad",
      "fuga de datos",
      "doble extorsión"
    ],
    "pais": "Estados Unidos",
    "sector": "",
    "url": "https://t.co/bgf25lmZtG"
  },
  {
    "timestamp": "2026-02-13T13:27:15",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Silent Push descubrió una VPN china sospechosa que utiliza proxies residenciales para ocultar el origen real del tráfico. Esta VPN es utilizada en varias regiones, incluyendo Venezuela, para actividades maliciosas como el empleo fraudulento y eludir los controles de KYC/AML. La investigación resalta la importancia de la visibilidad del origen del tráfico para la prevención del fraude y el cumplimiento normativo contra actores patrocinados por estados.",
    "palabras_claves": [
      "VPN",
      "proxies",
      "ciberfraude",
      "KYC",
      "AML"
    ],
    "pais": "Venezuela",
    "sector": "Financiero",
    "url": "https://www.silentpush.com/blog/traffic-origin-chinese-vpn/"
  },
  {
    "timestamp": "2026-02-13T15:30:40",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El grupo de amenazas UAT-9921 está utilizando el nuevo malware VoidLink para atacar los sectores de tecnología y servicios financieros. VoidLink es un framework modular diseñado para acceso sigiloso a entornos de nube basados en Linux. Se cree que parte de su desarrollo fue asistido por modelos de lenguaje grandes (LLMs), lo que facilita la creación de malware avanzado. La actividad de este actor se remonta a septiembre de 2025, indicando una campaña en curso con capacidades avanzadas de evasión de detección.",
    "palabras_claves": [
      "malware",
      "ciberataque",
      "VoidLink",
      "sector financiero",
      "tecnología"
    ],
    "pais": "",
    "sector": "financiero",
    "url": "https://thehackernews.com/2026/02/uat-9921-deploys-voidlink-malware-to.html"
  },
  {
    "timestamp": "2026-02-13T15:44:33",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Este informe de SANS Institute de 2025 analiza las tendencias clave y las brechas de capacidad en la seguridad de sistemas de control industrial (ICS/OT). Destaca cómo las organizaciones de infraestructura crítica se adaptan a amenazas crecientes, mandatos regulatorios y un panorama operativo complejo para fortalecer la resiliencia en entornos industriales.",
    "palabras_claves": [
      "ciberseguridad",
      "ICS/OT",
      "infraestructura crítica",
      "amenazas",
      "resiliencia"
    ],
    "pais": "",
    "sector": "Infraestructura Crítica",
    "url": "https://thn.news/sans-ot-report"
  },
  {
    "timestamp": "2026-02-13T16:39:28",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Google Threat Intelligence Group (GTIG) ha revelado que grupos patrocinados por estados de China, Irán, Corea del Norte y Rusia están atacando el sector de la base industrial de defensa (DIB). Los ataques se centran en entidades que utilizan tecnología en la guerra Rusia-Ucrania, la explotación de procesos de contratación, el uso de dispositivos de borde como puntos de acceso inicial y el riesgo de la cadena de suministro en el sector manufacturero. Actores como APT44 (Sandworm) y Lazarus Group están involucrados en estas operaciones de ciberespionaje.",
    "palabras_claves": [
      "ciberataque",
      "ciberespionaje",
      "malware",
      "APT",
      "filtración de datos"
    ],
    "pais": "USA",
    "sector": "Defensa",
    "url": "https://thehackernews.com/2026/02/google-links-china-iran-russia-north.html"
  },
  {
    "timestamp": "2026-02-13T17:42:41",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Google ha vinculado a un actor de amenaza ruso no documentado con ataques de malware CANFAIL contra organizaciones ucranianas. Las campañas de phishing suplantan a entidades energéticas para obtener acceso no autorizado a cuentas de correo electrónico. Los objetivos incluyen sectores de defensa, militar, gobierno y energía. Este actor utiliza modelos de lenguaje grande (LLMs) para reconocimiento y creación de señuelos.",
    "palabras_claves": [
      "ciberataque",
      "malware",
      "phishing",
      "ingeniería social",
      "brecha de seguridad"
    ],
    "pais": "Ukraine",
    "sector": "Gobierno",
    "url": "https://thehackernews.com/2026/02/google-ties-suspected-russian-actor-to.html"
  },
  {
    "timestamp": "2026-02-15T14:28:36",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Microsoft ha revelado detalles de una nueva táctica de ingeniería social, ClickFix, que utiliza búsquedas DNS (`nslookup`) para la preparación de malware. La técnica engaña a los usuarios para que ejecuten comandos que descargan cargas útiles, evadiendo controles de seguridad. Variantes como ModeloRAT, Lumma Stealer y StealC son distribuidas, con infecciones en varias regiones, incluyendo EE.UU., Brasil y México. La efectividad de ClickFix radica en el abuso de la confianza procedimental del usuario, y se ha observado el robo de criptomonedas.",
    "palabras_claves": [
      "ingeniería social",
      "malware",
      "DNS",
      "phishing",
      "ClickFix"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2026/02/microsoft-discloses-dns-based-clickfix.html"
  },
  {
    "timestamp": "2026-02-15T23:58:07",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una vulnerabilidad crítica de día cero (CVE-2026-2441) en el componente CSS de Google Chrome está siendo explotada activamente. Google ha lanzado una actualización de seguridad urgente para parchear esta falla de alta gravedad. Los atacantes pueden ejecutar código malicioso haciendo que los usuarios visiten páginas web comprometidas debido a un error de corrupción de memoria de \"uso después de liberar\". Se insta a los usuarios a actualizar sus navegadores de inmediato.",
    "palabras_claves": [
      "zero-day",
      "CVE-2026-2441",
      "exploit",
      "vulnerabilidad",
      "Chrome"
    ],
    "pais": "",
    "sector": "",
    "url": "https://securityonline.info/critical-alert-chrome-zero-day-cve-2026-2441-exploited-in-the-wild/"
  },
  {
    "timestamp": "2026-02-16T11:39:49",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Investigadores han descubierto ZeroDayRAT, un nuevo spyware móvil multiplataforma (Android/iOS) vendido en Telegram. Este software permite vigilancia en tiempo real, robo de credenciales y fraude financiero directo, atacando aplicaciones de banca móvil y billeteras de criptomonedas como MetaMask, Apple Pay y Google Pay. La plataforma representa una creciente amenaza con sofisticadas capacidades de exfiltración de datos y manipulación de transacciones.",
    "palabras_claves": [
      "ZeroDayRAT",
      "spyware",
      "fraude financiero",
      "Android",
      "iOS"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2026/02/new-zerodayrat-mobile-spyware-enables.html"
  }
]