[
  {
    "timestamp": "2025-09-22T14:40:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La campaña de malware Shai-Hulud comprometió más de 180 paquetes de npm, incluyendo algunos de la empresa de ciberseguridad CrowdStrike, en un ataque a la cadena de suministro. Este malware auto-replicante roba credenciales de desarrolladores e infecta repositorios. El incidente destaca vulnerabilidades críticas en la gestión de dependencias de código abierto, impactando a empresas globalmente.",
    "palabras_claves": [
      "Shai-Hulud",
      "malware",
      "npm packages",
      "supply chain attack",
      "CrowdStrike"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://www.webpronews.com/shai-hulud-malware-hijacks-180-npm-packages-in-supply-chain-attack/"
  },
  {
    "timestamp": "2025-09-22T11:14:00-05:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La Oficina del Sheriff de la Parroquia de Orleans en Nueva Orleans, EE. UU., ha restaurado su sistema DocketMaster tras un ciberataque de ransomware. Este sistema, que permite el acceso público a registros judiciales y carcelarios, sufrió una interrupción, pero ahora está completamente operativo. El equipo de TI de la OPSO colaboró con socios de ciberseguridad locales, estatales y federales para su recuperación.",
    "palabras_claves": [
      "ciberataque",
      "ransomware",
      "DocketMaster",
      "Oficina del Sheriff",
      "restaurado"
    ],
    "pais": "USA",
    "sector": "Gobierno",
    "url": "https://ift.tt/kDr5pMY"
  },
  {
    "timestamp": "2025-09-22T17:14:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un nuevo método y herramienta de prueba de concepto, llamado EDR-Freeze, evade soluciones de seguridad como EDR y antivirus. Utiliza el sistema Windows Error Reporting (WER) de Microsoft para suspender procesos de seguridad desde el modo de usuario.\nLa técnica, descrita por el investigador TwoSevenOneThree (Zero Salarium), aprovecha una condición de carrera.\nFue probada exitosamente en Windows 11 24H2, congelando Windows Defender.\nAunque no es una vulnerabilidad directa, es una debilidad de diseño.",
    "palabras_claves": [
      "EDR",
      "EDR Bypass",
      "Endpoint Security",
      "Windows",
      "Security"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://ift.tt/WAwZUf4"
  },
  {
    "timestamp": "2025-05-15",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un ciberataque ha provocado la cancelación de más de la mitad de los vuelos desde el Aeropuerto de Bruselas y retrasos en otros aeropuertos europeos. El incidente afectó a Collins Aerospace, un proveedor de sistemas de software con sede en EE. UU., que gestiona el check-in y la entrega de equipaje. La compañía reportó una \"disrupción cibernética\" en su software, limitando las operaciones de check-in electrónico. Se están utilizando sistemas de respaldo y operaciones manuales para mitigar el impacto, mientras se investiga el origen del ataque.",
    "palabras_claves": [
      "ciberataque",
      "disrupción cibernética",
      "Collins Aerospace",
      "aeropuertos",
      "check-in"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://ift.tt/Bhf62sD"
  },
  {
    "timestamp": "2025-09-22",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "American Income Life (AIL), una importante aseguradora estadounidense, sufrió una presunta fuga de datos, con atacantes afirmando haber robado cientos de miles de registros de clientes. La información expuesta incluye nombres, fechas de nacimiento, direcciones, contactos y detalles del seguro. Estos datos podrían ser usados para robo de identidad y ataques de phishing dirigidos. La brecha aún no ha sido confirmada por AIL, pero Cybernews verificó la consistencia de la muestra de datos.",
    "palabras_claves": [
      "fuga de datos",
      "robo de identidad",
      "phishing",
      "ciberataque",
      "datos personales"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://cybernews.com/security/american-income-life-data-breach-claims/"
  },
  {
    "timestamp": "2025-09-22T17:48:13Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Stellantis, un fabricante de automóviles global, investiga una filtración de datos. El incidente afectó una plataforma de un proveedor externo que soporta operaciones de servicio al cliente en Norteamérica. Se expuso información de contacto de clientes, pero no datos financieros o sensibles. Stellantis ha iniciado una investigación, notificado a las autoridades y está informando a los clientes afectados, aconsejándoles estar atentos a intentos de phishing.",
    "palabras_claves": [
      "data breach",
      "Stellantis",
      "proveedor externo",
      "información de contacto",
      "ciberseguridad"
    ],
    "pais": "USA",
    "sector": "Automotriz",
    "url": "https://ift.tt/89Vdj3I"
  },
  {
    "timestamp": "2025-09-22T18:11:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Hackers están explotando modelos de IA como GPT-4 para desarrollar malware autónomo, incluyendo \"MalTerminal\", que genera ransomware y vulnera redes. Esta evolución democratiza el cibercrimen, permitiendo ataques sofisticados con menos conocimientos técnicos. La situación exige una gobernanza de IA urgente y el fortalecimiento de la seguridad para mitigar estas amenazas crecientes y prevenir el caos digital. Expertos advierten sobre el uso de LLMs para supercargar amenazas internas y escalar incidentes cibernéticos globales.",
    "palabras_claves": [
      "hackers",
      "ciberataque",
      "malware",
      "ransomware",
      "inteligencia artificial"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/EYcebiJ"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un adolescente fue acusado en EE. UU. por su presunta implicación en los ciberataques de Scattered Spider contra los operadores de casinos Caesars Entertainment y MGM Resorts en septiembre de 2023.\nLos ataques, basados en ingeniería social, llevaron al reinicio de MFA y acceso a sistemas, causando pérdidas de $100 millones a MGM.\nTambién se exfiltraron datos personales de los programas de fidelidad de Caesars.\nEl acusado enfrenta múltiples cargos, incluyendo extorsión y actos ilícitos informáticos.",
    "palabras_claves": [
      "Scattered Spider",
      "ciberataques",
      "ingeniería social",
      "ransomware",
      "filtración de datos"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://ift.tt/Cn5pXoc"
  },
  {
    "timestamp": "2025-09-22T19:24:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La empresa Wallarm, destacada en Black Hat 2025, presenta innovaciones en seguridad de APIs y el impacto de la IA en ciberseguridad. Su co-fundador, Stepan Ilyin, subraya la creciente sofisticación de los ataques automatizados a APIs. Wallarm ofrece soluciones integrales para el descubrimiento, evaluación y protección de APIs. Esta tecnología es crucial para la seguridad de sistemas empresariales, incluyendo servicios financieros.",
    "palabras_claves": [
      "ciberseguridad",
      "API security",
      "inteligencia artificial",
      "vulnerabilidad",
      "protección de amenazas"
    ],
    "pais": "USA",
    "sector": "Financiero",
    "url": "https://ift.tt/KyW5udf"
  },
  {
    "timestamp": "2025-09-22 19:51:00 UTC",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Sky Airline, la segunda aerolínea más grande de Chile, sufrió una filtración de datos. Un actor no identificado publicó 10GB de datos de la empresa, probablemente una copia de seguridad de WordPress, en un foro de hacking. La información exfiltrada está disponible para descarga pública.",
    "palabras_claves": [
      "data breach",
      "Sky Airline",
      "Chile",
      "hacking",
      "filtración de datos"
    ],
    "pais": "Chile",
    "sector": "Aerolínea",
    "url": "https://dailydarkweb.net/sky-airline-data-breach-exposes-10gb-of-company-data/"
  },
  {
    "timestamp": "2024-07-29T10:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una vulnerabilidad de \"Insecure Direct Object Reference\" (IDOR) en el sitio web del Archivo Americano de Radiodifusión Pública (AAPB) permitió la descarga no autorizada de contenido multimedia protegido durante años.\nLa falla, explotada desde al menos 2021 y circulando en comunidades de archivado digital desde mediados de 2024, fue discretamente parcheada este mes.\nEsta brecha de seguridad en la organización estadounidense, operada por la Fundación Educativa WGBH y la Biblioteca del Congreso, expuso material privado.\nNo se conoce la cantidad total de contenido accedido y compartido antes del parche.",
    "palabras_claves": [
      "vulnerabilidad",
      "filtración de datos",
      "IDOR",
      "brecha de seguridad",
      "contenido protegido"
    ],
    "pais": "Estados Unidos",
    "sector": "Cultura y Medios",
    "url": "https://ift.tt/FXqRMja"
  },
  {
    "timestamp": "2025-09-22T20:51:00Z",
    "categoria": "Noticias Locales (Chile) sobre Ciberfraude / Ciberataques",
    "resumen": "La Agencia Nacional de Ciberseguridad (ANCI) de Chile publicó una lista preliminar de 1.712 Operadores de Importancia Vital (OIV).\nEstos incluyen instituciones públicas y privadas de sectores críticos como energía, salud, telecomunicaciones, servicios digitales, servicios financieros y el Estado.\nLos OIV tendrán la obligación de notificar incidentes de ciberseguridad y se exponen a sanciones por infracciones.\nSe abrió una consulta pública hasta el 16 de octubre para recibir observaciones sobre esta nómina.",
    "palabras_claves": [
      "ciberseguridad",
      "Agencia Nacional de Ciberseguridad",
      "Operadores de Importancia Vital",
      "incidentes de ciberseguridad",
      "Ley Marco de Ciberseguridad"
    ],
    "pais": "Chile",
    "sector": "",
    "url": "https://www.df.cl/df-lab/tech-negocios/anci-publica-lista-preliminar-de-operadores-de-importancia-vital-y-abre"
  },
  {
    "timestamp": "2025-09-22T21:03:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un ejecutivo de AT&T advierte que el grupo chino de hackers Salt Typhoon está inspirando a otros atacantes a usar técnicas no convencionales. Estas incluyen atacar plataformas sin detección de endpoints, explotar áreas sin registros adecuados y usar herramientas administrativas legítimas para evadir controles. Esto presenta un desafío creciente para la ciberseguridad corporativa.",
    "palabras_claves": [
      "Salt Typhoon",
      "hackers",
      "telecommunications",
      "endpoint security",
      "living off the land"
    ],
    "pais": "USA",
    "sector": "Telecommunications",
    "url": "https://ift.tt/UpY2VcK"
  },
  {
    "timestamp": "2024-05-16T15:20:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La noticia advierte sobre el potencial de ciberataques contra sistemas de aviación, incluyendo incidentes de advertencias de colisión falsas. Destaca la inversión de miles de millones de dólares por aerolíneas y aeropuertos en TI y seguridad cibernética. Se mencionan principios como Zero Trust y autenticación multifactor, y consejos para pasajeros sobre protección contra fraudes personales.",
    "palabras_claves": [
      "ciberataques",
      "aviación",
      "seguridad",
      "Zero Trust",
      "autenticación multifactor"
    ],
    "pais": "USA",
    "sector": "Aviación",
    "url": "https://ift.tt/8qX4BwK"
  },
  {
    "timestamp": "2025-09-22T22:10:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "SonicWall lanzó una alerta de seguridad por un incidente donde un actor malicioso obtuvo acceso a archivos de preferencia de clientes en la nube. Utilizando técnicas de fuerza bruta, el atacante accedió a credenciales cifradas e información para acceder a dispositivos SonicWall Firewall. CISA recomienda a los clientes seguir las medidas de contención.",
    "palabras_claves": [
      "SonicWall",
      "fuga de datos",
      "fuerza bruta",
      "credenciales comprometidas",
      "ciberataque"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://ift.tt/k2tYM4o"
  },
  {
    "timestamp": "2024-07-30T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El Reino Unido ha experimentado una serie de ciberataques recientes atribuidos a estados hostiles como Rusia, afectando a grandes empresas como Marks & Spencer, Co-Op, Harrods, Jaguar Land Rover y varios aeropuertos europeos. Estos incidentes, que incluyen ataques de ransomware, han causado interrupciones significativas y pérdidas financieras millonarias. El gobierno británico y las empresas están siendo instados a reforzar la ciberseguridad ante esta amenaza creciente.",
    "palabras_claves": [
      "ciberataques",
      "Rusia",
      "ransomware",
      "seguridad cibernética",
      "empresas británicas"
    ],
    "pais": "Reino Unido",
    "sector": "",
    "url": "https://ift.tt/vJADX6T"
  },
  {
    "timestamp": "2025-09-23T00:29:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Los servicios de paratránsito de la Administración de Tránsito de Maryland (MTA) están operativos tras un ciberataque. El incidente causó la pérdida de datos y afectó el servicio durante aproximadamente un mes. Se aconseja a los usuarios mejorar la seguridad de sus cuentas. Esto incluye el reconocimiento de intentos de phishing, actualización de contraseñas y habilitación de autenticación multifactor.",
    "palabras_claves": [
      "ciberataque",
      "fuga de datos",
      "MTA",
      "paratránsito",
      "ciberseguridad"
    ],
    "pais": "USA",
    "sector": "Transporte Público",
    "url": "https://ift.tt/JwUjMFW"
  },
  {
    "timestamp": "2025-09-23T05:10:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "CISA reporta explotación de vulnerabilidades en Ivanti EPMM para instalar backdoors. LastPass detecta suplantación en GitHub para distribuir malware de robo de información para Macs, afectando a múltiples proveedores de software. Se identifica ransomware que compromete sistemas a través del servicio Oracle Database Server Job Scheduler expuesto. Las vulnerabilidades de Ivanti fueron parcheadas en mayo.",
    "palabras_claves": [
      "exploit",
      "suplantación",
      "ransomware",
      "vulnerabilidad",
      "malware"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://ift.tt/48ZBdMo,"
  },
  {
    "timestamp": "2024-07-29T10:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un ciberataque reciente afectó a Collins Aerospace, un proveedor estadounidense de sistemas de check-in y embarque.\nEl incidente interrumpió su software MUSE, causando retrasos y cancelaciones en varios aeropuertos europeos.\nLas aerolíneas tuvieron que realizar el embarque de pasajeros manualmente.\nEste evento destaca la vulnerabilidad de puntos únicos de fallo en la infraestructura tecnológica.",
    "palabras_claves": [
      "ciberataque",
      "Collins Aerospace",
      "MUSE software",
      "aeropuertos",
      "cancelaciones"
    ],
    "pais": "USA",
    "sector": "Aviation",
    "url": "https://ift.tt/xtd8oRO"
  },
  {
    "timestamp": "2025-09-23T08:39:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La cartera multifirma del proyecto UXLINK sufrió un ciberataque, resultando en el robo de $11.3 millones en criptomonedas como USDT, USDC, WBTC y ETH. Los atacantes alteraron los derechos de acceso para realizar la sustracción de activos. Posteriormente, el propio atacante fue víctima de un ataque de phishing, perdiendo 542 millones de tokens UXLINK valorados en $48 millones. UXLINK está colaborando con expertos en seguridad e informó el incidente a la policía.",
    "palabras_claves": [
      "hackeo",
      "ciberataque",
      "filtración de datos",
      "phishing",
      "ciberfraude"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://forklog.com/en/hacker-of-uxlink-falls-victim-to-a-cyber-attack/"
  },
  {
    "timestamp": "2025-09-23T09:07:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores de ciberseguridad alertan sobre el malware BadIIS, utilizado en una campaña de SEO poisoning denominada Operation Rewrite, que redirige el tráfico a sitios fraudulentos para obtener ganancias financieras. La actividad, atribuida a un actor chino, se enfoca en el sudeste asiático, aunque se menciona una campaña similar en Brasil. Los atacantes comprometen servidores IIS para establecer acceso persistente y exfiltrar código fuente.",
    "palabras_claves": [
      "BadIIS malware",
      "SEO poisoning",
      "web shells",
      "ciberataque",
      "filtración de datos"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/vkwGlaM"
  },
  {
    "timestamp": "2024-05-18T10:30:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El informe de inteligencia de amenazas de Ontinue para el primer semestre de 2025 revela que los atacantes están adaptándose rápidamente, combinando técnicas avanzadas de persistencia en la nube con métodos tradicionales. Destacan los ataques de identidad que eluden MFA, el abuso de \"token replay\" y el resurgimiento del malware distribuido por USB. Además, el phishing evoluciona con formatos no tradicionales y las brechas de terceros se duplican, enfatizando la necesidad de que los CISOs refuercen defensas fundamentales.",
    "palabras_claves": [
      "ciberataque",
      "identidad",
      "phishing",
      "malware",
      "ransomware"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/g6nhfi0"
  },
  {
    "timestamp": "2025-09-23T09:39:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Estafadores se hacen pasar por el Centro de Quejas de Crímenes en Internet (IC3) del FBI para robar datos personales y bancarios de víctimas de fraudes anteriores. Utilizan técnicas como 'typosquatting' para crear sitios web falsos. Este tipo de estafa, que simula ser una autoridad, ha causado pérdidas de 16.6 mil millones de dólares en 2024.",
    "palabras_claves": [
      "estafadores",
      "suplantación",
      "ciberfraude",
      "datos personales",
      "fraude financiero"
    ],
    "pais": "USA",
    "sector": "",
    "url": "https://ift.tt/yUXvl4d"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Cientos de aplicaciones Android fueron infectadas con el malware SlopAds, distribuido a través de Google Play Store, afectando a más de 38 millones de descargas. Este ciberataque se enfoca en el fraude publicitario para obtener datos personales y financieros de los usuarios. Google ha eliminado las aplicaciones maliciosas y está alertando a los usuarios afectados para que las desinstalen de inmediato.",
    "palabras_claves": [
      "Android apps",
      "malware",
      "ciberataque",
      "ad fraud",
      "Google Play Store"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://ift.tt/6aOBbeG"
  },
  {
    "timestamp": "2024-05-16T10:00:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "GitHub anunció cambios significativos en la autenticación y publicación de npm para combatir ataques de cadena de suministro. Las medidas incluyen la exigencia de autenticación de dos factores (2FA) para publicación local, la implementación de tokens granulares de corta duración y la introducción de publicación confiable mediante OpenID Connect (OIDC).\nEstas innovaciones buscan eliminar la dependencia de tokens npm, establecer confianza criptográfica y generar pruebas verificables de origen y entorno de construcción de paquetes.\nGitHub también planea la deprecación de tokens clásicos y la migración de 2FA basado en TOTP a FIDO.\nEstas acciones responden a recientes ataques como el de Shai-Hulud y el paquete malicioso fezbox.",
    "palabras_claves": [
      "cadena de suministro",
      "npm",
      "autenticación",
      "2FA",
      "ataques"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://ift.tt/k9RT2XG"
  },
  {
    "timestamp": "2025-09-23T11:04:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Cloudflare ha mitigado el mayor ataque de denegación de servicio distribuido (DDoS) registrado, alcanzando un pico de 22.2 terabits por segundo (Tbps).\nEste ataque hipervolumétrico, que duró aproximadamente 40 segundos, duplica el tamaño de eventos DDoS anteriores, estableciendo un nuevo y alarmante punto de referencia para las ciberamenazas.\nLa defensa exitosa fue posible gracias a sus sistemas automatizados impulsados por aprendizaje automático, sin intervención humana.\nLa red global de Cloudflare pudo absorber y neutralizar el tráfico malicioso en el borde, impidiendo que el ataque abrumara al objetivo previsto.",
    "palabras_claves": [
      "DDoS attack",
      "Cloudflare",
      "botnets",
      "ciberamenazas",
      "sistemas automatizados"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://cybersecuritynews.com/ddos-attack-world-record/"
  },
  {
    "timestamp": "2025-09-23T11:10:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores demostraron un exploit llamado \"L1TF Reloaded\", que combina L1TF y half-Spectre.\nEste bypass permite filtrar memoria de máquinas virtuales en nubes públicas, sorteando mitigaciones existentes.\nLa prueba se realizó en Google Cloud, donde lograron robar una clave TLS de Nginx de una VM víctima.\nGoogle premió a los investigadores con 151.515 USD por el hallazgo.",
    "palabras_claves": [
      "exploit",
      "L1TF",
      "Spectre",
      "vulnerabilidad",
      "fuga de datos"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://ift.tt/4WzXouN"
  },
  {
    "timestamp": "2025-09-23T11:19:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Darktrace ha descubierto ShadowV2, una nueva botnet de DDoS que explota contenedores Docker mal configurados en instancias de AWS. Este servicio innovador permite a los clientes gestionar sus propios ciberataques de denegación de servicio. La plataforma utiliza un C&C basado en Python alojado en GitHub CodeSpaces y un binario Go con mecanismos de evasión para ataques de inundación HTTP.",
    "palabras_claves": [
      "DDoS",
      "botnet",
      "Docker",
      "ShadowV2",
      "malware"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/5oSUmiV"
  },
  {
    "timestamp": "2025-09-23T11:20:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Apple ha introducido \"Memory Integrity Enforcement\" en el iPhone 17 para contrarrestar vulnerabilidades de seguridad de memoria. Esta función de hardware/software, en colaboración con Arm, usa Enhanced Memory Tagging Extension (MTE) para proteger la memoria. Busca frustrar el acceso no autorizado de spyware como Pegasus, mejorando la seguridad contra exploits.",
    "palabras_claves": [
      "Apple",
      "Memory Integrity Enforcement",
      "vulnerabilidades",
      "spyware",
      "iPhone 17"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/F87SjMo"
  },
  {
    "timestamp": "2025-09-23T11:30:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Un informe de Adversa detalla las 25 principales vulnerabilidades en el Protocolo de Contexto del Modelo (MCP), un estándar para la interacción de agentes de IA. Estas debilidades, como la inyección de comandos, representan riesgos críticos para los sistemas de IA. El análisis ofrece una guía completa para entender y mitigar estas amenazas, incluyendo puntuaciones de impacto y estrategias de defensa para asegurar soluciones de IA.",
    "palabras_claves": [
      "vulnerabilidad",
      "ciberataque",
      "AI",
      "prompt injection",
      "MCP"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/H9zmugG"
  },
  {
    "timestamp": "2024-05-09T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Medusa afirma haber comprometido a CCMC, una destacada empresa estadounidense de servicios de gestión de asociaciones comunitarias. Los atacantes aseguran haber exfiltrado 2.92 TB de datos sensibles, incluyendo documentos financieros internos y comunicaciones corporativas. CCMC, fundada en 1973, administra comunidades residenciales en todo el país.",
    "palabras_claves": [
      "Medusa",
      "ransomware",
      "breach",
      "data exfiltration",
      "CCMC"
    ],
    "pais": "USA",
    "sector": "Community association management",
    "url": "https://t.co/OdH4rGNz1J"
  },
  {
    "timestamp": "2024-05-16T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Space Bears ha afirmado haber comprometido a dos organizaciones con sede en EE. UU.: Edro Real Estate y Batesky Law Office. La información supuestamente exfiltrada incluye bases de datos de la empresa, documentos financieros internos y datos personales de empleados y clientes.",
    "palabras_claves": [
      "ransomware",
      "brecha de seguridad",
      "fuga de datos",
      "documentos financieros",
      "información personal"
    ],
    "pais": "EE. UU.",
    "sector": "",
    "url": "https://t.co/6RjSS97eDM"
  },
  {
    "timestamp": "2025-09-23T13:01:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "La firma de inteligencia de amenazas Unit 221B, con sede en Nueva York, ha recaudado 5 millones de dólares en una ronda de financiación inicial. La empresa se centra en proporcionar inteligencia de amenazas procesable que puede conducir al arresto de hackers, utilizando su plataforma propietaria eWitness. Los fondos se utilizarán para mejorar la plataforma y acelerar los esfuerzos de colaboración en investigación.",
    "palabras_claves": [
      "threat intelligence",
      "financiación",
      "hacker",
      "eWitness",
      "cybercriminals"
    ],
    "pais": "USA",
    "sector": "Ciberseguridad",
    "url": "https://ift.tt/xtB1Law"
  },
  {
    "timestamp": "2025-09-23 13:02:00",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Los CISOs deben replantear la remediación de incidentes ante equipos de seguridad reducidos y el aumento exponencial de los costos por brechas. La crisis de credenciales y los secretos codificados representan un punto ciego peligroso, costando a organizaciones de EE. UU. más de 11 millones de dólares por incidentes. Se necesitan estrategias como la detección proactiva y la integración de flujos de trabajo para una respuesta eficiente y para reducir las pérdidas millonarias.",
    "palabras_claves": [
      "brecha de seguridad",
      "credenciales comprometidas",
      "prevención de fraudes",
      "vulnerabilidad",
      "seguridad bancaria"
    ],
    "pais": "Estados Unidos",
    "sector": "Financiero",
    "url": "https://ift.tt/plqn0X5"
  },
  {
    "timestamp": "2025-09-23T13:12:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Los deepfakes, impulsados por la IA, se han convertido en una amenaza creciente para la ciberseguridad global. Han evolucionado para ser sofisticados, capaces de eludir la autenticación biométrica y facilitar fraudes. Un trabajador financiero de una empresa del Reino Unido fue engañado para transferir $25 millones mediante un deepfake. Se estima que el costo de los ataques de deepfake aumentará a $40 mil millones para 2027.",
    "palabras_claves": [
      "deepfakes",
      "ciberseguridad",
      "inteligencia artificial",
      "fraude",
      "ingeniería social"
    ],
    "pais": "Reino Unido",
    "sector": "Financiero",
    "url": "https://ift.tt/GhY7brl"
  },
  {
    "timestamp": "2024-07-29T10:30:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "SonicWall ha lanzado una actualización de firmware para los dispositivos SMA 100, diseñada para eliminar el rootkit malware OVERSTEP. Este malware, observado por Google Threat Intelligence Group, permite a los atacantes mantener acceso persistente y robar archivos sensibles, incluyendo credenciales y certificados. Las operaciones de este rootkit se han vinculado a incidentes de ransomware como Abyss. La compañía insta a los usuarios a actualizar sus dispositivos para mitigar el riesgo.",
    "palabras_claves": [
      "SonicWall",
      "rootkit malware",
      "SMA 100",
      "OVERSTEP",
      "Abyss ransomware"
    ],
    "pais": "",
    "sector": "",
    "url": "https://ift.tt/JkR16NA"
  },
  {
    "timestamp": "2025-09-23T13:29:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Stellantis, fabricante de automóviles, confirmó una filtración de datos de clientes en Norteamérica. La brecha ocurrió en la plataforma de un tercero y fue atribuida a ShinyHunters, parte de una campaña de robo de datos de Salesforce. Se sustrajeron nombres y datos de contacto de millones de registros. Se advierte a los clientes sobre posibles intentos de phishing.",
    "palabras_claves": [
      "ciberataque",
      "filtración de datos",
      "ShinyHunters",
      "Salesforce",
      "phishing"
    ],
    "pais": "USA",
    "sector": "Automotriz",
    "url": "https://ift.tt/6WlKoVv"
  },
  {
    "timestamp": "2024-05-24T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un fabricante de automóviles sufrió un ciberataque y, al parecer, se encontraba sin cobertura de seguro cibernético en el momento del incidente. La empresa no logró finalizar un acuerdo de seguro brokereado por Lockton antes del ataque, lo que la deja sin protección directa por el incidente.",
    "palabras_claves": [
      "automaker",
      "cyber insurance",
      "incident",
      "attack",
      "uninsured"
    ],
    "pais": "",
    "sector": "Automotriz",
    "url": "https://ift.tt/LgEhIZ8"
  },
  {
    "timestamp": "2025-09-23T13:36:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "SolarWinds ha lanzado un hotfix para corregir una vulnerabilidad crítica de ejecución remota de código (CVE-2025-26399) en su software Web Help Desk. Este fallo, con una puntuación CVSS de 9.8, permite a atacantes ejecutar comandos arbitrarios sin autenticación. La vulnerabilidad es un bypass de parches anteriores y el error original fue explotado activamente.",
    "palabras_claves": [
      "SolarWinds",
      "CVE-2025-26399",
      "ejecución remota de código",
      "vulnerabilidad",
      "hotfix"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://ift.tt/qeh1cKD"
  },
  {
    "timestamp": "2025-09-23T13:37:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Trend Micro Research reveló que la aplicación Wondershare RepairIt, impulsada por IA, expuso datos sensibles de usuarios y código fuente de la compañía. Esto se debió a prácticas inseguras de almacenamiento en la nube y credenciales con permisos excesivos y codificadas. Las vulnerabilidades crean un riesgo de manipulación de modelos de IA y sofisticados ataques a la cadena de suministro. Trend Micro divulgó estos problemas al proveedor, enfatizando la necesidad de prácticas robustas de DevSecOps.",
    "palabras_claves": [
      "filtración de datos",
      "ciberataque",
      "vulnerabilidad",
      "credenciales comprometidas",
      "inteligencia artificial"
    ],
    "pais": "US",
    "sector": "Tecnología",
    "url": "https://ift.tt/1C3mvNQ"
  },
  {
    "timestamp": "2024-05-16T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a American Airlines, una de las aerolíneas más grandes del mundo. La supuesta fuga de datos, fechada el 23 de septiembre de 2025, afectaría a 2 millones de usuarios.\nLos datos comprometidos incluirían nombres completos, direcciones de correo electrónico, números de teléfono, números de cuenta, números de ruta, números de Seguro Social (SSN), fechas de nacimiento y números de identificación.\nEsta brecha pone en riesgo una cantidad sustancial de información sensible de clientes.\nEl incidente resalta la vulnerabilidad de grandes corporaciones ante ciberataques.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "data leak",
      "exfiltrated database",
      "Social Security Numbers"
    ],
    "pais": "United States",
    "sector": "Transporte Aéreo",
    "url": "https://t.co/3aPPtsu4qk"
  },
  {
    "timestamp": "2025-09-23T13:58:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El Servicio Secreto de EE.UU. desmanteló una extensa red de dispositivos electrónicos y 100,000 tarjetas SIM en el área de la ciudad de Nueva York.\nEsta red representaba una inminente amenaza para las telecomunicaciones, capaz de permitir comunicaciones cifradas para grupos criminales y realizar ataques de denegación de servicio (DDoS).\nLos objetivos potenciales incluían a funcionarios del gobierno de EE.UU. y la Asamblea General de la ONU.\nLa investigación está en curso para identificar a los responsables.",
    "palabras_claves": [
      "telecomunicaciones",
      "ciberataque",
      "DDoS",
      "SIM cards",
      "Secret Service"
    ],
    "pais": "USA",
    "sector": "Telecomunicaciones",
    "url": "https://ift.tt/NUWgfCk"
  },
  {
    "timestamp": "2025-09-23T14:16:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un ciberataque a Collins Aerospace ha provocado importantes retrasos y cancelaciones de vuelos en aeropuertos europeos como Heathrow, Bruselas y Berlín. El ataque afectó los sistemas de check-in y entrega de equipaje, causando largas filas y la pérdida de conexiones para miles de viajeros. Expertos advierten que las interrupciones podrían durar días.",
    "palabras_claves": [
      "ciberataque",
      "aeropuertos",
      "vuelos",
      "Collins Aerospace",
      "interrupciones"
    ],
    "pais": "",
    "sector": "Transporte Aéreo",
    "url": "https://ift.tt/CKYT9Jh"
  },
  {
    "timestamp": "2024-07-26T10:00:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Autoridades europeas han desarticulado una red de fraude de inversión en criptomonedas que robó más de €100 millones a 100+ víctimas. La operación, coordinada por Eurojust y Europol desde 2020, culminó con cinco arrestos. Los estafadores prometían altos retornos en plataformas falsas.\nSe mencionan pérdidas récord por estafas de inversión en EE.UU. en 2024.",
    "palabras_claves": [
      "fraude financiero",
      "criptomonedas",
      "Eurojust",
      "Europol",
      "inversión"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://ift.tt/fh8JgO9"
  },
  {
    "timestamp": "2025-09-23T14:34:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "CISA ha publicado un aviso sobre lecciones aprendidas de una respuesta a incidentes en una agencia federal de EE. UU. Actores de amenazas explotaron la vulnerabilidad CVE-2024-36401 en GeoServers públicos para obtener acceso inicial y persistencia. La agencia no remedió vulnerabilidades rápidamente, no probó su plan de respuesta a incidentes y no revisó continuamente las alertas de EDR. Se utilizaron herramientas como China Chopper, dirtycow y Stowaway.",
    "palabras_claves": [
      "ciberataque",
      "vulnerabilidad",
      "CVE-2024-36401",
      "GeoServer",
      "incidente de seguridad"
    ],
    "pais": "USA",
    "sector": "Gobierno",
    "url": "https://ift.tt/4pEKVqP"
  },
  {
    "timestamp": "2025-09-23T14:35:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El auge de la construcción de viviendas en Norteamérica ha provocado un aumento de los riesgos de defectos, ciberseguridad y fraude. Los plazos ajustados y la adopción tecnológica exponen a los constructores a ataques de ransomware, filtraciones de datos y fraudes de desvío de pagos. Expertos de The Baldwin Group señalan el impacto financiero y operativo, así como la falta de recursos en muchas empresas para afrontar estas amenazas. La gestión proactiva del riesgo y la adaptación de las aseguradoras son esenciales.",
    "palabras_claves": [
      "ciberataques",
      "fraude",
      "ransomware",
      "filtración de datos",
      "construcción"
    ],
    "pais": "Norteamérica",
    "sector": "Construcción",
    "url": "https://ift.tt/RSoUI9g"
  },
  {
    "timestamp": "2025-09-23T14:56:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una falla de seguridad en el sitio web del American Archive of Public Broadcasting (AAPB) permitió el acceso no autorizado a material restringido y privado durante años. La vulnerabilidad, explotada desde 2021, facilitó a \"data hoarders\" la descarga de contenido sensible y con derechos de autor. El problema fue corregido por AAPB rápidamente tras ser reportado por BleepingComputer.",
    "palabras_claves": [
      "falla de seguridad",
      "acceso no autorizado",
      "filtración de datos",
      "material restringido",
      "copyright"
    ],
    "pais": "USA",
    "sector": "Medios/Archivo Público",
    "url": "https://ift.tt/ihexRBT"
  },
  {
    "timestamp": "2024-05-15T18:03:00.123456",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Jaguar Land Rover (JLR) ha extendido la pausa en la producción de sus fábricas hasta el 1 de octubre de 2025. La decisión sigue a un significativo ciberataque ocurrido a principios de mes que afectó sus operaciones. La empresa investiga el incidente con especialistas y agencias del Reino Unido para asegurar un reinicio seguro. Este evento subraya la creciente amenaza de ciberataques en sectores industriales críticos.",
    "palabras_claves": [
      "ciberataque",
      "producción",
      "Jaguar Land Rover",
      "seguridad",
      "sectores industriales"
    ],
    "pais": "Reino Unido",
    "sector": "Automotriz",
    "url": "https://cybersecuritynews.com/jaguar-land-rover-delays-cyber-attack/"
  },
  {
    "timestamp": "2025-09-23T15:10:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Ciberataques recientes han interrumpido aeropuertos europeos como Heathrow y Dublín, provocando retrasos y cancelaciones. Esta situación ha impulsado la demanda de seguros de viaje automáticos y seguros cibernéticos. El sector asegurador busca posicionar estas pólizas como herramientas de prevención y protección. La noticia subraya la importancia de la innovación financiera y la ciberseguridad.",
    "palabras_claves": [
      "ciberataque",
      "seguros de viaje",
      "seguros cibernéticos",
      "prevención",
      "innovación financiera"
    ],
    "pais": "Reino Unido",
    "sector": "Cybersecurity",
    "url": "https://ift.tt/svQI8gh"
  },
  {
    "timestamp": "2025-09-23 15:33:00",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo explora la evolución de los ePassports como tecnología clave para modernizar la seguridad en los viajes. Destaca sus características avanzadas, como verificación biométrica y datos cifrados, para combatir el fraude y el robo de identidad. Estas innovaciones son esenciales para las fronteras norteamericanas, impulsando sistemas de identidad más seguros y eficientes.",
    "palabras_claves": [
      "ePassports",
      "seguridad",
      "fraude",
      "identidad",
      "biometría"
    ],
    "pais": "USA, Canadá",
    "sector": "",
    "url": "https://ift.tt/UjRcxnQ"
  },
  {
    "timestamp": "2025-09-23T19:56:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un análisis reciente revela que los ciberataques que utilizan accesos directos (.LNK) en Windows se han triplicado en el último año. Estos archivos, aparentemente inofensivos, son explotados para ejecutar comandos maliciosos ocultos automáticamente al ser abiertos por el usuario. La alerta destaca la sofisticación creciente de estas amenazas.",
    "palabras_claves": [
      "malware",
      "ciberataques",
      "accesos directos",
      "Windows",
      ".LNK"
    ],
    "pais": "",
    "sector": "",
    "url": "https://a3sec.com/alertas/malware-windows-ciberataques-accesos-directos-se-triplican-un-a%C3%B1o"
  },
  {
    "timestamp": "2025-09-23T20:08:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Cloudflare mitigó un ataque DDoS récord de 22.2 Tbps, el mayor en la historia de Internet. El ataque, que duró 40 segundos, fue neutralizado en tiempo real por los sistemas autónomos de la empresa, evitando interrupciones a los servicios. Se sospecha de la botnet AISURU, conocida por explotar routers, detrás de este evento.",
    "palabras_claves": [
      "DDoS",
      "ciberataque",
      "Cloudflare",
      "botnet",
      "seguridad"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://ift.tt/5pyAG6i"
  },
  {
    "timestamp": "2025-09-23T20:40:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Synacktiv revela una técnica avanzada, 'The Phantom Extension', para backdooring de navegadores Chromium en entornos Windows. Esta permite la carga forzada de extensiones arbitrarias y el compromiso completo del navegador. Al manipular archivos de preferencias, se logra el acceso a datos sensibles y la elusión de políticas de seguridad. Representa una amenaza significativa para la seguridad empresarial y la exfiltración de datos.",
    "palabras_claves": [
      "hackeo",
      "ciberataque",
      "filtración de datos",
      "vulnerabilidad",
      "exploit"
    ],
    "pais": "",
    "sector": "",
    "url": "https://synacktiv.com/en/publications/the-phantom-extension-backdooring-chrome-through-uncharted-pathways"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a Cineplanet, una importante cadena de cines y empresa de comercio electrónico en Perú.\nSe alega que los datos filtrados pertenecen a más de 2 millones de clientes e incluyen información de pago sensible.\nEl actor de amenazas indica que, a pesar de advertencias previas sobre la vulnerabilidad de la empresa, los datos permanecen expuestos.",
    "palabras_claves": [
      "Cineplanet",
      "filtración de datos",
      "información de pago",
      "Perú",
      "actor de amenazas"
    ],
    "pais": "Perú",
    "sector": "Entretenimiento / Comercio Electrónico",
    "url": "https://t.co/kRx72beUfa"
  },
  {
    "timestamp": "2024-07-30T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Qilin afirma haber comprometido a cuatro empresas internacionales, incluyendo Chinup Technology (Taiwán), Chris Rodriguez Installers (EE.UU.), Meduane Habitat (Francia) y APM Finance (Alemania).\nSegún el grupo, se exfiltró información sensible como planos técnicos, datos financieros y personales de empleados y clientes.\nEste incidente resalta el amplio alcance del grupo Qilin y la diversidad de sus objetivos a nivel global.",
    "palabras_claves": [
      "Qilin ransomware",
      "breached",
      "exfiltrated data",
      "sensitive information",
      "international companies"
    ],
    "pais": "US",
    "sector": "Financiero",
    "url": "https://t.co/81vBMvB06C"
  },
  {
    "timestamp": "Wednesday, September 24, 2025 at 12:44 PM UTC",
    "categoria": "Noticias Locales (Chile) sobre Ciberfraude / Ciberataques",
    "resumen": "Datos de 20 millones de clientes de la empresa de telecomunicaciones Claro Chile están a la venta en el Dark Web. La información expuesta incluye datos personales y de contacto de los usuarios.",
    "palabras_claves": [
      "DarkWeb",
      "ClaroChile",
      "ciberataque",
      "fuga de datos",
      "información personal"
    ],
    "pais": "Chile",
    "sector": "Telecomunicaciones",
    "url": "https://twitter.com/DailyDarkWeb/status/1970804824103940175"
  },
  {
    "timestamp": "2025-09-24T13:31:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La Agencia de Ciberseguridad y Seguridad de Infraestructura (CISA) de EE. UU. ha añadido una vulnerabilidad de Google Chromium (CVE-2025-10585) a su catálogo de vulnerabilidades explotadas conocidas. Esta falla zero-day, un problema de tipo confusión en el motor V8 JavaScript, está siendo explotada activamente en el mundo real. Google ya lanzó actualizaciones de seguridad para corregirla, y CISA exige a las agencias federales de EE. UU. aplicar los parches antes del 2 de octubre de 2025, extendiendo la recomendación a organizaciones privadas.",
    "palabras_claves": [
      "vulnerabilidad",
      "CVE",
      "zero-day",
      "Chromium",
      "CISA"
    ],
    "pais": "U.S.",
    "sector": "Technology",
    "url": "https://securityaffairs.com/182509/security/u-s-cisa-adds-google-chromium-flaw-to-its-known-exploited-vulnerabilities-catalog.html"
  },
  {
    "timestamp": "Wednesday, September 24, 2025 at 1:51 PM UTC",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "MSTICPy es una biblioteca de herramientas de seguridad de inteligencia de amenazas de Microsoft, diseñada para investigación y caza de amenazas en Jupyter Notebooks. Permite consultar y enriquecer datos de log con inteligencia de amenazas y geolocalización. La herramienta facilita el análisis sofisticado como la detección de sesiones anómalas y la visualización de datos para mejorar la seguridad cibernética empresarial. Es una herramienta clave para la prevención y mitigación de ciberataques.",
    "palabras_claves": [
      "Threat Intelligence",
      "ciberseguridad",
      "análisis de seguridad",
      "IoC",
      "prevención de fraudes"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://github.com/microsoft/msticpy"
  },
  {
    "timestamp": "2025-09-24T15:16:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Hackers están utilizando una técnica sofisticada para evadir soluciones EDR, ejecutando código malicioso directamente en la memoria de procesos legítimos. Este \"ataque fileless\" descarga y ejecuta archivos PE como troyanos o info-stealers sin tocar el disco, frustrando la detección tradicional. La técnica ha demostrado ser efectiva contra EDRs importantes como Microsoft Defender y Sophos, resaltando la necesidad de inspección profunda de memoria y análisis de comportamiento.",
    "palabras_claves": [
      "EDR bypass",
      "in-memory PE loader",
      "ataque fileless",
      "troyano",
      "info-stealer"
    ],
    "pais": "",
    "sector": "",
    "url": "https://cybersecuritynews.com/edr-bypass-in-memory-pe-loader/"
  },
  {
    "timestamp": "2025-09-24T22:02:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers chinos, específicamente el grupo UNC5221, han comprometido redes de firmas legales, empresas SaaS y organizaciones tecnológicas en Estados Unidos por más de un año. Utilizando la puerta trasera BRICKSTORM y exploits de día cero, los atacantes han robado datos e información de propiedad intelectual con fines de espionaje, manteniendo acceso persistente y sin ser detectados. Los objetivos incluyen el acceso a cuentas de correo y la clonación de VMs clave en entornos VMware.",
    "palabras_claves": [
      "hackers chinos",
      "fuga de datos",
      "ciberataque",
      "zero-day",
      "espionaje"
    ],
    "pais": "Estados Unidos",
    "sector": "Legal, Tecnología",
    "url": "https://securityboulevard.com/2025/09/chinese-hackers-steal-data-from-u-s-legal-tech-firms-for-more-than-a-year/"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Lynx ha afirmado haber comprometido las redes de varias organizaciones con sede en Estados Unidos.\nComo prueba, han publicado datos robados, que incluyen información sensible.\nEntre las víctimas se encuentran entidades de servicios gubernamentales, construcción y biotecnología.\nEl ataque demuestra la diversidad de sectores afectados por estos grupos.",
    "palabras_claves": [
      "ransomware",
      "brecha de seguridad",
      "datos robados",
      "ciberataque",
      "organizaciones"
    ],
    "pais": "Estados Unidos",
    "sector": "",
    "url": "https://t.co/h2hwU32ntj"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a Maruji & Raines, P.S. (MRCPAs), una firma de contadores públicos con sede en Estados Unidos. Se habrían exfiltrado más de 100 GB de datos.\nEl actor está ofreciendo el presunto conjunto de datos comprometidos para la venta. Esta situación representa una seria brecha de seguridad para la firma.",
    "palabras_claves": [
      "ciberataque",
      "filtración de datos",
      "datos comprometidos",
      "sector financiero",
      "venta de datos"
    ],
    "pais": "Estados Unidos",
    "sector": "Contabilidad",
    "url": "https://t.co/1QeAPORRyk"
  },
  {
    "timestamp": "2024-05-18T10:30:00Z",
    "categoria": "Noticias Locales (Chile) sobre Ciberfraude / Ciberataques",
    "resumen": "El grupo de ransomware Qilin ha reclamado ataques a múltiples empresas internacionales, incluyendo Office Pro en Chile. Utilizando tácticas de doble extorsión, los atacantes exfiltraron datos sensibles.\nPara Office Pro, la información comprometida incluye datos financieros de la empresa, y datos personales de empleados y clientes, como nombres, correos, direcciones y cuentas bancarias.",
    "palabras_claves": [
      "ransomware",
      "filtración de datos",
      "doble extorsión",
      "Office Pro",
      "cuentas bancarias"
    ],
    "pais": "Chile",
    "sector": "Comercio",
    "url": "https://t.co/IM5dtpJTJ1"
  },
  {
    "timestamp": "2025-09-25T13:10:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Microsoft Threat Intelligence detectó y bloqueó una campaña de phishing donde atacantes usaron IA para ofuscar su carga útil y evadir defensas.\nLa campaña, aunque limitada y dirigida a organizaciones en EE. UU., resalta la creciente tendencia de uso de IA por ciberdelincuentes.\nMicrosoft Defender para Office 365 y Security Copilot fueron cruciales en la detección de estas sofisticadas tácticas.\nEl análisis de código generado por IA reveló nuevos artefactos que facilitaron la detección.",
    "palabras_claves": [
      "Inteligencia Artificial",
      "Phishing",
      "Ofuscación",
      "Credenciales comprometidas",
      "Prevención de fraudes"
    ],
    "pais": "USA",
    "sector": "",
    "url": "https://www.microsoft.com/en-us/security/blog/2025/09/24/ai-vs-ai-detecting-an-ai-obfuscated-phishing-campaign/"
  },
  {
    "timestamp": "2025-09-26T12:40:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Cisco ha emitido una advertencia urgente para parchear dos vulnerabilidades de día cero en su software Secure Firewall ASA y FTD, que están siendo explotadas activamente. La Agencia de Ciberseguridad y Seguridad de Infraestructura (CISA) de EE. UU. ha emitido una directiva de emergencia, instando a las agencias federales a mitigar. Un actor de amenaza avanzado, ArcaneDoor (UAT4356), está detrás de esta campaña de explotación generalizada, que implica la ejecución remota de código sin autenticación.",
    "palabras_claves": [
      "Cisco ASA",
      "zero-day",
      "vulnerabilidades",
      "CISA",
      "explotación"
    ],
    "pais": "EE. UU.",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/09/urgent-cisco-asa-zero-day-duo-under.html"
  },
  {
    "timestamp": "2025-09-26T13:38:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers están comprometiendo Active Directory para robar la base de datos NTDS.dit. Utilizan phishing y escalada de privilegios para acceder y exfiltrar credenciales de dominio. Este método permite el movimiento lateral y el control total del dominio. Trellix ha detectado estas actividades mediante firmas de alta fidelidad.",
    "palabras_claves": [
      "hackeo",
      "Active Directory",
      "NTDS.dit",
      "phishing",
      "exfiltración de datos"
    ],
    "pais": "",
    "sector": "",
    "url": "https://cybersecuritynews.com/active-directory-breach-exfiltrate-ntds/"
  },
  {
    "timestamp": "2025-09-26T13:38:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El grupo LockBit ha resurgido con una nueva versión, LockBit 5.0, tras una interrupción en 2024. Trend Micro identificó variantes para Windows, Linux y ESXi, confirmando su enfoque en ataques multiplataforma. La versión 5.0, descubierta en septiembre de 2025, utiliza ofuscación avanzada y técnicas anti-análisis para evadir detección. Este ransomware es significativamente más peligroso, buscando paralizar redes empresariales y máquinas virtuales.",
    "palabras_claves": [
      "LockBit 5.0",
      "ransomware",
      "ciberataque",
      "ESXi",
      "ofuscación"
    ],
    "pais": "",
    "sector": "",
    "url": "https://cybersecuritynews.com/new-lockbit-5-0-ransomware-variant/"
  },
  {
    "timestamp": "2025-09-26T18:50:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Investigadores descubrieron nuevas campañas de phishing que utilizan archivos SVG maliciosos para entregar una suite de malware que incluye CountLoader, Amatera Stealer y PureRAT. Estas campañas suplantan agencias gubernamentales ucranianas y tienen como objetivo entidades en Ucrania y Vietnam, buscando el robo de información y criptomonedas.",
    "palabras_claves": [
      "phishing",
      "malware",
      "cryptocurrency",
      "PureRAT",
      "Amatera Stealer"
    ],
    "pais": "Ukraine, Vietnam",
    "sector": "Government",
    "url": "https://thehackernews.com/2025/09/researchers-expose-svg-and-purerat.html"
  },
  {
    "timestamp": "2025-09-26T18:51:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una nueva campaña de malware COLDRIVER, utilizando BAITSWITCH y SIMPLEFIX, apunta a ONG, defensores de derechos humanos y think tanks en regiones occidentales, empleando tácticas ClickFix. Adicionalmente, los grupos BO Team y Bearlyfy están llevando a cabo ataques de phishing y ransomware contra empresas rusas, utilizando herramientas como BrockenDoor y ZeronetKit, y explotando vulnerabilidades como Zerologon para acceso inicial y escalada de privilegios.",
    "palabras_claves": [
      "malware",
      "APT",
      "ransomware",
      "phishing",
      "vulnerabilidad"
    ],
    "pais": "USA",
    "sector": "",
    "url": "https://thehackernews.com/2025/09/new-coldriver-malware-campaign-joins-bo.html"
  },
  {
    "timestamp": "2025-09-27T06:59:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El 'Threatsday Bulletin' del 25 de septiembre de 2025 detalla múltiples amenazas de ciberseguridad. Destacan una operación de INTERPOL que recuperó 439 millones de dólares de diversos delitos financieros cibernéticos y una campaña de phishing que distribuye AsyncRAT a usuarios en países de LATAM. También se informa sobre una vulnerabilidad de OnePlus que filtra SMS, una brecha en una agencia federal vía GeoServer, y un ataque a la cadena de suministro con el gusano Shai-Hulud.",
    "palabras_claves": [
      "fraude financiero",
      "phishing",
      "banking trojans",
      "SIM-swapping",
      "ciberataque"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/09/threatsday-bulletin-rootkit-patch.html#geoserver-hole-exploited"
  },
  {
    "timestamp": "2025-09-29T02:36:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Se anuncia en un foro de la dark web una filtración de 35.6 GB de datos de AGETIC, la Agencia de Gobierno Electrónico y Tecnologías de Información y Comunicación de Bolivia. La información comprometida incluye documentos confidenciales, proyectos, datos de CTF y reportes de auditoría interna y externa. Los datos están a la venta por criptomonedas y el autor critica la falta de transparencia de la entidad.",
    "palabras_claves": [
      "filtración de datos",
      "AGETIC",
      "Bolivia",
      "documentos privados",
      "auditoría"
    ],
    "pais": "Bolivia",
    "sector": "Tecnología",
    "url": "https://darkforums.st/Thread-BOLIVIA-AGETIC-35-6-GB-28-09-2025"
  },
  {
    "timestamp": "2024-07-30T10:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido los sistemas internos de X (anteriormente Twitter), un servicio estadounidense de redes sociales.\nSe publicó evidencia, incluyendo capturas de pantalla de un 'Agent Sign-On Dashboard' conectado a Okta.\nEsto sugiere acceso a herramientas internas sensibles para gestionar identidades de usuarios y empleados.\nLa extensión total del compromiso de datos aún no está clara, y el actor amenaza con más filtraciones.",
    "palabras_claves": [
      "breached",
      "X (Twitter)",
      "Okta",
      "internal systems",
      "data compromise"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://t.co/sg0QmnXM7d"
  },
  {
    "timestamp": "Monday, September 29, 2025 at 8:43 AM UTC",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Investigadores de ciberseguridad han descubierto el primer servidor malicioso de Model Context Protocol (MCP) que roba correos electrónicos. Fue encontrado oculto en un paquete npm llamado \"postmark-mcp\", una imitación de una librería legítima de Postmark Labs. El código malicioso reenviaba silenciosamente cada correo electrónico enviado a un servidor personal del atacante, resultando en una exfiltración de datos. Este incidente subraya los crecientes riesgos en la cadena de suministro de software.",
    "palabras_claves": [
      "MCP server",
      "npm package",
      "email theft",
      "software supply chain",
      "data exfiltration"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/09/first-malicious-mcp-server-found.html"
  },
  {
    "timestamp": "2024-07-30T14:48:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a Credera, una firma de consultoría global con sede en Estados Unidos.\nLa brecha supuestamente expuso datos internos sensibles de Credera, junto con información confidencial y código fuente de varios de sus clientes de alto perfil.\nEntre los clientes afectados se incluyen corporaciones como Mercedes, AT&T, Green Dot, Southwest Airlines y AstraZeneca.\nEl actor ha proporcionado capturas de pantalla como prueba de la extensa información comprometida.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "sensitive internal data",
      "confidential information",
      "source code"
    ],
    "pais": "United States",
    "sector": "Consultoría",
    "url": "https://t.co/mX01WZEnz8"
  },
  {
    "timestamp": "2025-09-29T11:30:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Se ha descubierto una vulnerabilidad de ejecución remota de código (RCE) de \"0-click\" en WhatsApp, afectando a dispositivos iOS, macOS y iPadOS de Apple. El ataque, demostrado por investigadores de DarkNavyOrg, explota dos CVEs (CVE-2025-55177 y CVE-2025-43300) a través de un archivo de imagen DNG malicioso. Esto permite el compromiso del dispositivo sin interacción del usuario, otorgando a los atacantes control total y acceso a datos sensibles. Se recomienda a los usuarios mantener sus aplicaciones y sistemas operativos actualizados.",
    "palabras_claves": [
      "vulnerabilidad",
      "0-click",
      "RCE",
      "WhatsApp",
      "CVE"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://cybersecuritynews.com/whatsapp-0-click-vulnerability-exploited/"
  },
  {
    "timestamp": "2024-05-27T10:30:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware INC ha reivindicado un ciberataque contra PHI Centre, una organización canadiense con sede en Montreal, dedicada a la presentación de obras inmersivas en VR, AR y XR. Los atacantes afirman haber publicado una gran cantidad de archivos como prueba de la brecha. La información comprometida incluiría documentos internos y relacionados con clientes, sugiriendo una exfiltración de datos significativa.",
    "palabras_claves": [
      "ransomware",
      "PHI Centre",
      "brecha",
      "exfiltración",
      "Canadá"
    ],
    "pais": "Canadá",
    "sector": "",
    "url": "https://t.co/9biNL5IyED"
  },
  {
    "timestamp": "Monday, September 29, 2025 at 3:20 PM UTC",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Un estudio revela que los SOCs están abrumados por el volumen de alertas de seguridad, lo que lleva a dejar amenazas críticas sin investigar. La adopción de la IA en las operaciones de seguridad ha pasado de ser experimental a esencial, con un 55% de los equipos utilizando copilotos de IA. Se espera que el 60% de las cargas de trabajo del SOC sean manejadas por IA en los próximos tres años.",
    "palabras_claves": [
      "inteligencia artificial",
      "SOC",
      "ciberseguridad",
      "automatización",
      "amenazas"
    ],
    "pais": "US",
    "sector": "",
    "url": "https://thehackernews.com/2025/09/the-state-of-ai-in-soc-2025-insights.html"
  },
  {
    "timestamp": "Monday, September 29, 2025 at 4:39 PM UTC",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una nueva campaña de malware, denominada EvilAI, está infiltrando activamente organizaciones a nivel global. El malware se disfraza de herramientas de inteligencia artificial legítimas para distribuirse. Su objetivo es la exfiltración de datos sensibles del navegador y el reconocimiento extenso. Los sectores afectados incluyen manufactura, gobierno, salud, tecnología y retail, en regiones como EE. UU. y Brasil.",
    "palabras_claves": [
      "malware",
      "ciberataque",
      "filtración de datos",
      "inteligencia artificial",
      "organizaciones"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/09/evilai-malware-masquerades-as-ai-tools.html"
  },
  {
    "timestamp": "2025-09-30T05:45:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "La CISA ha emitido una alerta crítica sobre una vulnerabilidad en Sudo (CVE-2025-32463) que afecta a sistemas Linux y Unix, permitiendo a atacantes locales ejecutar comandos como root. Esta falla ha sido añadida al catálogo KEV debido a su explotación activa. Se recomienda a las agencias federales de EE. UU. aplicar mitigaciones antes del 20 de octubre de 2025.",
    "palabras_claves": [
      "vulnerabilidad",
      "sudo",
      "explotación",
      "Linux",
      "CISA"
    ],
    "pais": "USA",
    "sector": "Gobierno",
    "url": "https://thehackernews.com/2025/09/cisa-sounds-alarm-on-critical-sudo-flaw.html"
  },
  {
    "timestamp": "2024-07-30T10:48:30Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido la base de datos del Dana-Farber Cancer Institute (DFCI), una reconocida organización sin fines de lucro de Estados Unidos. La base de datos, que contiene más de 4,400 registros de información personal y financiera sensible, se está vendiendo en un foro de hacking. DFCI se dedica al tratamiento e investigación del cáncer.",
    "palabras_claves": [
      "brecha de seguridad",
      "fuga de datos",
      "hacking forum",
      "datos personales",
      "información financiera"
    ],
    "pais": "Estados Unidos",
    "sector": "Salud",
    "url": "https://t.co/bxBCqE82l4"
  },
  {
    "timestamp": "2025-09-30T08:25:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "La policía del Reino Unido realizó la mayor incautación de criptomonedas del mundo, confiscando £5.5 mil millones en Bitcoin. Una ciudadana china fue condenada por orquestar un esquema de fraude masivo que defraudó a más de 128,000 víctimas. Los fondos fueron convertidos a Bitcoin y blanqueados en el Reino Unido.",
    "palabras_claves": [
      "Bitcoin",
      "criptomonedas",
      "fraude",
      "lavado de dinero",
      "incautación"
    ],
    "pais": "Reino Unido",
    "sector": "Criptomonedas / Fraude Financiero",
    "url": "https://thehackernews.com/2025/09/uk-police-just-seized-55-billion-in.html"
  },
  {
    "timestamp": "2025-09-30T09:32:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un nuevo troyano bancario de Android, \"Datzbro\", está engañando a personas mayores con eventos de viajes falsos generados por IA en Facebook. Este malware permite el control remoto del dispositivo, captura de credenciales y fraude financiero. Fue descubierto en agosto de 2025 por ThreatFabric y afecta a países como Australia, Canadá y el Reino Unido, con posibles orígenes en China.",
    "palabras_claves": [
      "android",
      "troyano",
      "datzbro",
      "fraude financiero",
      "facebook"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/09/new-android-trojan-datzbro-tricking.html"
  },
  {
    "timestamp": "2024-05-24T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware PEAR afirma haber comprometido a MCBS, LLC, una empresa de Estados Unidos que ofrece servicios de contabilidad y gestión para proveedores de atención médica. Los atacantes han listado a MCBS en su sitio de filtración de datos. Amenazan con liberar 3.3 TB de información sensible. La información incluye datos de la firma, sus clientes, socios y pacientes.",
    "palabras_claves": [
      "PEAR ransomware group",
      "MCBS, LLC",
      "data leak site",
      "información sensible",
      "proveedores de atención médica"
    ],
    "pais": "Estados Unidos",
    "sector": "Salud",
    "url": "https://t.co/Q7Wy5KPmOA"
  },
  {
    "timestamp": "2024-07-29T12:00:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware DevMan afirma haber comprometido a Wrapex Industrial Services Inc., una destacada empresa canadiense.\nWrapex es líder en servicios industriales, incluyendo aislamiento y andamios, para sectores como petróleo y gas en el oeste de Canadá.\nLa empresa ha estado operativa desde 1982.\nAún no se han detallado completamente los alcances de la brecha.",
    "palabras_claves": [
      "ransomware",
      "DevMan",
      "Wrapex Industrial Services",
      "brecha de seguridad",
      "Canadá"
    ],
    "pais": "Canadá",
    "sector": "Servicios Industriales",
    "url": "https://t.co/GZgy4z9Zms"
  },
  {
    "timestamp": "2024-07-30T10:30:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware J ha afirmado haber comprometido los sistemas de AZpro Group, una empresa estadounidense especializada en soluciones de impresión de gran formato. Exfiltraron una cantidad significativa de datos sensibles, incluyendo información financiera, de clientes y operaciones. Como prueba, el grupo ha publicado un archivo de muestra de 198 kB. AZpro es una empresa con sede en Arizona, EE.UU.",
    "palabras_claves": [
      "ransomware",
      "filtración de datos",
      "brecha de seguridad",
      "AZpro Group",
      "datos sensibles"
    ],
    "pais": "USA",
    "sector": "Impresión de gran formato",
    "url": "https://t.co/q9tbRRByXp"
  },
  {
    "timestamp": "2025-09-30T11:06:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Hackers vinculados a China, conocidos como UNC5174, han explotado activamente una vulnerabilidad de día cero (CVE-2025-41244) en productos de VMware como Tools y Aria Operations desde octubre de 2024. Esta falla permite la escalada local de privilegios, otorgando acceso de root a usuarios no privilegiados en máquinas virtuales. NVISO Labs descubrió el uso de la vulnerabilidad en incidentes, y VMware ha lanzado parches para mitigarlo.",
    "palabras_claves": [
      "hackeo",
      "zero-day",
      "vulnerabilidad",
      "VMware",
      "escalamiento de privilegios"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/09/urgent-china-linked-hackers-exploit-new.html"
  },
  {
    "timestamp": "2024-07-30T10:30:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a Avalara, Inc., una empresa estadounidense de software de cumplimiento fiscal.\nEl actor está vendiendo una base de datos parcial supuestamente robada en septiembre de 2025.\nLa brecha afectaría a Avalara y a sus clientes, incluyendo a Amazon, Microsoft y Morgan Stanley.\nSe reportan más de 8 millones de filas de datos comprometidos.",
    "palabras_claves": [
      "actor de amenazas",
      "breach",
      "Avalara",
      "database",
      "stolen"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://t.co/TSfOZSax9H"
  },
  {
    "timestamp": "2025-09-30T16:11:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Phantom Taurus, un grupo de hackers vinculado a China, ha estado atacando a gobiernos y organizaciones de telecomunicaciones en África, Oriente Medio y Asia durante los últimos dos años y medio. Su objetivo principal es el ciberespionaje y la recolección de datos confidenciales, utilizando malware sigiloso como NET-STAR. El grupo explota vulnerabilidades en servidores IIS y Microsoft Exchange para infiltrarse en redes. Palo Alto Networks Unit 42 ha revelado sus tácticas adaptativas y el uso de herramientas personalizadas para estas operaciones.",
    "palabras_claves": [
      "Phantom Taurus",
      "ciberespionaje",
      "malware",
      "telecomunicaciones",
      "vulnerabilidad"
    ],
    "pais": "China",
    "sector": "Telecommunications",
    "url": "https://thehackernews.com/2025/09/phantom-taurus-new-china-linked-hacker.html"
  },
  {
    "timestamp": "2025-09-30T18:43:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Investigadores han demostrado un nuevo ataque de hardware de $50, llamado 'Battering RAM', que evade las protecciones de seguridad en la nube de procesadores Intel y AMD. Este ataque explota una vulnerabilidad para acceder a la memoria cifrada en entornos de computación confidencial, requiriendo un rediseño fundamental de la encriptación de memoria. La vulnerabilidad afecta a sistemas que usan memoria DDR4 en infraestructuras de nube pública.",
    "palabras_claves": [
      "vulnerabilidad",
      "hardware security",
      "ciberataque",
      "cloud computing",
      "memoria encriptada"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/50-battering-ram-attack-breaks-intel.html"
  },
  {
    "timestamp": "2025-09-30T22:50:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Chainsaw es una herramienta de código abierto desarrollada por WithSecureLabs para la búsqueda rápida de amenazas y respuesta a incidentes en entornos Windows. Permite analizar artefactos forenses como registros de eventos y archivos MFT, utilizando reglas de detección Sigma y personalizadas. La herramienta ayuda a identificar actividades maliciosas, analizar el uso del sistema y crear líneas de tiempo para investigaciones de ciberseguridad.",
    "palabras_claves": [
      "ciberseguridad",
      "threat-hunting",
      "incident response",
      "forensics",
      "Sigma rules"
    ],
    "pais": "",
    "sector": "Financial services",
    "url": "https://github.com/WithSecureLabs/chainsaw"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un ciberatacante comprometió la cuenta oficial de X (anteriormente Twitter) de BNB Chain, un ecosistema blockchain descentralizado.\nEl atacante publicó enlaces maliciosos diseñados para realizar phishing a los usuarios de sus carteras de criptomonedas.\nBNB Chain ha recuperado el control, eliminado las publicaciones maliciosas y está investigando la causa raíz de la brecha.\nLa compañía se ha comprometido a compensar completamente a las víctimas del ataque de phishing.",
    "palabras_claves": [
      "comprometida",
      "phishing",
      "criptomonedas",
      "brecha",
      "ataque"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://t.co/ytCaQyoRXa"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de amenazas 'scattered LAPSUS$ hunters 5.0' ha reaparecido en Telegram, anunciando el inminente lanzamiento de un nuevo sitio de filtración de datos.\nLos operadores del canal afirmaron poseer datos de víctimas corporativas de alto perfil, incluyendo la mención de un alias que 'hackeó Salesforce'.\nEl grupo se burló de agencias internacionales de aplicación de la ley como la NCA, Europol y el FBI.",
    "palabras_claves": [
      "LAPSUS$",
      "Telegram",
      "data leak site",
      "breaches",
      "Salesforce"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://t.co/15jGR8jS3j"
  },
  {
    "timestamp": "2025-10-01T09:32:00Z",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "Un nuevo troyano bancario Android, \"Klopatra\", ha infectado más de 3.000 dispositivos, principalmente en España e Italia. Descubierto en agosto de 2025, utiliza VNC oculto y superposiciones dinámicas para robar credenciales y realizar transacciones fraudulentas. Este malware turco representa una evolución significativa en la sofisticación del malware móvil y una seria amenaza para el sector financiero.",
    "palabras_claves": [
      "android banking trojan",
      "Klopatra",
      "fraude financiero",
      "malware",
      "phishing"
    ],
    "pais": "",
    "sector": "Financiero",
    "url": "https://thehackernews.com/2025/10/new-android-banking-trojan-klopatra.html"
  },
  {
    "timestamp": "2024-07-29T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido a Globo.Tech Communications, una empresa de tecnología canadiense que ofrece servicios de hosting y nube globalmente. El incidente, supuestamente ocurrido el 1 de octubre de 2025, resultó en la filtración pública de datos de la compañía. La información comprometida incluye principalmente el código fuente de la empresa, exponiendo software interno y activos de desarrollo.",
    "palabras_claves": [
      "brecha de seguridad",
      "fuga de datos",
      "Globo.Tech Communications",
      "código fuente",
      "threat actor"
    ],
    "pais": "Canadá",
    "sector": "Tecnología",
    "url": "https://t.co/0mqpyVuSHb"
  },
  {
    "timestamp": "2024-05-30 17:00:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber comprometido la base de datos de WordPress de BancoCapital.\nEsta institución financiera, con sede en Ecuador, sufrió la filtración de su base de datos.\nLos datos supuestamente robados fueron publicados en un foro de hacking.\nLa información incluye 67 tablas de la base de datos.",
    "palabras_claves": [
      "filtración de datos",
      "ciberataque",
      "BancoCapital",
      "sector financiero",
      "Ecuador"
    ],
    "pais": "Ecuador",
    "sector": "Financiero",
    "url": "https://t.co/1RJYc1wqSV"
  },
  {
    "timestamp": "2024-05-27T10:31:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Google Maps ha implementado una nueva función en México para proteger a los usuarios del fraude en cajeros automáticos. La herramienta ayuda a identificar ATMs seguros, ofreciendo información clave para prevenir estafas como el skimming. Esta iniciativa de la gigante tecnológica busca reforzar la seguridad financiera ante el creciente cibercrimen en la región, impactando directamente en las transacciones diarias.",
    "palabras_claves": [
      "Google Maps",
      "fraude ATM",
      "México",
      "prevención",
      "seguridad financiera"
    ],
    "pais": "México",
    "sector": "Financiero",
    "url": "https://t.co/hOat2cKQrM"
  },
  {
    "timestamp": "2024-07-30T14:48:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Akira ha afirmado haber comprometido a Cascade Pacific Pulp LLC, una destacada fábrica de pulpa ubicada en el noroeste del Pacífico de Estados Unidos. Los atacantes alegan haber exfiltrado más de 146GB de datos corporativos y personales sensibles. La empresa es conocida por su producción anual de más de 200,000 toneladas de pulpa de alta calidad.",
    "palabras_claves": [
      "Ransomware",
      "Akira Group",
      "Brecha de seguridad",
      "Filtración de datos",
      "Datos comprometidos"
    ],
    "pais": "Estados Unidos",
    "sector": "Industrial",
    "url": "https://t.co/sRkG7jul7m"
  },
  {
    "timestamp": "2025-10-01 12:29:00",
    "categoria": "Tendencias de Ataques al Sector Financiero",
    "resumen": "El informe de Bitdefender 2025 revela desafíos para las empresas: el 58% de las brechas se mantienen confidenciales y el 84% de los ataques de alta gravedad utilizan técnicas 'Living Off the Land'. Las organizaciones priorizan la reducción de la superficie de ataque en medio de las crecientes percepciones de amenazas de IA, con una desconexión entre ejecutivos y equipos de primera línea sobre el riesgo cibernético.",
    "palabras_claves": [
      "ciberseguridad",
      "brechas de seguridad",
      "superficie de ataque",
      "ataques impulsados por IA",
      "Living Off the Land"
    ],
    "pais": "USA, Singapore",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/2025-cybersecurity-reality-check.html"
  },
  {
    "timestamp": "2025-10-01T12:40:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Se ha revelado una vulnerabilidad crítica (CVE-2025-10725) en el servicio Red Hat OpenShift AI.\nPermite a atacantes autenticados con bajos privilegios escalar a administradores de clúster.\nEsto podría llevar a un control total de la infraestructura de nube híbrida.\nLa falla expone a robo de datos sensibles y disrupción de servicios.",
    "palabras_claves": [
      "vulnerabilidad",
      "Red Hat",
      "OpenShift AI",
      "escalamiento de privilegios",
      "ciberseguridad"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/critical-red-hat-openshift-ai-flaw.html"
  },
  {
    "timestamp": "2025-10-01 13:03:00 UTC",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo promociona un webinar sobre cómo los equipos de seguridad líderes están fusionando la inteligencia artificial con flujos de trabajo humanos para fortalecer la ciberseguridad. Se enfoca en superar los desafíos de la automatización total y la toma de decisiones opaca, buscando un equilibrio intencional entre la intervención humana y la IA. El objetivo es construir defensas más robustas y auditables, evitando complejidades innecesarias y nuevos riesgos.",
    "palabras_claves": [
      "AI",
      "automatización",
      "ciberseguridad",
      "flujos de trabajo",
      "prevención"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/how-leading-security-teams-blend-ai.html"
  },
  {
    "timestamp": "2025-10-01T13:29:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Una vulnerabilidad de alta gravedad (CVE-2025-59363) en la solución de Gestión de Identidad y Acceso (IAM) OneLogin permitió a atacantes con credenciales API válidas robar secretos de cliente de OpenID Connect (OIDC). Esto podría haber llevado a la suplantación de aplicaciones y acceso no autorizado a servicios integrados. El problema fue solucionado en la versión 2025.3.0 de OneLogin.",
    "palabras_claves": [
      "vulnerabilidad",
      "API",
      "credenciales comprometidas",
      "fuga de datos",
      "ciberseguridad"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/onelogin-bug-let-attackers-use-api-keys.html"
  },
  {
    "timestamp": "2025-10-02T07:38:00Z",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "Una encuesta de MazeBolt a 300 CISOs y directores de seguridad en EE. UU. y Europa, de los sectores bancario, servicios financieros y seguros, revela que las organizaciones siguen sufriendo incidentes DDoS perjudiciales a pesar del aumento de la inversión. Se detecta una brecha entre la confianza en las defensas y la frecuencia de ataques, así como una dependencia de las pruebas manuales. Existe una alta demanda de pruebas automatizadas y continuas de vulnerabilidades DDoS para mejorar la resiliencia y la visibilidad.",
    "palabras_claves": [
      "DDoS",
      "defensas",
      "CISOs",
      "servicios financieros",
      "vulnerabilidad"
    ],
    "pais": "",
    "sector": "Financial Services",
    "url": "https://thehackernews.com/expert-insights/2025/09/the-state-of-ddos-defenses-unpacking.html"
  },
  {
    "timestamp": "2024-07-30T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware 'The J' afirma haber comprometido a Dimensional Control Systems (DCS), una empresa de software con sede en Estados Unidos. Alegan haber exfiltrado 11 GB de datos de los sistemas de la compañía. DCS provee soluciones de software para industrias automotriz, aeroespacial y de dispositivos médicos, entre otras.",
    "palabras_claves": [
      "ransomware",
      "Dimensional Control Systems",
      "brecha de seguridad",
      "exfiltración de datos",
      "software"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://t.co/ZvapAZkEQe"
  },
  {
    "timestamp": "2024-05-20T12:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de ransomware Akira ha afirmado haber comprometido a dos empresas con sede en EE. UU., Barr & Barr, Inc. (construcción) y Keystone Solutions Group (fabricante de dispositivos médicos), añadiéndolas a su sitio de filtración en la dark web el 1 de octubre de 2025. Se alega la exfiltración de más de 973GB de datos combinados. Esta información incluye datos de empleados (nombres, direcciones, fechas de nacimiento, teléfonos), pasaportes escaneados, licencias de conducir, datos financieros, información de clientes y contratos.",
    "palabras_claves": [
      "Akira ransomware",
      "filtración de datos",
      "brecha de seguridad",
      "dark web",
      "datos financieros"
    ],
    "pais": "Estados Unidos",
    "sector": "Corporativo",
    "url": "https://t.co/kthiLlWyIg"
  },
  {
    "timestamp": "2024-05-18T10:00:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas ha afirmado haber comprometido los sistemas de Sanatorio Esperanza, una instalación de salud en Argentina.\nSe está filtrando una base de datos supuestamente extraída de la organización, afectando a más de 64,000 individuos.\nLos datos, exfiltrados de una base de datos SQL, incluyen una amplia gama de información personal y médica sensible.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "leaking",
      "database",
      "personal and medical information"
    ],
    "pais": "Argentina",
    "sector": "Salud",
    "url": "https://t.co/7a6Y3exvtp"
  },
  {
    "timestamp": "2024-07-29 12:00:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Un actor de amenazas afirma haber vulnerado los sistemas de Sanatorio Privado Punilla, un hospital en Argentina.\nLa información, extraída de una base de datos SQL, fue anunciada en un foro de la dark web.\nLa brecha incluye 173,892 registros con datos sensibles de pacientes y empleados.",
    "palabras_claves": [
      "threat actor",
      "breached",
      "data leak",
      "dark web forum",
      "SQL database"
    ],
    "pais": "Argentina",
    "sector": "Salud",
    "url": "https://t.co/HaR8lOm9j6"
  },
  {
    "timestamp": "2025-10-02 11:29:00",
    "categoria": "Prevención / Innovación en el Sector Financiero",
    "resumen": "El artículo detalla un plan de acción de tres pasos para que los Centros de Operaciones de Seguridad (SOC) mejoren la detección de amenazas. Propone un flujo de trabajo continuo con Feeds de Inteligencia de Amenazas, sandboxes interactivos y búsqueda de Inteligencia de Amenazas. El objetivo es reducir la sobrecarga de alertas, acelerar las investigaciones y reforzar las defensas, logrando hasta 3 veces más eficiencia en la detección de ciberataques.",
    "palabras_claves": [
      "threat detection",
      "SOC",
      "cybersecurity",
      "threat intelligence",
      "malware analysis"
    ],
    "pais": "",
    "sector": "",
    "url": "https://thehackernews.com/2025/10/how-to-close-threat-detection-gaps-your.html"
  },
  {
    "timestamp": "2024-07-29 12:00:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El grupo de extorsión Crimson Collective afirma haber vulnerado los repositorios privados de GitHub de Red Hat, una importante empresa estadounidense de software.\nAlegan haber robado 570GB de datos, incluyendo 28,000 repositorios internos, informes de interacción con clientes, tokens de autenticación y código fuente.\nRed Hat ha reconocido un incidente de seguridad relacionado con su negocio de consultoría y está tomando medidas correctivas.\nClientes de alto perfil en los sectores financiero, automotriz, telecomunicaciones, tecnología y gobierno podrían estar afectados.",
    "palabras_claves": [
      "Red Hat",
      "fuga de datos",
      "Crimson Collective",
      "GitHub",
      "extorsión"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://t.co/amMuJS09R0"
  },
  {
    "timestamp": "2025-10-02T12:01:00Z",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Google Mandiant y GTIG investigan una nueva ola de extorsión, posiblemente ligada a Cl0p ransomware, que afecta a organizaciones con Oracle E-Business Suite. Los atacantes envían correos exigiendo dinero, alegando robo de datos sensibles. Se sospecha que comprometen correos de usuarios y abusan de la función de reseteo de contraseña para obtener credenciales.",
    "palabras_claves": [
      "extortion",
      "ransomware",
      "Cl0p",
      "Oracle E-Business Suite",
      "data theft"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/google-mandiant-probes-new-oracle.html"
  },
  {
    "timestamp": "Thursday, October 2, 2025 at 12:07 PM UTC",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "El boletín de ciberseguridad detalla diversas amenazas, incluyendo exploits sin parche en Apple CarPlay, ataques sofisticados de SQL C2 y campañas de phishing generalizadas. Grandes empresas como Imgur enfrentan sanciones por privacidad de datos en el Reino Unido, mientras Google mejora la detección de ransomware en Drive. También se discuten las demandas gubernamentales de acceso a datos cifrados de iCloud.",
    "palabras_claves": [
      "ciberataque",
      "vulnerabilidad",
      "filtración de datos",
      "ransomware",
      "phishing"
    ],
    "pais": "USA",
    "sector": "Tecnología",
    "url": "https://thehackernews.com/2025/10/threatsday-bulletin-carplay-exploit.html"
  }
]