[
  {
    "timestamp": "2024-07-29T10:30:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Red Hat, el gigante de software empresarial, está siendo extorsionado por la banda ShinyHunters tras una importante filtración de datos.\nLa brecha, atribuida a Crimson Collective, comprometió 570GB de información desde su instancia GitLab, incluyendo 800 Customer Engagement Reports (CERs).\nEstos CERs contienen datos sensibles de clientes como Walmart, HSBC, Bank of Canada y American Express.\nShinyHunters ha publicado muestras de los datos robados y exige un rescate antes del 10 de octubre.",
    "palabras_claves": [
      "Red Hat",
      "ShinyHunters",
      "filtración de datos",
      "extorsión",
      "Customer Engagement Reports"
    ],
    "pais": "Estados Unidos",
    "sector": "Tecnología",
    "url": "https://www.bleepingcomputer.com/news/security/red-hat-data-breach-escalates-as-shinyhunters-joins-extortion/"
  },
  {
    "timestamp": "2024-05-15T10:30:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Oracle ha lanzado un parche de emergencia para una vulnerabilidad crítica (CVE-2025-61882) en su E-Business Suite, explotada activamente por el grupo de ransomware Cl0p. Este grupo ha robado datos y exigido rescates millonarios, aprovechando la falla para lograr ejecución remota de código y robo de credenciales. La actividad delictiva, que podría implicar a FIN11, comenzó en septiembre de 2025 y está siendo investigada por Mandiant y Google. Se han identificado indicadores de compromiso.",
    "palabras_claves": [
      "Oracle",
      "Cl0p",
      "vulnerabilidad",
      "ransomware",
      "fuga de datos"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://securityaffairs.com/183029/security/oracle-patches-critical-e-business-suite-flaw-exploited-by-cl0p-hackers.html"
  },
  {
    "timestamp": "2025-10-06T22:18:00",
    "categoria": "Incidentes y Fugas de Datos en Empresas",
    "resumen": "Discord ha revelado una brecha de seguridad en un proveedor externo de soporte al cliente. La filtración expuso datos de usuarios que contactaron a sus equipos de soporte, incluyendo nombres, correos electrónicos, IPs y detalles de facturación. También se vieron afectadas imágenes de identificación gubernamental. Discord afirma que sus sistemas no fueron accedidos directamente y ha notificado a las autoridades.",
    "palabras_claves": [
      "data breach",
      "Discord",
      "filtración de datos",
      "ciberseguridad",
      "datos de usuario"
    ],
    "pais": "",
    "sector": "Tecnología",
    "url": "https://securityaffairs.com/183039/data-breach/discord-discloses-third-party-breach-affecting-customer-support-data.html"
  }
]