[
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-65717",
    "descripcion": "An issue in Visual Studio Code Extensions Live Server v5.7.9 allows attackers to exfiltrate files via user interaction with a crafted HTML page."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-54068",
    "descripcion": "Livewire is a full-stack framework for Laravel. In Livewire v3 up to and including v3.6.3, a vulnerability allows unauthenticated attackers to achieve remote command execution in specific scenarios. The issue stems from how certain component property updates are hydrated. This ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2023-28432",
    "descripcion": "Minio is a Multi-Cloud Object Storage framework. In a cluster deployment starting with RELEASE.2019-12-17T23-16-33Z and prior to RELEASE.2023-03-20T20-16-18Z, MinIO returns all environment variables, including `MINIO_SECRET_KEY` and `MINIO_ROOT_PASSWORD`, resulting in ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-29969",
    "descripcion": "Time-of-check time-of-use (toctou) race condition in Windows Fundamentals allows an authorized attacker to execute code over a network."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2023-52271",
    "descripcion": "The wsftprm.sys kernel driver 2.0.0.0 in Topaz Antifraud allows low-privileged attackers to kill any (Protected Process Light) process via an IOCTL (which will be named at a later time)."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-29824",
    "descripcion": "Use after free in Windows Common Log File System Driver allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-71243",
    "descripcion": "The 'Saisies pour formulaire' (Saisies) plugin for SPIP versions 5.4.0 through 5.11.0 contains a critical Remote Code Execution (RCE) vulnerability. An attacker can exploit this vulnerability to execute arbitrary code on the server. Users should immediately update to version ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-64446",
    "descripcion": "A relative path traversal vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 through 7.0.11 may allow an attacker to execute administrative commands on the system via ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-13176",
    "descripcion": "Planting a custom configuration file in ESET Inspect Connector allow load a malicious DLL."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-58034",
    "descripcion": "An Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability [CWE-78] vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.5, FortiWeb 7.4.0 through 7.4.10, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 ..."
  }
]