[
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-62641",
    "descripcion": "Vulnerability in the Oracle VM VirtualBox product of Oracle Virtualization (component: Core). Supported versions that are affected are 7.1.12 and 7.2.2. Easily exploitable vulnerability allows high privileged attacker with logon to the infrastructure where Oracle VM VirtualBox ..."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-54236",
    "descripcion": "Adobe Commerce versions 2.4.9-alpha2, 2.4.8-p2, 2.4.7-p7, 2.4.6-p12, 2.4.5-p14, 2.4.4-p15 and earlier are affected by an Improper Input Validation vulnerability. A successful attacker can abuse this to achieve session takeover, increasing the confidentiality, and integrity ..."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-52665",
    "descripcion": "Currently trending CVE - Hype Score: 32"
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-61932",
    "descripcion": "Lanscope Endpoint Manager (On-Premises) (Client program (MR) and Detection agent (DA)) improperly verifies the origin of incoming requests, allowing an attacker to execute arbitrary code by sending specially crafted packets."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-22167",
    "descripcion": "This High severity Path Traversal (Arbitrary Write) vulnerability was introduced in versions: 9.12.0, 10.3.0 and remain present in 11.0.0 of Jira Software Data Center and Server. This Path Traversal (Arbitrary Write) vulnerability, with a CVSS Score of 8.7, allows an attacker to ..."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2024-3495",
    "descripcion": "The Country State City Dropdown CF7 plugin for WordPress is vulnerable to SQL Injection via the ‘cnt’ and 'sid' parameters in versions up to, and including, 2.7.2 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL ..."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-61884",
    "descripcion": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Runtime UI). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle ..."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-55315",
    "descripcion": "Inconsistent interpretation of http requests ('http request/response smuggling') in ASP.NET Core allows an authorized attacker to bypass a security feature over a network."
  }
]