[
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2024-54529",
    "descripcion": "A logic issue was addressed with improved checks. This issue is fixed in macOS Sequoia 15.2, macOS Ventura 13.7.2, macOS Sonoma 14.7.2. An app may be able to execute arbitrary code with kernel privileges."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-40551",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an untrusted data deserialization vulnerability that could lead to remote code execution, which would allow an attacker to run commands on the host machine. This could be exploited without authentication."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-40536",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to a security control bypass vulnerability that if exploited, could allow an unauthenticated attacker to gain access to certain restricted functionality."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2024-9680",
    "descripcion": "An attacker was able to achieve code execution in the content process by exploiting a use-after-free in Animation timelines. We have had reports of this vulnerability being exploited in the wild. This vulnerability affects Firefox < 131.0.2, Firefox ESR < 128.3.1, Firefox ESR < ..."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2024-30088",
    "descripcion": "Windows Kernel Elevation of Privilege Vulnerability"
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-40554",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an authentication bypass vulnerability that, if exploited, could allow an attacker to invoke specific actions within Web Help Desk."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-40552",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an authentication bypass vulnerability that if exploited, would allow a malicious actor to execute actions and methods that should be protected by authentication."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-40553",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an untrusted data deserialization vulnerability that could lead to remote code execution, which would allow an attacker to run commands on the host machine. This could be exploited without authentication."
  },
  {
    "fecha": "2026-02-01",
    "cve": "CVE-2025-64328",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. In versions 17.0.2.36 and above before 17.0.3, the filestore module within the Administrative interface is vulnerable to a post-authentication command injection by an authenticated known ..."
  }
]