[
  {
    "fecha": "2025-11-12",
    "cve": "CVE-2025-12480",
    "vendor": "Gladinet",
    "producto": "Triofox",
    "descripcion": "Gladinet Triofox contains an improper access control vulnerability that allows access to initial setup pages even after setup is complete."
  },
  {
    "fecha": "2025-11-12",
    "cve": "CVE-2025-62215",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Kernel contains a race condition vulnerability that allows a local attacker with low-level privileges to escalate privileges. Successful exploitation of this vulnerability could enable the attacker to gain SYSTEM-level access."
  },
  {
    "fecha": "2025-11-12",
    "cve": "CVE-2025-9242",
    "vendor": "WatchGuard",
    "producto": "Firebox",
    "descripcion": "WatchGuard Firebox contains an out-of-bounds write vulnerability in the OS iked process that may allow a remote unauthenticated attacker to execute arbitrary code."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-21042",
    "vendor": "Samsung",
    "producto": "Mobile Devices",
    "descripcion": "Samsung mobile devices contain an out-of-bounds write vulnerability in libimagecodec.quram.so. This vulnerability could allow remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-04",
    "cve": "CVE-2025-48703",
    "vendor": "CWP",
    "producto": "Control Web Panel",
    "descripcion": "CWP Control Web Panel (formerly CentOS Web Panel) contains an OS command Injection vulnerability that allows unauthenticated remote code execution via shell metacharacters in the t_total parameter in a filemanager changePerm request. A valid non-root username must be known."
  },
  {
    "fecha": "2025-11-04",
    "cve": "CVE-2025-11371",
    "vendor": "Gladinet",
    "producto": "CentreStack and Triofox",
    "descripcion": "Gladinet CentreStack and Triofox contains a files or directories accessible to external parties vulnerability that allows unintended disclosure of system files."
  },
  {
    "fecha": "2025-10-30",
    "cve": "CVE-2025-41244",
    "vendor": "Broadcom",
    "producto": "VMware Aria Operations and VMware Tools",
    "descripcion": "Broadcom VMware Aria Operations and VMware Tools contain a privilege defined with unsafe actions vulnerability. A malicious local actor with non-administrative privileges having access to a VM with VMware Tools installed and managed by Aria Operations with SDMP enabled may exploit this vulnerability to escalate privileges to root on the same VM."
  },
  {
    "fecha": "2025-10-30",
    "cve": "CVE-2025-24893",
    "vendor": "XWiki",
    "producto": "Platform",
    "descripcion": "XWiki Platform contains an eval injection vulnerability that could allow any guest to perform arbitrary remote code execution through a request to SolrSearch."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-6204",
    "vendor": "Dassault Systèmes",
    "producto": "DELMIA Apriso",
    "descripcion": "Dassault Systèmes DELMIA Apriso contains a code injection vulnerability that could allow an attacker to execute arbitrary code."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-6205",
    "vendor": "Dassault Systèmes",
    "producto": "DELMIA Apriso",
    "descripcion": "Dassault Systèmes DELMIA Apriso contains a missing authorization vulnerability that could allow an attacker to gain privileged access to the application."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-54236",
    "vendor": "Adobe",
    "producto": "Commerce and Magento",
    "descripcion": "Adobe Commerce and Magento Open Source contain an improper input validation vulnerability that could allow an attacker to take over customer accounts through the Commerce REST API."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-59287",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Server Update Service (WSUS) contains a deserialization of untrusted data vulnerability that allows for remote code execution."
  },
  {
    "fecha": "2025-10-22",
    "cve": "CVE-2025-61932",
    "vendor": "Motex",
    "producto": "LANSCOPE Endpoint Manager",
    "descripcion": "Motex LANSCOPE Endpoint Manager contains an improper verification of source of a communication channel vulnerability allowing an attacker to execute arbitrary code by sending specially crafted packets."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2022-48503",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple macOS, iOS, tvOS, Safari, and watchOS contain an unspecified vulnerability in JavaScriptCore that when processing web content may lead to arbitrary code execution. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-2746",
    "vendor": "Kentico",
    "producto": "Xperience CMS",
    "descripcion": "Kentico Xperience CMS contains an authentication bypass using an alternate path or channel vulnerability that could allow an attacker to control administrative objects."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-2747",
    "vendor": "Kentico",
    "producto": "Xperience CMS",
    "descripcion": "Kentico Xperience CMS contains an authentication bypass using an alternate path or channel vulnerability that could allow an attacker to control administrative objects."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-33073",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows SMB Client contains an improper access control vulnerability that could allow for privilege escalation. An attacker could execute a specially crafted malicious script to coerce the victim machine to connect back to the attack system using SMB and authenticate."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-61884",
    "vendor": "Oracle",
    "producto": "E-Business Suite",
    "descripcion": "Oracle E-Business Suite contains a server-side request forgery (SSRF) vulnerability in the Runtime component of Oracle Configurator. This vulnerability is remotely exploitable without authentication."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-54253",
    "vendor": "Adobe",
    "producto": "Experience Manager (AEM) Forms",
    "descripcion": "Adobe Experience Manager Forms in JEE contains an unspecified vulnerability that allows for arbitrary code execution."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2025-47827",
    "vendor": "IGEL",
    "producto": "IGEL OS",
    "descripcion": "IGEL OS contains a use of a key past its expiration date vulnerability that allows for Secure Boot bypass. The igel-flash-driver module improperly verifies a cryptographic signature. Ultimately, a crafted root filesystem can be mounted from an unverified SquashFS image."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2025-24990",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Agere Modem Driver contains an untrusted pointer dereference vulnerability that allows for privilege escalation. An attacker who successfully exploited this vulnerability could gain administrator privileges."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2025-59230",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows contains an improper access control vulnerability in Windows Remote Access Connection Manager which could allow an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2016-7836",
    "vendor": "SKYSEA",
    "producto": "Client View",
    "descripcion": "SKYSEA Client View contains an improper authentication vulnerability that allows remote code execution via a flaw in processing authentication on the TCP connection with the management console program."
  },
  {
    "fecha": "2025-10-09",
    "cve": "CVE-2021-43798",
    "vendor": "Grafana Labs",
    "producto": "Grafana",
    "descripcion": "Grafana contains a path traversal vulnerability that could allow access to local files."
  },
  {
    "fecha": "2025-10-07",
    "cve": "CVE-2025-27915",
    "vendor": "Synacor",
    "producto": "Zimbra Collaboration Suite (ZCS)",
    "descripcion": "Synacor Zimbra Collaboration Suite (ZCS) contains a cross-site scripting vulnerability that exists in the Classic Web Client due to insufficient sanitization of HTML content in ICS files. When a user views an e-mail message containing a malicious ICS entry, its embedded JavaScript executes via an ontoggle event inside a tag. This allows an attacker to run arbitrary JavaScript within the victim's session, potentially leading to unauthorized actions such as setting e-mail filters to redirect messages to an attacker-controlled address. As a result, an attacker can perform unauthorized actions on the victim's account, including e-mail redirection and data exfiltration."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2021-22555",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux Kernel contains a heap out-of-bounds write vulnerability that could allow an attacker to gain privileges or cause a DoS (via heap memory corruption) through user name space."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2010-3962",
    "vendor": "Microsoft",
    "producto": "Internet Explorer",
    "descripcion": "Microsoft Internet Explorer contains an uninitialized memory corruption vulnerability that could allow for remote code execution. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2021-43226",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Common Log File System Driver contains a privilege escalation vulnerability that could allow a local, privileged attacker to bypass certain security mechanisms."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2013-3918",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows contains an out-of-bounds write vulnerability in the InformationCardSigninHelper Class ActiveX control, icardie.dll. An attacker could exploit the vulnerability by constructing a specially crafted webpage. When a user views the webpage, the vulnerability could allow remote code execution. An attacker who successfully exploited this vulnerability could gain the same user rights as the current user. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2011-3402",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Kernel contains an unspecified vulnerability in the TrueType font parsing engine in win32k.sys in the kernel-mode drivers that allows remote attackers to execute arbitrary code via crafted font data in a Word document or web page."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2010-3765",
    "vendor": "Mozilla",
    "producto": "Multiple Products",
    "descripcion": "Mozilla Firefox, SeaMonkey, and Thunderbird contain an unspecified vulnerability when JavaScript is enabled. This allows remote attackers to execute arbitrary code via vectors related to nsCSSFrameConstructor::ContentAppended, the appendChild method, incorrect index tracking, and the creation of multiple frames, which triggers memory corruption."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2025-61882",
    "vendor": "Oracle",
    "producto": "E-Business Suite",
    "descripcion": "Oracle E-Business Suite contains an unspecified vulnerability in the BI Publisher Integration component. The vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Concurrent Processing. Successful attacks can result in takeover of Oracle Concurrent Processing."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2014-6278",
    "vendor": "GNU",
    "producto": "GNU Bash",
    "descripcion": "GNU Bash contains an OS command injection vulnerability which allows remote attackers to execute arbitrary commands via a crafted environment."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2017-1000353",
    "vendor": "Jenkins",
    "producto": "Jenkins",
    "descripcion": "Jenkins contains a remote code execution vulnerability. This vulnerability that could allowed attackers to transfer a serialized Java SignedObject object to the remoting-based Jenkins CLI, that would be deserialized using a new ObjectInputStream, bypassing the existing blocklist-based protection mechanism."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2015-7755",
    "vendor": "Juniper",
    "producto": "ScreenOS",
    "descripcion": "Juniper ScreenOS contains an improper authentication vulnerability that could allow unauthorized remote administrative access to the device."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2025-21043",
    "vendor": "Samsung",
    "producto": "Mobile Devices",
    "descripcion": "Samsung mobile devices contain an out-of-bounds write vulnerability in libimagecodec.quram.so which allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2025-4008",
    "vendor": "Smartbedded",
    "producto": "Meteobridge",
    "descripcion": "Smartbedded Meteobridge contains a command injection vulnerability that could allow remote unauthenticated attackers to gain arbitrary command execution with elevated privileges (root) on affected devices."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-32463",
    "vendor": "Sudo",
    "producto": "Sudo",
    "descripcion": "Sudo contains an inclusion of functionality from untrusted control sphere vulnerability. This vulnerability could allow local attacker to leverage sudo’s -R (--chroot) option to run arbitrary commands as root, even if they are not listed in the sudoers file."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-59689",
    "vendor": "Libraesva",
    "producto": "Email Security Gateway",
    "descripcion": "Libraesva Email Security Gateway (ESG) contains a command injection vulnerability which allows command injection via a compressed e-mail attachment."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-10035",
    "vendor": "Fortra",
    "producto": "GoAnywhere MFT",
    "descripcion": "Fortra GoAnywhere MFT contains a deserialization of untrusted data vulnerability allows an actor with a validly forged license response signature to deserialize an arbitrary actor-controlled object, possibly leading to command injection."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-20352",
    "vendor": "Cisco",
    "producto": "IOS and IOS XE",
    "descripcion": "Cisco IOS and IOS XE contains a stack-based buffer overflow vulnerability in the Simple Network Management Protocol (SNMP) subsystem that could allow for denial of service or remote code execution. A successful exploit could allow a low-privileged attacker to cause the affected system to reload, resulting in a DoS condition, or allow a high-privileged attacker to execute arbitrary code as the root user and obtain full control of the affected system."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2021-21311",
    "vendor": "Adminer",
    "producto": "Adminer",
    "descripcion": "Adminer contains a server-side request forgery vulnerability that, when exploited, allows a remote attacker to obtain potentially sensitive information."
  },
  {
    "fecha": "2025-09-25",
    "cve": "CVE-2025-20362",
    "vendor": "Cisco",
    "producto": "Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense",
    "descripcion": "Cisco Secure Firewall Adaptive Security (ASA) Appliance and Secure Firewall Threat Defense (FTD) Software VPN Web Server contain a missing authorization vulnerability. This vulnerability could be chained with CVE-2025-20333."
  },
  {
    "fecha": "2025-09-25",
    "cve": "CVE-2025-20333",
    "vendor": "Cisco",
    "producto": "Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense",
    "descripcion": "Cisco Secure Firewall Adaptive Security (ASA) Appliance and Secure Firewall Threat Defense (FTD) Software VPN Web Server contain a buffer overflow vulnerability that allows for remote code execution. This vulnerability could be chained with CVE-2025-20362."
  },
  {
    "fecha": "2025-09-23",
    "cve": "CVE-2025-10585",
    "vendor": "Google",
    "producto": "Chromium V8",
    "descripcion": "Google Chromium contains a type confusion vulnerability in the V8 JavaScript and WebAssembly engine."
  },
  {
    "fecha": "2025-09-11",
    "cve": "CVE-2025-5086",
    "vendor": "Dassault Systèmes",
    "producto": "DELMIA Apriso",
    "descripcion": "Dassault Systèmes DELMIA Apriso contains a deserialization of untrusted data vulnerability that could lead to a remote code execution."
  },
  {
    "fecha": "2025-09-04",
    "cve": "CVE-2025-38352",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux kernel contains a time-of-check time-of-use (TOCTOU) race condition vulnerability that has a high impact on confidentiality, integrity, and availability."
  },
  {
    "fecha": "2025-09-04",
    "cve": "CVE-2025-48543",
    "vendor": "Android",
    "producto": "Runtime",
    "descripcion": "Android Runtime contains a use-after-free vulnerability potentially allowing a chrome sandbox escape leading to local privilege escalation."
  },
  {
    "fecha": "2025-09-04",
    "cve": "CVE-2025-53690",
    "vendor": "Sitecore",
    "producto": "Multiple Products",
    "descripcion": "Sitecore Experience Manager (XM), Experience Platform (XP), Experience Commerce (XC), and Managed Cloud contain a deserialization of untrusted data vulnerability involving the use of default machine keys. This flaw allows attackers to exploit exposed ASP.NET machine keys to achieve remote code execution."
  },
  {
    "fecha": "2025-09-03",
    "cve": "CVE-2023-50224",
    "vendor": "TP-Link",
    "producto": "TL-WR841N",
    "descripcion": "TP-Link TL-WR841N contains an authentication bypass by spoofing vulnerability within the httpd service, which listens on TCP port 80 by default, leading to the disclose of stored credentials. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-09-03",
    "cve": "CVE-2025-9377",
    "vendor": "TP-Link",
    "producto": "Multiple Routers",
    "descripcion": "TP-Link Archer C7(EU) and TL-WR841N/ND(MS) contain an OS command injection vulnerability that exists in the Parental Control page. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-09-02",
    "cve": "CVE-2020-24363",
    "vendor": "TP-Link",
    "producto": "TL-WA855RE",
    "descripcion": "TP-link TL-WA855RE contains a missing authentication for critical function vulnerability. This vulnerability could allow an unauthenticated attacker (on the same network) to submit a TDDP_RESET POST request for a factory reset and reboot. The attacker can then obtain incorrect access control by setting a new administrative password. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-09-02",
    "cve": "CVE-2025-55177",
    "vendor": "Meta Platforms",
    "producto": "WhatsApp",
    "descripcion": "Meta Platforms WhatsApp contains an incorrect authorization vulnerability due to an incomplete authorization of linked device synchronization messages. This vulnerability could allow an unrelated user to trigger processing of content from an arbitrary URL on a target’s device."
  },
  {
    "fecha": "2025-08-29",
    "cve": "CVE-2025-57819",
    "vendor": "Sangoma",
    "producto": "FreePBX",
    "descripcion": "Sangoma FreePBX contains an authentication bypass vulnerability due to insufficiently sanitized user-supplied data allows unauthenticated access to FreePBX Administrator leading to arbitrary database manipulation and remote code execution."
  },
  {
    "fecha": "2025-08-26",
    "cve": "CVE-2025-7775",
    "vendor": "Citrix",
    "producto": "NetScaler",
    "descripcion": "Citrix NetScaler ADC and NetScaler Gateway contain a memory overflow vulnerability that could allow for remote code execution and/or denial of service."
  },
  {
    "fecha": "2025-08-25",
    "cve": "CVE-2025-48384",
    "vendor": "Git",
    "producto": "Git",
    "descripcion": "Git contains a link following vulnerability that stems from Git’s inconsistent handling of carriage return characters in configuration files."
  },
  {
    "fecha": "2025-08-25",
    "cve": "CVE-2024-8068",
    "vendor": "Citrix",
    "producto": "Session Recording",
    "descripcion": "Citrix Session Recording contains an improper privilege management vulnerability that could allow for privilege escalation to NetworkService Account access. An attacker must be an authenticated user in the same Windows Active Directory domain as the session recording server domain."
  },
  {
    "fecha": "2025-08-25",
    "cve": "CVE-2024-8069",
    "vendor": "Citrix",
    "producto": "Session Recording",
    "descripcion": "Citrix Session Recording contains a deserialization of untrusted data vulnerability that allows limited remote code execution with privilege of a NetworkService Account access. Attacker must be an authenticated user on the same intranet as the session recording server."
  },
  {
    "fecha": "2025-08-21",
    "cve": "CVE-2025-43300",
    "vendor": "Apple",
    "producto": "iOS, iPadOS, and macOS",
    "descripcion": "Apple iOS, iPadOS, and macOS contain an out-of-bounds write vulnerability in the Image I/O framework."
  },
  {
    "fecha": "2025-08-18",
    "cve": "CVE-2025-54948",
    "vendor": "Trend Micro",
    "producto": "Apex One",
    "descripcion": "Trend Micro Apex One Management Console (on-premise) contains an OS command injection vulnerability that could allow a pre-authenticated remote attacker to upload malicious code and execute commands on affected installations."
  },
  {
    "fecha": "2025-08-13",
    "cve": "CVE-2025-8876",
    "vendor": "N-able",
    "producto": "N-Central",
    "descripcion": "N-able N-Central contains a command injection vulnerability via improper sanitization of user input."
  },
  {
    "fecha": "2025-08-13",
    "cve": "CVE-2025-8875",
    "vendor": "N-able",
    "producto": "N-Central",
    "descripcion": "N-able N-Central contains an insecure deserialization vulnerability that could lead to command execution."
  },
  {
    "fecha": "2025-08-12",
    "cve": "CVE-2025-8088",
    "vendor": "RARLAB",
    "producto": "WinRAR",
    "descripcion": "RARLAB WinRAR contains a path traversal vulnerability affecting the Windows version of WinRAR. This vulnerability could allow an attacker to execute arbitrary code by crafting malicious archive files."
  },
  {
    "fecha": "2025-08-12",
    "cve": "CVE-2007-0671",
    "vendor": "Microsoft",
    "producto": "Office",
    "descripcion": "Microsoft Office Excel contains a remote code execution vulnerability that can be exploited when a specially crafted Excel file is opened. This malicious file could be delivered as an email attachment or hosted on a malicious website. An attacker could leverage this vulnerability by creating a specially crafted Excel file, which, when opened, allowing an attacker to execute remote code on the affected system."
  },
  {
    "fecha": "2025-08-12",
    "cve": "CVE-2013-3893",
    "vendor": "Microsoft",
    "producto": "Internet Explorer",
    "descripcion": "Microsoft Internet Explorer contains a memory corruption vulnerability that allows for remote code execution. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-08-05",
    "cve": "CVE-2020-25078",
    "vendor": "D-Link",
    "producto": "DCS-2530L and DCS-2670L Devices",
    "descripcion": "D-Link DCS-2530L and DCS-2670L devices contains an unspecified vulnerability that could allow for remote administrator password disclosure. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-08-05",
    "cve": "CVE-2020-25079",
    "vendor": "D-Link",
    "producto": "DCS-2530L and DCS-2670L Devices",
    "descripcion": "D-Link DCS-2530L and DCS-2670L devices contains a command injection vulnerability in the cgi-bin/ddns_enc.cgi. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-08-05",
    "cve": "CVE-2022-40799",
    "vendor": "D-Link",
    "producto": "DNR-322L",
    "descripcion": "D-Link DNR-322L contains a download of code without integrity check vulnerability that could allow an authenticated attacker to execute OS level commands on the device. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-07-28",
    "cve": "CVE-2023-2533",
    "vendor": "PaperCut",
    "producto": "NG/MF",
    "descripcion": "PaperCut NG/MF contains a cross-site request forgery (CSRF) vulnerability, which, under specific conditions, could potentially enable an attacker to alter security settings or execute arbitrary code."
  },
  {
    "fecha": "2025-07-28",
    "cve": "CVE-2025-20337",
    "vendor": "Cisco",
    "producto": "Identity Services Engine",
    "descripcion": "Cisco Identity Services Engine contains an injection vulnerability in a specific API of Cisco ISE and Cisco ISE-PIC due to insufficient validation of user-supplied input allowing an attacker to exploit this vulnerability by submitting a crafted API request. Successful exploitation could allow an attacker to perform remote code execution and obtaining root privileges on an affected device."
  },
  {
    "fecha": "2025-07-28",
    "cve": "CVE-2025-20281",
    "vendor": "Cisco",
    "producto": "Identity Services Engine",
    "descripcion": "Cisco Identity Services Engine contains an injection vulnerability in a specific API of Cisco ISE and Cisco ISE-PIC due to insufficient validation of user-supplied input allowing an attacker to exploit this vulnerability by submitting a crafted API request. Successful exploitation could allow an attacker to perform remote code execution and obtaining root privileges on an affected device."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-2775",
    "vendor": "SysAid",
    "producto": "SysAid On-Prem",
    "descripcion": "SysAid On-Prem contains an improper restriction of XML external entity reference vulnerability in the Checkin processing functionality, allowing for administrator account takeover and file read primitives."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-2776",
    "vendor": "SysAid",
    "producto": "SysAid On-Prem",
    "descripcion": "SysAid On-Prem contains an improper restriction of XML external entity reference vulnerability in the Server URL processing functionality, allowing for administrator account takeover and file read primitives."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-6558",
    "vendor": "Google",
    "producto": "Chromium",
    "descripcion": "Google Chromium contains an improper input validation vulnerability in ANGLE and GPU. This vulnerability could allow a remote attacker to potentially perform a sandbox escape via a crafted HTML page. This vulnerability could affect multiple web browsers that utilize Chromium, including, but not limited to, Google Chrome, Microsoft Edge, and Opera."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-54309",
    "vendor": "CrushFTP",
    "producto": "CrushFTP",
    "descripcion": "CrushFTP contains an unprotected alternate channel vulnerability. When the DMZ proxy feature is not used, mishandles AS2 validation and consequently allows remote attackers to obtain admin access via HTTPS."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-49704",
    "vendor": "Microsoft",
    "producto": "SharePoint",
    "descripcion": "Microsoft SharePoint contains a code injection vulnerability that could allow an authorized attacker to execute code over a network. This vulner