[
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2025-59536",
    "descripcion": "Claude Code is an agentic coding tool. Versions before 1.0.111 were vulnerable to Code Injection due to a bug in the startup trust dialog implementation. Claude Code could be tricked to execute code contained in a project before the user accepted the startup trust dialog. ..."
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2026-21852",
    "descripcion": "Claude Code is an agentic coding tool. Prior to version 2.0.65, vulnerability in Claude Code's project-load flow allowed malicious repositories to exfiltrate data including Anthropic API keys before users confirmed trust. An attacker-controlled repository could include a ..."
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2023-20869",
    "descripcion": "VMware Workstation (17.x) and VMware Fusion (13.x) contain a stack-based buffer-overflow vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2023-20870",
    "descripcion": "VMware Workstation and Fusion contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2023-34044",
    "descripcion": "VMware Workstation( 17.x prior to 17.5) and Fusion(13.x prior to 13.5) contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine. A malicious actor with local administrative privileges on a virtual ..."
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2025-5959",
    "descripcion": "Type Confusion in V8 in Google Chrome prior to 137.0.7151.103 allowed a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2025-71210",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2025-15060",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2025-71211",
    "descripcion": "Currently trending CVE - Hype Score: 5"
  },
  {
    "fecha": "2026-02-27",
    "cve": "CVE-2025-71243",
    "descripcion": "The 'Saisies pour formulaire' (Saisies) plugin for SPIP versions 5.4.0 through 5.11.0 contains a critical Remote Code Execution (RCE) vulnerability. An attacker can exploit this vulnerability to execute arbitrary code on the server. Users should immediately update to version ..."
  }
]