[
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-68947",
    "descripcion": "NSecsoft 'NSecKrnl' is a Windows driver that allows a local, authenticated attacker to terminate processes owned by other users, including SYSTEM and Protected Processes by issuing crafted IOCTL requests to the driver."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2026-21722",
    "descripcion": "Public dashboards with annotations enabled did not limit their annotation timerange to the locked timerange of the public dashboard. This means one could read the entire history of annotations visible on the specific dashboard, even those outside the locked timerange. This did ..."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-1974",
    "descripcion": "A security issue was discovered in Kubernetes where under certain conditions, an unauthenticated attacker with access to the pod network can achieve arbitrary code execution in the context of the ingress-nginx controller. This can lead to disclosure of Secrets accessible to the ..."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-41117",
    "descripcion": "Stack traces in Grafana's Explore Traces view can be rendered as raw HTML, and thus inject malicious JavaScript in the browser. This would require malicious JavaScript to be entered into the stack trace field. Only datasources with the Jaeger HTTP API appear to be affected; ..."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2024-27564",
    "descripcion": "pictureproxy.php in the dirk1983 mm1.ltd source code f9f4bbc allows SSRF via the url parameter. NOTE: the references section has an archived copy of pictureproxy.php from its original GitHub location, but the repository name might later change because it is misleading."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-13154",
    "descripcion": "An improper link following vulnerability was reported in the SmartPerformanceAddin for Lenovo Vantage that could allow an authenticated local user to perform an arbitrary file deletion with elevated privileges."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-64111",
    "descripcion": "Gogs is an open source self-hosted Git service. In version 0.13.3 and prior, due to the insufficient patch for CVE-2024-56731, it's still possible to update files in the .git directory and achieve remote command execution. This issue has been patched in versions 0.13.4 and ..."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-64175",
    "descripcion": "Gogs is an open source self-hosted Git service. In version 0.13.3 and prior, Gogs’ 2FA recovery code validation does not scope codes by user, enabling cross-account bypass. If an attacker knows a victim’s username and password, they can use any unused recovery code (e.g., from ..."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2026-24135",
    "descripcion": "Gogs is an open source self-hosted Git service. In version 0.13.3 and prior, a path traversal vulnerability exists in the updateWikiPage function of Gogs. The vulnerability allows an authenticated user with write access to a repository's wiki to delete arbitrary files on the ..."
  },
  {
    "fecha": "2026-02-12",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  }
]