[
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-55752",
    "descripcion": "Relative Path Traversal vulnerability in Apache Tomcat. The fix for bug 60013 introduced a regression where the rewritten URL was normalized before it was decoded. This introduced the possibility that, for rewrite rules that rewrite query parameters to the ..."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-2783",
    "descripcion": "Incorrect handle provided in unspecified circumstances in Mojo in Google Chrome on Windows prior to 134.0.6998.177 allowed a remote attacker to perform a sandbox escape via a malicious file. (Chromium security severity: High)"
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-55754",
    "descripcion": "Improper Neutralization of Escape, Meta, or Control Sequences vulnerability in Apache Tomcat. Tomcat did not escape ANSI escape sequences in log messages. If Tomcat was running in a console on a Windows operating system, and the console supported ANSI escape sequences, it was ..."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-12080",
    "descripcion": "On Wear OS devices, when Google Messages is configured as the default SMS/MMS/RCS application, the handling of ACTION_SENDTO intents utilizing the sms:, smsto:, mms:, and mmsto: Uniform Resource Identifier (URI) schemes is incorrectly implemented. Due to this misconfiguration, ..."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-61795",
    "descripcion": "Improper Resource Shutdown or Release vulnerability in Apache Tomcat. If an error occurred (including exceeding limits) during the processing of a multipart upload, temporary copies of the uploaded parts written to disc were not cleaned up immediately but left for the garbage ..."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-57819",
    "descripcion": "FreePBX is an open-source web-based graphical user interface. FreePBX 15, 16, and 17 endpoints are vulnerable due to insufficiently sanitized user-supplied data allowing unauthenticated access to FreePBX Administrator leading to arbitrary database manipulation and remote code ..."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-55315",
    "descripcion": "Inconsistent interpretation of http requests ('http request/response smuggling') in ASP.NET Core allows an authorized attacker to bypass a security feature over a network."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2023-46747",
    "descripcion": "Undisclosed requests may bypass configuration utility authentication, allowing an attacker with network access to the BIG-IP system through the management port and/or self IP addresses to execute arbitrary system commands. Note: Software versions which have reached End of ..."
  },
  {
    "fecha": "2025-10-29",
    "cve": "CVE-2025-8061",
    "descripcion": "A potential insufficient access control vulnerability was reported in the Lenovo Dispatcher 3.0 and Dispatcher 3.1 drivers used by some Lenovo consumer notebooks that could allow an authenticated local user to execute code with elevated privileges. The Lenovo Dispatcher 3.2 ..."
  }
]