[
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-55315",
    "descripcion": "Inconsistent interpretation of http requests ('http request/response smuggling') in ASP.NET Core allows an authorized attacker to bypass a security feature over a network."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-33073",
    "descripcion": "Improper access control in Windows SMB allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-55680",
    "descripcion": "Time-of-check time-of-use (toctou) race condition in Windows Cloud Files Mini Filter Driver allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-62641",
    "descripcion": "Vulnerability in the Oracle VM VirtualBox product of Oracle Virtualization (component: Core). Supported versions that are affected are 7.1.12 and 7.2.2. Easily exploitable vulnerability allows high privileged attacker with logon to the infrastructure where Oracle VM VirtualBox ..."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-61884",
    "descripcion": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Runtime UI). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle ..."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2023-46747",
    "descripcion": "Undisclosed requests may bypass configuration utility authentication, allowing an attacker with network access to the BIG-IP system through the management port and/or self IP addresses to execute arbitrary system commands. Note: Software versions which have reached End of ..."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-62518",
    "descripcion": "astral-tokio-tar is a tar archive reading/writing library for async Rust. Versions of astral-tokio-tar prior to 0.5.6 contain a boundary parsing vulnerability that allows attackers to smuggle additional archive entries by exploiting inconsistent PAX/ustar header handling. When ..."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-23",
    "cve": "CVE-2025-59489",
    "descripcion": "Unity Runtime before 2025-10-02 on Android, Windows, macOS, and Linux allows argument injection that can result in loading of library code from an unintended location. If an application was built with a version of Unity Editor that had the vulnerable Unity Runtime code, then an ..."
  }
]