[
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-31201",
    "descripcion": "This issue was addressed by removing the vulnerable code. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication. Apple is aware ..."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-31200",
    "descripcion": "A memory corruption issue was addressed with improved bounds checking. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. Processing an audio stream in a maliciously crafted media file may result in code execution. Apple ..."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-69258",
    "descripcion": "A LoadLibraryEX vulnerability in Trend Micro Apex Central could allow an unauthenticated remote attacker to load an attacker-controlled DLL into a key executable, leading to execution of attacker-supplied code under the context of SYSTEM on affected installations."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-22224",
    "descripcion": "VMware ESXi, and Workstation contain a TOCTOU (Time-of-Check Time-of-Use) vulnerability that leads to an out-of-bounds write. A malicious actor with local administrative privileges on a virtual machine may exploit this issue to execute code as the virtual machine's VMX process ..."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-22225",
    "descripcion": "VMware ESXi contains an arbitrary write vulnerability. A malicious actor with privileges within the VMX process may trigger an arbitrary kernel write leading to an escape of the sandbox."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-22226",
    "descripcion": "VMware ESXi, Workstation, and Fusion contain an information disclosure vulnerability due to an out-of-bounds read in HGFS. A malicious actor with administrative privileges to a virtual machine may be able to exploit this issue to leak memory from the vmx process."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2024-43093",
    "descripcion": "In shouldHideDocument of ExternalStorageProvider.java, there is a possible bypass of a file path filter designed to prevent access to sensitive directories due to incorrect unicode normalization. This could lead to local escalation of privilege with no additional execution ..."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-52691",
    "descripcion": "Successful exploitation of the vulnerability could allow an unauthenticated attacker to upload arbitrary files to any location on the mail server, potentially enabling remote code execution."
  },
  {
    "fecha": "2026-01-11",
    "cve": "CVE-2025-54068",
    "descripcion": "Livewire is a full-stack framework for Laravel. In Livewire v3 up to and including v3.6.3, a vulnerability allows unauthenticated attackers to achieve remote command execution in specific scenarios. The issue stems from how certain component property updates are hydrated. This ..."
  }
]