[
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-11953",
    "descripcion": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server ..."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-62626",
    "descripcion": "Currently trending CVE - Hype Score: 32"
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-21479",
    "descripcion": "Memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-9491",
    "descripcion": "Microsoft Windows LNK File UI Misrepresentation Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Microsoft Windows. User interaction is required to exploit this vulnerability in that the target ..."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2021-27877",
    "descripcion": "An issue was discovered in Veritas Backup Exec before 21.2. It supports multiple authentication schemes: SHA authentication is one of these. This authentication scheme is no longer used in current versions of the product, but hadn't yet been disabled. An attacker could remotely ..."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2023-20269",
    "descripcion": "A vulnerability in the remote access VPN feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to conduct a brute force attack in an attempt to identify valid username and ..."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-50168",
    "descripcion": "Access of resource using incompatible type ('type confusion') in Windows Win32K - ICOMP allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-52665",
    "descripcion": "A malicious actor with access to the management network could exploit a misconfiguration in UniFi’s door access application, UniFi Access, that exposed a management API without proper authentication. This vulnerability was introduced in Version 3.3.22 and was fixed in Version ..."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-11-06",
    "cve": "CVE-2025-64110",
    "descripcion": "Cursor is a code editor built for programming with AI. In versions 1.7.23 and below, a logic bug allows a malicious agent to read sensitive files that should be protected via cursorignore. An attacker who has already achieved prompt injection, or a malicious model, could create ..."
  }
]