[
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2024-40766",
    "descripcion": "An improper access control vulnerability has been identified in the SonicWall SonicOS management access, potentially leading to unauthorized resource access and in specific conditions, causing the firewall to crash. This issue affects SonicWall Firewall Gen 5 and Gen 6 devices, ..."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-61913",
    "descripcion": "Flowise is a drag & drop user interface to build a customized large language model flow. In versions prior to 3.0.8, WriteFileTool and ReadFileTool in Flowise do not restrict file path access, allowing authenticated attackers to exploit this vulnerability to read and write ..."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-11001",
    "descripcion": "Currently trending CVE - Hype Score: 11"
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-11002",
    "descripcion": "Currently trending CVE - Hype Score: 10"
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-49844",
    "descripcion": "Redis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem ..."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-11371",
    "descripcion": "In the default installation and configuration of Gladinet CentreStack and TrioFox, there is an unauthenticated Local File Inclusion Flaw that allows unintended disclosure of system files. Exploitation of this vulnerability has been observed in the wild. This issue impacts ..."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-53770",
    "descripcion": "Deserialization of untrusted data in on-premises Microsoft SharePoint Server allows an unauthorized attacker to execute code over a network. Microsoft is aware that an exploit for CVE-2025-53770 exists in the wild. Microsoft is preparing and fully testing a comprehensive update ..."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-3600",
    "descripcion": "In Progress® Telerik® UI for AJAX, versions 2011.2.712 to 2025.1.218, an unsafe reflection vulnerability exists that may lead to an unhandled exception resulting in a crash of the hosting process and denial of service."
  },
  {
    "fecha": "2025-10-12",
    "cve": "CVE-2025-55177",
    "descripcion": "Incomplete authorization of linked device synchronization messages in WhatsApp for iOS prior to v2.25.21.73, WhatsApp Business for iOS v2.25.21.78, and WhatsApp for Mac v2.25.21.78 could have allowed an unrelated user to trigger processing of content from an arbitrary URL on a ..."
  }
]