[
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2024-54529",
    "descripcion": "A logic issue was addressed with improved checks. This issue is fixed in macOS Sequoia 15.2, macOS Ventura 13.7.2, macOS Sonoma 14.7.2. An app may be able to execute arbitrary code with kernel privileges."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-5419",
    "descripcion": "Out of bounds read and write in V8 in Google Chrome prior to 137.0.7151.68 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-40551",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an untrusted data deserialization vulnerability that could lead to remote code execution, which would allow an attacker to run commands on the host machine. This could be exploited without authentication."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-40554",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an authentication bypass vulnerability that, if exploited, could allow an attacker to invoke specific actions within Web Help Desk."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-40552",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an authentication bypass vulnerability that if exploited, would allow a malicious actor to execute actions and methods that should be protected by authentication."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-15467",
    "descripcion": "Issue summary: Parsing CMS AuthEnvelopedData message with maliciously crafted AEAD parameters can trigger a stack buffer overflow. Impact summary: A stack buffer overflow may lead to a crash, causing Denial of Service, or potentially remote code execution. When parsing CMS ..."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-52691",
    "descripcion": "Successful exploitation of the vulnerability could allow an unauthenticated attacker to upload arbitrary files to any location on the mail server, potentially enabling remote code execution."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2026-01-31",
    "cve": "CVE-2025-64328",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. In versions 17.0.2.36 and above before 17.0.3, the filestore module within the Administrative interface is vulnerable to a post-authentication command injection by an authenticated known ..."
  }
]