[
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2025-41117",
    "descripcion": "Stack traces in Grafana's Explore Traces view can be rendered as raw HTML, and thus inject malicious JavaScript in the browser. This would require malicious JavaScript to be entered into the stack trace field. Only datasources with the Jaeger HTTP API appear to be affected; ..."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2026-21722",
    "descripcion": "Public dashboards with annotations enabled did not limit their annotation timerange to the locked timerange of the public dashboard. This means one could read the entire history of annotations visible on the specific dashboard, even those outside the locked timerange. This did ..."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2025-15556",
    "descripcion": "Notepad++ versions prior to 8.8.9, when using the WinGUp updater, contain an update integrity verification vulnerability where downloaded update metadata and installers are not cryptographically verified. An attacker able to intercept or redirect update traffic can cause the ..."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2024-27564",
    "descripcion": "pictureproxy.php in the dirk1983 mm1.ltd source code f9f4bbc allows SSRF via the url parameter. NOTE: the references section has an archived copy of pictureproxy.php from its original GitHub location, but the repository name might later change because it is misleading."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2024-27834",
    "descripcion": "The issue was addressed with improved checks. This issue is fixed in iOS 17.5 and iPadOS 17.5, tvOS 17.5, Safari 17.5, watchOS 10.5, macOS Sonoma 14.5. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2024-43468",
    "descripcion": "Microsoft Configuration Manager Remote Code Execution Vulnerability"
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2026-20700",
    "descripcion": "A memory corruption issue was addressed with improved state management. This issue is fixed in watchOS 26.3, tvOS 26.3, macOS Tahoe 26.3, visionOS 26.3, iOS 26.3 and iPadOS 26.3. An attacker with memory write capability may be able to execute arbitrary code. Apple is aware of a ..."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2025-13154",
    "descripcion": "An improper link following vulnerability was reported in the SmartPerformanceAddin for Lenovo Vantage that could allow an authenticated local user to perform an arbitrary file deletion with elevated privileges."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2026-02-13",
    "cve": "CVE-2025-68947",
    "descripcion": "NSecsoft 'NSecKrnl' is a Windows driver that allows a local, authenticated attacker to terminate processes owned by other users, including SYSTEM and Protected Processes by issuing crafted IOCTL requests to the driver."
  }
]