[
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-68613",
    "descripcion": "n8n is an open source workflow automation platform. Versions starting with 0.211.0 and prior to 1.120.4, 1.121.1, and 1.122.0 contain a critical Remote Code Execution (RCE) vulnerability in their workflow expression evaluation system. Under certain conditions, expressions ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-14847",
    "descripcion": "Mismatched length fields in Zlib compressed protocol headers may allow a read of uninitialized heap memory by an unauthenticated client. This issue affects all MongoDB Server v7.0 prior to 7.0.28 versions, MongoDB Server v8.0 versions prior to 8.0.17, MongoDB Server v8.2 ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2024-4367",
    "descripcion": "A type check was missing when handling fonts in PDF.js, which would allow arbitrary JavaScript execution in the PDF.js context. This vulnerability affects Firefox < 126, Firefox ESR < 115.11, and Thunderbird < 115.11."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-31201",
    "descripcion": "This issue was addressed by removing the vulnerable code. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication. Apple is aware ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-31200",
    "descripcion": "A memory corruption issue was addressed with improved bounds checking. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. Processing an audio stream in a maliciously crafted media file may result in code execution. Apple ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-54068",
    "descripcion": "Livewire is a full-stack framework for Laravel. In Livewire v3 up to and including v3.6.3, a vulnerability allows unauthenticated attackers to achieve remote command execution in specific scenarios. The issue stems from how certain component property updates are hydrated. This ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-66224",
    "descripcion": "OrangeHRM is a comprehensive human resource management (HRM) system. From version 5.0 to 5.7, the application contains an input-neutralization flaw in its mail configuration and delivery workflow that allows user-controlled values to flow directly into the system’s sendmail ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-14282",
    "descripcion": "Currently trending CVE - Hype Score: 17"
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-38352",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: posix-cpu-timers: fix race between handle_posix_cpu_timers() and posix_cpu_timer_del() If an exiting non-autoreaping task has already passed exit_notify() and calls handle_posix_cpu_timers() from IRQ, it can ..."
  },
  {
    "fecha": "2025-12-24",
    "cve": "CVE-2025-14733",
    "descripcion": "An Out-of-bounds Write vulnerability in WatchGuard Fireware OS may allow a remote unauthenticated attacker to execute arbitrary code. This vulnerability affects both the Mobile User VPN with IKEv2 and the Branch Office VPN using IKEv2 when configured with a dynamic gateway ..."
  }
]