[
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2023-20869",
    "descripcion": "VMware Workstation (17.x) and VMware Fusion (13.x) contain a stack-based buffer-overflow vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2023-34044",
    "descripcion": "VMware Workstation( 17.x prior to 17.5) and Fusion(13.x prior to 13.5) contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine. A malicious actor with local administrative privileges on a virtual ..."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2023-20870",
    "descripcion": "VMware Workstation and Fusion contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-58360",
    "descripcion": "GeoServer is an open source server that allows users to share and edit geospatial data. From version 2.26.0 to before 2.26.2 and before 2.25.6, an XML External Entity (XXE) vulnerability was identified. The application accepts XML input through a specific endpoint /geoserver/wms ..."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-50168",
    "descripcion": "Access of resource using incompatible type ('type confusion') in Windows Win32K - ICOMP allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-12686",
    "descripcion": "Currently trending CVE - Hype Score: 15"
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-57819",
    "descripcion": "FreePBX is an open-source web-based graphical user interface. FreePBX 15, 16, and 17 endpoints are vulnerable due to insufficiently sanitized user-supplied data allowing unauthenticated access to FreePBX Administrator leading to arbitrary database manipulation and remote code ..."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-21479",
    "descripcion": "Memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-54057",
    "descripcion": "Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS) vulnerability in Apache SkyWalking. This issue affects Apache SkyWalking: <= 10.2.0. Users are recommended to upgrade to version 10.3.0, which fixes the issue."
  },
  {
    "fecha": "2025-11-29",
    "cve": "CVE-2025-26633",
    "descripcion": "Improper neutralization in Microsoft Management Console allows an unauthorized attacker to bypass a security feature locally."
  }
]