[
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-50165",
    "descripcion": "Untrusted pointer dereference in Microsoft Graphics Component allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-6218",
    "descripcion": "RARLAB WinRAR Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of RARLAB WinRAR. User interaction is required to exploit this vulnerability in that the target must visit a ..."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-61757",
    "descripcion": "Vulnerability in the Identity Manager product of Oracle Fusion Middleware (component: REST WebServices). Supported versions that are affected are 12.2.1.4.0 and 14.1.2.1.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-58034",
    "descripcion": "An Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability [CWE-78] in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.5, FortiWeb 7.4.0 through 7.4.10, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 through ..."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-13223",
    "descripcion": "Type Confusion in V8 in Google Chrome prior to 142.0.7444.175 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-9501",
    "descripcion": "The W3 Total Cache WordPress plugin before 2.8.13 is vulnerable to command injection via the _parse_dynamic_mfunc function, allowing unauthenticated users to execute PHP commands by submitting a comment with a malicious payload to a post."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-64755",
    "descripcion": "Claude Code is an agentic coding tool. Prior to version 2.0.31, due to an error in sed command parsing, it was possible to bypass the Claude Code read-only validation and write to arbitrary files on the host system. This issue has been patched in version 2.0.31."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2023-48022",
    "descripcion": "Anyscale Ray 2.6.3 and 2.8.0 allows a remote attacker to execute arbitrary code via the job submission API. NOTE: the vendor's position is that this report is irrelevant because Ray, as stated in its documentation, is not intended for use outside of a strictly controlled network ..."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-11001",
    "descripcion": "7-Zip ZIP File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of 7-Zip. Interaction with this product is required to exploit this vulnerability but attack vectors may ..."
  }
]