[
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-66478",
    "descripcion": "Rejected reason: This CVE is a duplicate of CVE-2025-55182."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-48593",
    "descripcion": "In bta_hf_client_cb_init of bta_hf_client_main.cc, there is a possible remote code execution due to a use after free. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-13486",
    "descripcion": "The Advanced Custom Fields: Extended plugin for WordPress is vulnerable to Remote Code Execution in versions 0.9.0.5 through 0.9.1.1 via the prepare_form() function. This is due to the function accepting user input and then passing that through call_user_func_array(). This makes ..."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-9491",
    "descripcion": "Microsoft Windows LNK File UI Misrepresentation Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Microsoft Windows. User interaction is required to exploit this vulnerability in that the target ..."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-38001",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: net_sched: hfsc: Address reentrant enqueue adding class to eltree twice Savino says: \"We are writing to report that this recent patch (141d34391abbb315d68556b7c67ad97885407547) [1] can be bypassed, ..."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-48572",
    "descripcion": "Currently trending CVE - Hype Score: 10"
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-48633",
    "descripcion": "Currently trending CVE - Hype Score: 10"
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-61729",
    "descripcion": "Within HostnameError.Error(), when constructing an error string, there is no limit to the number of hosts that will be printed out. Furthermore, the error string is constructed by repeated string concatenation, leading to quadratic runtime. Therefore, a certificate provided by a ..."
  },
  {
    "fecha": "2025-12-04",
    "cve": "CVE-2025-61727",
    "descripcion": "An excluded subdomain constraint in a certificate chain does not restrict the usage of wildcard SANs in the leaf certificate. For example a constraint that excludes the subdomain test.example.com does not prevent a leaf certificate from claiming the SAN *.example.com."
  }
]