[
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2025-15556",
    "descripcion": "Notepad++ versions prior to 8.8.9, when using the WinGUp updater, contain an update integrity verification vulnerability where downloaded update metadata and installers are not cryptographically verified. An attacker able to intercept or redirect update traffic can cause the ..."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2024-43468",
    "descripcion": "Microsoft Configuration Manager Remote Code Execution Vulnerability"
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2026-20700",
    "descripcion": "A memory corruption issue was addressed with improved state management. This issue is fixed in watchOS 26.3, tvOS 26.3, macOS Tahoe 26.3, visionOS 26.3, iOS 26.3 and iPadOS 26.3. An attacker with memory write capability may be able to execute arbitrary code. Apple is aware of a ..."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2024-27564",
    "descripcion": "pictureproxy.php in the dirk1983 mm1.ltd source code f9f4bbc allows SSRF via the url parameter. NOTE: the references section has an archived copy of pictureproxy.php from its original GitHub location, but the repository name might later change because it is misleading."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2024-7928",
    "descripcion": "A vulnerability, which was classified as problematic, has been found in FastAdmin up to 1.3.3.20220121. Affected by this issue is some unknown functionality of the file /index/ajax/lang. The manipulation of the argument lang leads to path traversal. The attack may be launched ..."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2024-22120",
    "descripcion": "Zabbix server can perform command execution for configured scripts. After command is executed, audit entry is added to \"Audit Log\". Due to \"clientip\" field is not sanitized, it is possible to injection SQL into \"clientip\" and exploit time based blind SQL injection."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2025-70795",
    "descripcion": "Currently trending CVE - Hype Score: 5"
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2025-46298",
    "descripcion": "The issue was addressed with improved memory handling. This issue is fixed in tvOS 26.2, Safari 26.2, watchOS 26.2, visionOS 26.2, iOS 26.2 and iPadOS 26.2, macOS Tahoe 26.2. Processing maliciously crafted web content may lead to an unexpected process crash."
  },
  {
    "fecha": "2026-02-14",
    "cve": "CVE-2024-27834",
    "descripcion": "The issue was addressed with improved checks. This issue is fixed in iOS 17.5 and iPadOS 17.5, tvOS 17.5, Safari 17.5, watchOS 10.5, macOS Sonoma 14.5. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication."
  }
]