[
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-43300",
    "descripcion": "An out-of-bounds write issue was addressed with improved bounds checking. This issue is fixed in iOS 15.8.5 and iPadOS 15.8.5, iOS 16.7.12 and iPadOS 16.7.12. Processing a malicious image file may result in memory corruption. Apple is aware of a report that this issue may have ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-60021",
    "descripcion": "Remote command injection vulnerability in heap profiler builtin service in Apache bRPC ((all versions < 1.15.0)) on all platforms allows attacker to inject remote command. Root Cause: The bRPC heap profiler built-in service (/pprof/heap) does not validate the user-provided ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-14174",
    "descripcion": "Out of bounds memory access in ANGLE in Google Chrome on Mac prior to 143.0.7499.110 allowed a remote attacker to perform out of bounds memory access via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-43529",
    "descripcion": "A use-after-free issue was addressed with improved memory management. This issue is fixed in watchOS 26.2, Safari 26.2, iOS 18.7.3 and iPadOS 18.7.3, iOS 26.2 and iPadOS 26.2, macOS Tahoe 26.2, visionOS 26.2, tvOS 26.2. Processing maliciously crafted web content may lead to ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-31201",
    "descripcion": "This issue was addressed by removing the vulnerable code. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication. Apple is aware ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-31200",
    "descripcion": "A memory corruption issue was addressed with improved bounds checking. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. Processing an audio stream in a maliciously crafted media file may result in code execution. Apple ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-69263",
    "descripcion": "pnpm is a package manager. Versions 10.26.2 and below store HTTP tarball dependencies (and git-hosted tarballs) in the lockfile without integrity hashes. This allows the remote server to serve different content on each install, even when a lockfile is committed. An attacker who ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-64155",
    "descripcion": "An improper neutralization of special elements used in an os command ('os command injection') vulnerability in Fortinet FortiSIEM 7.4.0, FortiSIEM 7.3.0 through 7.3.4, FortiSIEM 7.1.0 through 7.1.8, FortiSIEM 7.0.0 through 7.0.4, FortiSIEM 6.7.0 through 6.7.10 may allow an ..."
  },
  {
    "fecha": "2026-01-21",
    "cve": "CVE-2025-36911",
    "descripcion": "In key-based pairing, there is a possible ID due to a logic error in the code. This could lead to remote (proximal/adjacent) information disclosure of user's conversations and location with no additional execution privileges needed. User interaction is not needed for ..."
  }
]