[
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-12080",
    "descripcion": "On Wear OS devices, when Google Messages is configured as the default SMS/MMS/RCS application, the handling of ACTION_SENDTO intents utilizing the sms:, smsto:, mms:, and mmsto: Uniform Resource Identifier (URI) schemes is incorrectly implemented. Due to this misconfiguration, ..."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-55752",
    "descripcion": "Relative Path Traversal vulnerability in Apache Tomcat. The fix for bug 60013 introduced a regression where the rewritten URL was normalized before it was decoded. This introduced the possibility that, for rewrite rules that rewrite query parameters to the ..."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2023-20869",
    "descripcion": "VMware Workstation (17.x) and VMware Fusion (13.x) contain a stack-based buffer-overflow vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2023-20870",
    "descripcion": "VMware Workstation and Fusion contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-57819",
    "descripcion": "FreePBX is an open-source web-based graphical user interface. FreePBX 15, 16, and 17 endpoints are vulnerable due to insufficiently sanitized user-supplied data allowing unauthenticated access to FreePBX Administrator leading to arbitrary database manipulation and remote code ..."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2022-1388",
    "descripcion": "On F5 BIG-IP 16.1.x versions prior to 16.1.2.2, 15.1.x versions prior to 15.1.5.1, 14.1.x versions prior to 14.1.4.6, 13.1.x versions prior to 13.1.5, and all 12.1.x and 11.6.x versions, undisclosed requests may bypass iControl REST authentication. Note: Software versions which ..."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2023-46747",
    "descripcion": "Undisclosed requests may bypass configuration utility authentication, allowing an attacker with network access to the BIG-IP system through the management port and/or self IP addresses to execute arbitrary system commands. Note: Software versions which have reached End of ..."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-8061",
    "descripcion": "A potential insufficient access control vulnerability was reported in the Lenovo Dispatcher 3.0 and Dispatcher 3.1 drivers used by some Lenovo consumer notebooks that could allow an authenticated local user to execute code with elevated privileges. The Lenovo Dispatcher 3.2 ..."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2023-34044",
    "descripcion": "VMware Workstation( 17.x prior to 17.5) and Fusion(13.x prior to 13.5) contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine. A malicious actor with local administrative privileges on a virtual ..."
  }
]