[
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-64459",
    "descripcion": "An issue was discovered in 5.1 before 5.1.14, 4.2 before 4.2.26, and 5.2 before 5.2.8. The methods `QuerySet.filter()`, `QuerySet.exclude()`, and `QuerySet.get()`, and the class `Q()`, are subject to SQL injection when using a suitably crafted dictionary, with dictionary ..."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-20333",
    "descripcion": "A vulnerability in the VPN web server of Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) Software could allow an authenticated, remote attacker to execute arbitrary code on an affected device. This vulnerability ..."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-20362",
    "descripcion": "Update: On November 5, 2025, Cisco became aware of a new attack variant against devices running Cisco Secure ASA Software or Cisco Secure FTD Software releases that are affected by CVE-2025-20333 and CVE-2025-20362. This attack can cause unpatched devices to unexpectedly reload, ..."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-48593",
    "descripcion": "Currently trending CVE - Hype Score: 17"
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-9491",
    "descripcion": "Microsoft Windows LNK File UI Misrepresentation Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Microsoft Windows. User interaction is required to exploit this vulnerability in that the target ..."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-11953",
    "descripcion": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server ..."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-48703",
    "descripcion": "CWP (aka Control Web Panel or CentOS Web Panel) before 0.9.8.1205 allows unauthenticated remote code execution via shell metacharacters in the t_total parameter in a filemanager changePerm request. A valid non-root username must be known."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-21479",
    "descripcion": "Memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-11371",
    "descripcion": "In the default installation and configuration of Gladinet CentreStack and TrioFox, there is an unauthenticated Local File Inclusion Flaw that allows unintended disclosure of system files. Exploitation of this vulnerability has been observed in the wild. This issue impacts ..."
  },
  {
    "fecha": "2025-11-07",
    "cve": "CVE-2025-62626",
    "descripcion": "Currently trending CVE - Hype Score: 1"
  }
]