[
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-65018",
    "descripcion": "Currently trending CVE - Hype Score: 37"
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-11001",
    "descripcion": "7-Zip ZIP File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of 7-Zip. Interaction with this product is required to exploit this vulnerability but attack vectors may ..."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-49752",
    "descripcion": "Azure Bastion Elevation of Privilege Vulnerability"
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-64446",
    "descripcion": "A relative path traversal vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 through 7.0.11 may allow an attacker to execute administrative commands on the system via ..."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-58034",
    "descripcion": "An Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability [CWE-78] vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.5, FortiWeb 7.4.0 through 7.4.10, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 ..."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-61757",
    "descripcion": "Vulnerability in the Identity Manager product of Oracle Fusion Middleware (component: REST WebServices). Supported versions that are affected are 12.2.1.4.0 and 14.1.2.1.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-4123",
    "descripcion": "A cross-site scripting (XSS) vulnerability exists in Grafana caused by combining a client path traversal and open redirect. This allows attackers to redirect users to a website that hosts a frontend plugin that will execute arbitrary JavaScript. This vulnerability does not ..."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-41115",
    "descripcion": "SCIM provisioning was introduced in Grafana Enterprise and Grafana Cloud in April to improve how organizations manage users and teams in Grafana by introducing automated user lifecycle management. In Grafana versions 12.x where SCIM provisioning is enabled and configured, a ..."
  },
  {
    "fecha": "2025-11-25",
    "cve": "CVE-2025-27093",
    "descripcion": "Sliver is a command and control framework that uses a custom Wireguard netstack. In versions 1.5.43 and earlier, and in development version 1.6.0-dev, the netstack does not limit traffic between Wireguard clients. This allows clients to communicate with each other ..."
  }
]