[
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-54100",
    "descripcion": "Improper neutralization of special elements used in a command ('command injection') in Windows PowerShell allows an unauthorized attacker to execute code locally."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-59718",
    "descripcion": "A improper verification of cryptographic signature vulnerability in Fortinet FortiOS 7.6.0 through 7.6.3, FortiOS 7.4.0 through 7.4.8, FortiOS 7.2.0 through 7.2.11, FortiOS 7.0.0 through 7.0.17, FortiProxy 7.6.0 through 7.6.3, FortiProxy 7.4.0 through 7.4.10, FortiProxy 7.2.0 ..."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-59719",
    "descripcion": "An improper verification of cryptographic signature vulnerability in Fortinet FortiWeb 8.0.0, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9 may allow an unauthenticated attacker to bypass the FortiCloud SSO login authentication via a crafted SAML response message."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-65964",
    "descripcion": "n8n is an open source workflow automation platform. Versions 0.123.1 through 1.119.1 do not have adequate protections to prevent RCE through the project's pre-commit hooks. The Add Config operation allows workflows to set arbitrary Git configuration values, including ..."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-8110",
    "descripcion": "Improper Symbolic link handling in the PutContents API in Gogs allows Local Execution of Code."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-30406",
    "descripcion": "Gladinet CentreStack through 16.1.10296.56315 (fixed in 16.4.10315.56368) has a deserialization vulnerability due to the CentreStack portal's hardcoded machineKey use, as exploited in the wild in March 2025. This enables threat actors (who know the machineKey) to serialize a ..."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-62468",
    "descripcion": "Out-of-bounds read in Windows Defender Firewall Service allows an authorized attacker to disclose information locally."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-66478",
    "descripcion": "Rejected reason: This CVE is a duplicate of CVE-2025-55182."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-66456",
    "descripcion": "Elysia is a Typescript framework for request validation, type inference, OpenAPI documentation and client-server communication. Versions 1.4.0 through 1.4.16 contain a prototype pollution vulnerability in `mergeDeep` after merging results of two standard schema validations with ..."
  }
]