[
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-58726",
    "descripcion": "Improper access control in Windows SMB Server allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-41244",
    "descripcion": "VMware Aria Operations and VMware Tools contain a local privilege escalation vulnerability. A malicious local actor with non-administrative privileges having access to a VM with VMware Tools installed and managed by Aria Operations with SDMP enabled may exploit this ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-55315",
    "descripcion": "Inconsistent interpretation of http requests ('http request/response smuggling') in ASP.NET Core allows an authorized attacker to bypass a security feature over a network."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-49844",
    "descripcion": "Redis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-62725",
    "descripcion": "Docker Compose trusts the path information embedded in remote OCI compose artifacts. When a layer includes the annotations com.docker.compose.extends or com.docker.compose.envfile, Compose joins the attacker‑supplied value from com.docker.compose.file/com.docker.compose.envfile ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-61481",
    "descripcion": "An issue in MikroTik RouterOS v.7.14.2 and SwitchOS v.2.18 allows a remote attacker to execute arbitrary code via the HTTP- only WebFig management component"
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-6205",
    "descripcion": "A missing authorization vulnerability affecting DELMIA Apriso from Release 2020 through Release 2025 could allow an attacker to gain privileged access to the application."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-10680",
    "descripcion": "OpenVPN 2.7_alpha1 through 2.7_beta1 on POSIX based platforms allows a remote authenticated server to inject shell commands via DNS variables when --dns-updown is in use"
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-6204",
    "descripcion": "An Improper Control of Generation of Code (Code Injection) vulnerability affecting DELMIA Apriso from Release 2020 through Release 2025 could allow an attacker to execute arbitrary code."
  }
]