[
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-65018",
    "descripcion": "LIBPNG is a reference library for use in applications that read, create, and manipulate PNG (Portable Network Graphics) raster image files. From version 1.6.0 to before 1.6.51, there is a heap buffer overflow vulnerability in the libpng simplified API function ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-6554",
    "descripcion": "Type confusion in V8 in Google Chrome prior to 138.0.7204.96 allowed a remote attacker to perform arbitrary read/write via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-13016",
    "descripcion": "Incorrect boundary conditions in the JavaScript: WebAssembly component. This vulnerability affects Firefox < 145, Firefox ESR < 140.5, Thunderbird < 145, and Thunderbird < 140.5."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-54236",
    "descripcion": "Adobe Commerce versions 2.4.9-alpha2, 2.4.8-p2, 2.4.7-p7, 2.4.6-p12, 2.4.5-p14, 2.4.4-p15 and earlier are affected by an Improper Input Validation vulnerability. A successful attacker can abuse this to achieve session takeover, increasing the confidentiality, and integrity ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-59501",
    "descripcion": "Authentication bypass by spoofing in Microsoft Configuration Manager allows an authorized attacker to perform spoofing over an adjacent network."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-21479",
    "descripcion": "Memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-11001",
    "descripcion": "7-Zip ZIP File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of 7-Zip. Interaction with this product is required to exploit this vulnerability but attack vectors may ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-61757",
    "descripcion": "Vulnerability in the Identity Manager product of Oracle Fusion Middleware (component: REST WebServices). Supported versions that are affected are 12.2.1.4.0 and 14.1.2.1.0. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-49752",
    "descripcion": "Azure Bastion Elevation of Privilege Vulnerability"
  }
]