[
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-43529",
    "descripcion": "A use-after-free issue was addressed with improved memory management. This issue is fixed in watchOS 26.2, Safari 26.2, iOS 18.7.3 and iPadOS 18.7.3, iOS 26.2 and iPadOS 26.2, macOS Tahoe 26.2, visionOS 26.2, tvOS 26.2. Processing maliciously crafted web content may lead to ..."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-68613",
    "descripcion": "n8n is an open source workflow automation platform. Versions starting with 0.211.0 and prior to 1.120.4, 1.121.1, and 1.122.0 contain a critical Remote Code Execution (RCE) vulnerability in their workflow expression evaluation system. Under certain conditions, expressions ..."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2024-54529",
    "descripcion": "A logic issue was addressed with improved checks. This issue is fixed in macOS Sequoia 15.2, macOS Ventura 13.7.2, macOS Sonoma 14.7.2. An app may be able to execute arbitrary code with kernel privileges."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-64328",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. In versions 17.0.2.36 and above before 17.0.3, the filestore module within the Administrative interface is vulnerable to a post-authentication command injection by an authenticated known ..."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-61984",
    "descripcion": "ssh in OpenSSH before 10.1 allows control characters in usernames that originate from certain possibly untrusted sources, potentially leading to code execution when a ProxyCommand is used. The untrusted sources are the command line and %-sequence expansion of a configuration ..."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-40551",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an untrusted data deserialization vulnerability that could lead to remote code execution, which would allow an attacker to run commands on the host machine. This could be exploited without authentication."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-40536",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to a security control bypass vulnerability that if exploited, could allow an unauthenticated attacker to gain access to certain restricted functionality."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-0921",
    "descripcion": "Execution with Unnecessary Privileges vulnerability in multiple services of Mitsubishi Electric Iconics Digital Solutions GENESIS64 all versions, Mitsubishi Electric Iconics Digital Solutions GENESIS version 11.00, Mitsubishi Electric GENESIS64 all versions, Mitsubishi Electric ..."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2024-28397",
    "descripcion": "An issue in the component js2py.disable_pyimport() of js2py up to v0.74 allows attackers to execute arbitrary code via a crafted API call."
  },
  {
    "fecha": "2026-02-02",
    "cve": "CVE-2025-13881",
    "descripcion": "A flaw was found in Keycloak Admin API. This vulnerability allows an administrator with limited privileges to retrieve sensitive custom attributes via the /unmanagedAttributes endpoint, bypassing User Profile visibility settings."
  }
]