[
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2025-40538",
    "descripcion": "A broken access control vulnerability exists in Serv-U which when exploited, gives a malicious actor the ability to create a system admin user and execute arbitrary code as a privileged account via domain admin or group admin privileges. This issue requires administrative ..."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2023-20869",
    "descripcion": "VMware Workstation (17.x) and VMware Fusion (13.x) contain a stack-based buffer-overflow vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2023-20870",
    "descripcion": "VMware Workstation and Fusion contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2023-34044",
    "descripcion": "VMware Workstation( 17.x prior to 17.5) and Fusion(13.x prior to 13.5) contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine. A malicious actor with local administrative privileges on a virtual ..."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2025-5959",
    "descripcion": "Type Confusion in V8 in Google Chrome prior to 137.0.7151.103 allowed a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2025-12543",
    "descripcion": "A flaw was found in the Undertow HTTP server core, which is used in WildFly, JBoss EAP, and other Java applications. The Undertow library fails to properly validate the Host header in incoming HTTP requests.As a result, requests containing malformed or malicious Host headers are ..."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2023-46604",
    "descripcion": "The Java OpenWire protocol marshaller is vulnerable to Remote Code Execution. This vulnerability may allow a remote attacker with network access to either a Java-based OpenWire broker or client to run arbitrary shell commands by manipulating serialized class types in the ..."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2025-13942",
    "descripcion": "A command injection vulnerability in the UPnP function of the Zyxel EX3510-B0 firmware versions through 5.17(ABUP.15.1)C0 could allow a remote attacker to execute operating system (OS) commands on an affected device by sending specially crafted UPnP SOAP requests."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2025-13943",
    "descripcion": "A post-authentication command injection vulnerability in the log file download function of the Zyxel EX3301-T0 firmware versions through 5.50(ABVY.7)C0 could allow an authenticated attacker to execute operating system (OS) commands on an affected device."
  },
  {
    "fecha": "2026-02-25",
    "cve": "CVE-2025-38352",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: posix-cpu-timers: fix race between handle_posix_cpu_timers() and posix_cpu_timer_del() If an exiting non-autoreaping task has already passed exit_notify() and calls handle_posix_cpu_timers() from IRQ, it can ..."
  }
]