[
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-61884",
    "descripcion": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Runtime UI). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle ..."
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-11002",
    "descripcion": "Currently trending CVE - Hype Score: 39"
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-11001",
    "descripcion": "Currently trending CVE - Hype Score: 33"
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-38001",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: net_sched: hfsc: Address reentrant enqueue adding class to eltree twice Savino says: \"We are writing to report that this recent patch (141d34391abbb315d68556b7c67ad97885407547) [1] can be bypassed, ..."
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-53770",
    "descripcion": "Deserialization of untrusted data in on-premises Microsoft SharePoint Server allows an unauthorized attacker to execute code over a network. Microsoft is aware that an exploit for CVE-2025-53770 exists in the wild. Microsoft is preparing and fully testing a comprehensive update ..."
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-25257",
    "descripcion": "An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability [CWE-89] in Fortinet FortiWeb version 7.6.0 through 7.6.3, 7.4.0 through 7.4.7, 7.2.0 through 7.2.10 and below 7.0.10 allows an unauthenticated attacker to execute unauthorized ..."
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-5777",
    "descripcion": "Insufficient input validation leading to memory overread when the NetScaler is configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) OR AAA virtual server"
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-49704",
    "descripcion": "Improper control of generation of code ('code injection') in Microsoft Office SharePoint allows an authorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-57822",
    "descripcion": "Next.js is a React framework for building full-stack web applications. Prior to versions 14.2.32 and 15.4.7, when next() was used without explicitly passing the request object, it could lead to SSRF in self-hosted applications that incorrectly forwarded user-supplied headers. ..."
  },
  {
    "fecha": "2025-10-13",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  }
]