[
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-26399",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an unauthenticated AjaxProxy deserialization remote code execution vulnerability that, if exploited, would allow an attacker to run commands on the host machine. This vulnerability is a patch bypass of CVE-2024-28988, which ..."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-30208",
    "descripcion": "Vite, a provider of frontend development tooling, has a vulnerability in versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10. `@fs` denies access to files outside of Vite serving allow list. Adding `?raw??` or `?import&raw??` to the URL bypasses this limitation and ..."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-54068",
    "descripcion": "Livewire is a full-stack framework for Laravel. In Livewire v3 up to and including v3.6.3, a vulnerability allows unauthenticated attackers to achieve remote command execution in specific scenarios. The issue stems from how certain component property updates are hydrated. This ..."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-34165",
    "descripcion": "A stack-based buffer overflow vulnerability in NetSupport Manager 14.x versions prior to 14.12.0000 allows a remote, unauthenticated attacker to cause a denial of service (DoS) or potentially leak a limited amount of memory."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-34164",
    "descripcion": "A heap-based buffer overflow vulnerability in NetSupport Manager 14.x versions prior to 14.12.0000 allows a remote, unauthenticated attacker to cause a denial of service (DoS) or potentially result in arbitrary code execution."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-3052",
    "descripcion": "An arbitrary write vulnerability in Microsoft signed UEFI firmware allows for code execution of untrusted software. This allows an attacker to control its value, leading to arbitrary memory writes, including modification of critical firmware settings stored in NVRAM. Exploiting ..."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-43300",
    "descripcion": "An out-of-bounds write issue was addressed with improved bounds checking. This issue is fixed in iOS 15.8.5 and iPadOS 15.8.5, iOS 16.7.12 and iPadOS 16.7.12. Processing a malicious image file may result in memory corruption. Apple is aware of a report that this issue may have ..."
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-59473",
    "descripcion": "SQL Injection vulnerability in the Structure for Admin authenticated user"
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-66959",
    "descripcion": "An issue in ollama v.0.12.10 allows a remote attacker to cause a denial of service via the GGUF decoder"
  },
  {
    "fecha": "2026-02-09",
    "cve": "CVE-2025-15566",
    "descripcion": "A security issue was discovered in ingress-nginx where the `nginx.ingress.kubernetes.io/auth-proxy-set-headers` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and ..."
  }
]