[
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-65717",
    "descripcion": "An issue in Visual Studio Code Extensions Live Server v5.7.9 allows attackers to exfiltrate files via user interaction with a crafted HTML page."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-54068",
    "descripcion": "Livewire is a full-stack framework for Laravel. In Livewire v3 up to and including v3.6.3, a vulnerability allows unauthenticated attackers to achieve remote command execution in specific scenarios. The issue stems from how certain component property updates are hydrated. This ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-64446",
    "descripcion": "A relative path traversal vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 through 7.0.11 may allow an attacker to execute administrative commands on the system via ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-58034",
    "descripcion": "An Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability [CWE-78] vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.5, FortiWeb 7.4.0 through 7.4.10, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 ..."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2020-7796",
    "descripcion": "Zimbra Collaboration Suite (ZCS) before 8.8.15 Patch 7 allows SSRF when WebEx zimlet is installed and zimlet JSP is enabled."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-29969",
    "descripcion": "Time-of-check time-of-use (toctou) race condition in Windows Fundamentals allows an authorized attacker to execute code over a network."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-13176",
    "descripcion": "Planting a custom configuration file in ESET Inspect Connector allow load a malicious DLL."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2024-7694",
    "descripcion": "ThreatSonar Anti-Ransomware from TeamT5 does not properly validate the content of uploaded files. Remote attackers with administrator privileges on the product platform can upload malicious files, which can be used to execute arbitrary system command on the server."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-32355",
    "descripcion": "Rocket TRUfusion Enterprise through 7.10.4.0 uses a reverse proxy to handle incoming connections. However, the proxy is misconfigured in a way that allows specifying absolute URLs in the HTTP request line, causing the proxy to load the given resource."
  },
  {
    "fecha": "2026-02-20",
    "cve": "CVE-2025-59793",
    "descripcion": "Rocket TRUfusion Enterprise through 7.10.5 exposes the endpoint at /axis2/services/WsPortalV6UpDwAxis2Impl to authenticated users to be able to upload files. However, the application doesn't properly sanitize the jobDirectory parameter, which allows path traversal sequences to ..."
  }
]