[
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-9961",
    "descripcion": "An authenticated attacker may remotely execute arbitrary code via the CWMP binary on the devices AX10 and AX1500. The exploit can only be conducted via a Man-In-The-Middle (MITM) attack. This issue affects AX10 V1/V1.2/V2/V2.6/V3/V3.6: before 1.2.1; AX1500 ..."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-21042",
    "descripcion": "Out-of-bounds write in libimagecodec.quram.so prior to SMR Apr-2025 Release 1 allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-49844",
    "descripcion": "Redis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem ..."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-6554",
    "descripcion": "Type confusion in V8 in Google Chrome prior to 138.0.7204.96 allowed a remote attacker to perform arbitrary read/write via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-41244",
    "descripcion": "VMware Aria Operations and VMware Tools contain a local privilege escalation vulnerability. A malicious local actor with non-administrative privileges having access to a VM with VMware Tools installed and managed by Aria Operations with SDMP enabled may exploit this ..."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-21043",
    "descripcion": "Out-of-bounds write in libimagecodec.quram.so prior to SMR Sep-2025 Release 1 allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-8671",
    "descripcion": "A mismatch caused by client-triggered server-sent stream resets between HTTP/2 specifications and the internal architectures of some HTTP/2 implementations may result in excessive server resource consumption leading to denial-of-service (DoS). By opening streams and then ..."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-48593",
    "descripcion": "Currently trending CVE - Hype Score: 1"
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-38477",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: net/sched: sch_qfq: Fix race condition on qfq_aggregate A race condition can occur when 'agg' is modified in qfq_change_agg (called during qfq_enqueue) while other threads access it concurrently. For example, ..."
  }
]