[
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-60703",
    "descripcion": "Untrusted pointer dereference in Windows Remote Desktop allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-62215",
    "descripcion": "Concurrent execution using shared resource with improper synchronization ('race condition') in Windows Kernel allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-60710",
    "descripcion": "Improper link resolution before file access ('link following') in Host Process for Windows Tasks allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-12480",
    "descripcion": "Triofox versions prior to 16.7.10368.56560, are vulnerable to an Improper Access Control flaw that allows access to initial setup pages even after setup is complete."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-64459",
    "descripcion": "An issue was discovered in 5.1 before 5.1.14, 4.2 before 4.2.26, and 5.2 before 5.2.8. The methods `QuerySet.filter()`, `QuerySet.exclude()`, and `QuerySet.get()`, and the class `Q()`, are subject to SQL injection when using a suitably crafted dictionary, with dictionary ..."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-9242",
    "descripcion": "An Out-of-bounds Write vulnerability in WatchGuard Fireware OS may allow a remote unauthenticated attacker to execute arbitrary code. This vulnerability affects both the Mobile User VPN with IKEv2 and the Branch Office VPN using IKEv2 when configured with a dynamic gateway ..."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-10230",
    "descripcion": "A flaw was found in Samba, in the front-end WINS hook handling: NetBIOS names from registration packets are passed to a shell without proper validation or escaping. Unsanitized NetBIOS name data from WINS registration packets are inserted into a shell command and executed by the ..."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-6218",
    "descripcion": "RARLAB WinRAR Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of RARLAB WinRAR. User interaction is required to exploit this vulnerability in that the target must visit a ..."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-21042",
    "descripcion": "Out-of-bounds write in libimagecodec.quram.so prior to SMR Apr-2025 Release 1 allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-13",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  }
]