[
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-22131",
    "descripcion": "PhpSpreadsheet is a PHP library for reading and writing spreadsheet files. Cross-Site Scripting (XSS) vulnerability in the code which translates the XLSX file into a HTML representation and displays it in the response."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-8061",
    "descripcion": "A potential insufficient access control vulnerability was reported in the Lenovo Dispatcher 3.0 and Dispatcher 3.1 drivers used by some Lenovo consumer notebooks that could allow an authenticated local user to execute code with elevated privileges. The Lenovo Dispatcher 3.2 ..."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2023-20869",
    "descripcion": "VMware Workstation (17.x) and VMware Fusion (13.x) contain a stack-based buffer-overflow vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2023-34044",
    "descripcion": "VMware Workstation( 17.x prior to 17.5) and Fusion(13.x prior to 13.5) contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine. A malicious actor with local administrative privileges on a virtual ..."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2023-20870",
    "descripcion": "VMware Workstation and Fusion contain an out-of-bounds read vulnerability that exists in the functionality for sharing host Bluetooth devices with the virtual machine."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-54236",
    "descripcion": "Adobe Commerce versions 2.4.9-alpha2, 2.4.8-p2, 2.4.7-p7, 2.4.6-p12, 2.4.5-p14, 2.4.4-p15 and earlier are affected by an Improper Input Validation vulnerability. A successful attacker can abuse this to achieve session takeover, increasing the confidentiality, and integrity ..."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-24990",
    "descripcion": "Microsoft is aware of vulnerabilities in the third party Agere Modem driver that ships natively with supported Windows operating systems. This is an announcement of the upcoming removal of ltmdm64.sys driver. The driver has been removed in the October cumulative update. Fax ..."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-59230",
    "descripcion": "Improper access control in Windows Remote Access Connection Manager allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-26",
    "cve": "CVE-2025-37947",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: ksmbd: prevent out-of-bounds stream writes by validating *pos ksmbd_vfs_stream_write() did not validate whether the write offset (*pos) was within the bounds of the existing stream data length (v_len). If *pos ..."
  }
]