[
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-20393",
    "descripcion": "Cisco is aware of a potential vulnerability. Cisco is currently investigating and will update these details as appropriate as more information becomes available."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-40602",
    "descripcion": "A local privilege escalation vulnerability due to insufficient authorization in the SonicWall SMA1000 appliance management console (AMC)."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-37164",
    "descripcion": "A remote code execution issue exists in HPE OneView."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-59718",
    "descripcion": "A improper verification of cryptographic signature vulnerability in Fortinet FortiOS 7.6.0 through 7.6.3, FortiOS 7.4.0 through 7.4.8, FortiOS 7.2.0 through 7.2.11, FortiOS 7.0.0 through 7.0.17, FortiProxy 7.6.0 through 7.6.3, FortiProxy 7.4.0 through 7.4.10, FortiProxy 7.2.0 ..."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-59719",
    "descripcion": "An improper verification of cryptographic signature vulnerability in Fortinet FortiWeb 8.0.0, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9 may allow an unauthenticated attacker to bypass the FortiCloud SSO login authentication via a crafted SAML response message."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-59374",
    "descripcion": "\"UNSUPPORTED WHEN ASSIGNED\" Certain versions of the ASUS Live Update client were distributed with unauthorized modifications introduced through a supply chain compromise. The modified builds could cause devices meeting specific targeting conditions to perform unintended actions. ..."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-23339",
    "descripcion": "NVIDIA CUDA Toolkit for all platforms contains a vulnerability in cuobjdump where an attacker may cause a stack-based buffer overflow by getting the user to run cuobjdump on a malicious ELF file. A successful exploit of this vulnerability may lead to arbitrary code execution at ..."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-64669",
    "descripcion": "Improper access control in Windows Admin Center allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-55681",
    "descripcion": "Out-of-bounds read in Windows DWM allows an authorized attacker to elevate privileges locally."
  }
]