[
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-66478",
    "descripcion": "Rejected reason: This CVE is a duplicate of CVE-2025-55182."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-66516",
    "descripcion": "Critical XXE in Apache Tika tika-core (1.13-3.2.1), tika-pdf-module (2.0.0-3.2.1) and tika-parsers (1.13-1.28.5) modules on all platforms allows an attacker to carry out XML External Entity injection via a crafted XFA file inside of a PDF. This CVE covers the same ..."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-12762",
    "descripcion": "pgAdmin versions up to 9.9 are affected by a Remote Code Execution (RCE) vulnerability that occurs when running in server mode and performing restores from PLAIN-format dump files. This issue allows attackers to inject and execute arbitrary commands on the server hosting ..."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-9242",
    "descripcion": "An Out-of-bounds Write vulnerability in WatchGuard Fireware OS may allow a remote unauthenticated attacker to execute arbitrary code. This vulnerability affects both the Mobile User VPN with IKEv2 and the Branch Office VPN using IKEv2 when configured with a dynamic gateway ..."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-4802",
    "descripcion": "Untrusted LD_LIBRARY_PATH environment variable vulnerability in the GNU C Library version 2.27 to 2.38 allows attacker controlled loading of dynamically shared library in statically compiled setuid binaries that call dlopen (including internal dlopen calls after setlocale or ..."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-13032",
    "descripcion": "Double fetch in sandbox kernel driver in Avast/AVG Antivirus <25.3 on windows allows local attacker to escalate privelages via pool overflow."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2023-40129",
    "descripcion": "In build_read_multi_rsp of gatt_sr.cc, there is a possible out of bounds write due to a heap buffer overflow. This could lead to remote (proximal/adjacent) code execution with no additional execution privileges needed. User interaction is not needed for exploitation."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-9491",
    "descripcion": "Microsoft Windows LNK File UI Misrepresentation Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Microsoft Windows. User interaction is required to exploit this vulnerability in that the target ..."
  },
  {
    "fecha": "2025-12-06",
    "cve": "CVE-2025-12443",
    "descripcion": "Out of bounds read in WebXR in Google Chrome prior to 142.0.7444.59 allowed a remote attacker to perform an out of bounds memory read via a crafted HTML page. (Chromium security severity: Medium)"
  }
]