[
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-21042",
    "descripcion": "Out-of-bounds write in libimagecodec.quram.so prior to SMR Apr-2025 Release 1 allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-48593",
    "descripcion": "Currently trending CVE - Hype Score: 17"
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-59304",
    "descripcion": "A directory traversal issue in Swetrix Web Analytics API 3.1.1 before 7d8b972 allows a remote attacker to achieve Remote Code Execution via a crafted HTTP request."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-6218",
    "descripcion": "RARLAB WinRAR Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of RARLAB WinRAR. User interaction is required to exploit this vulnerability in that the target must visit a ..."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-24170",
    "descripcion": "A logic issue was addressed with improved file handling. This issue is fixed in macOS Ventura 13.7.5, macOS Sonoma 14.7.5. An app may be able to gain root privileges."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-21043",
    "descripcion": "Out-of-bounds write in libimagecodec.quram.so prior to SMR Sep-2025 Release 1 allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-64459",
    "descripcion": "An issue was discovered in 5.1 before 5.1.14, 4.2 before 4.2.26, and 5.2 before 5.2.8. The methods `QuerySet.filter()`, `QuerySet.exclude()`, and `QuerySet.get()`, and the class `Q()`, are subject to SQL injection when using a suitably crafted dictionary, with dictionary ..."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-20362",
    "descripcion": "Update: On November 5, 2025, Cisco became aware of a new attack variant against devices running Cisco Secure ASA Software or Cisco Secure FTD Software releases that are affected by CVE-2025-20333 and CVE-2025-20362. This attack can cause unpatched devices to unexpectedly reload, ..."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2025-20333",
    "descripcion": "A vulnerability in the VPN web server of Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) Software could allow an authenticated, remote attacker to execute arbitrary code on an affected device. This vulnerability ..."
  },
  {
    "fecha": "2025-11-09",
    "cve": "CVE-2023-42824",
    "descripcion": "The issue was addressed with improved checks. This issue is fixed in iOS 16.7.1 and iPadOS 16.7.1. A local attacker may be able to elevate their privileges. Apple is aware of a report that this issue may have been actively exploited against versions of iOS before iOS 16.6."
  }
]