[
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-15566",
    "descripcion": "A security issue was discovered in ingress-nginx where the `nginx.ingress.kubernetes.io/auth-proxy-set-headers` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-3052",
    "descripcion": "An arbitrary write vulnerability in Microsoft signed UEFI firmware allows for code execution of untrusted software. This allows an attacker to control its value, leading to arbitrary memory writes, including modification of critical firmware settings stored in NVRAM. Exploiting ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-20393",
    "descripcion": "A vulnerability in the Spam Quarantine feature of Cisco AsyncOS Software for Cisco Secure Email Gateway and Cisco Secure Email and Web Manager could allow an unauthenticated, remote attacker to execute arbitrary system commands on an affected device with root privileges. This ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-11953",
    "descripcion": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-68947",
    "descripcion": "NSecsoft 'NSecKrnl' is a Windows driver that allows a local, authenticated attacker to terminate processes owned by other users, including SYSTEM and Protected Processes by issuing crafted IOCTL requests to the driver."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-30208",
    "descripcion": "Vite, a provider of frontend development tooling, has a vulnerability in versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10. `@fs` denies access to files outside of Vite serving allow list. Adding `?raw??` or `?import&raw??` to the URL bypasses this limitation and ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-15469",
    "descripcion": "Issue summary: The 'openssl dgst' command-line tool silently truncates input data to 16MB when using one-shot signing algorithms and reports success instead of an error. Impact summary: A user signing or verifying files larger than 16MB with one-shot algorithms (such as ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2026-24423",
    "descripcion": "SmarterTools SmarterMail versions prior to build 9511 contain an unauthenticated remote code execution vulnerability in the ConnectToHub API method. The attacker could point the SmarterMail to the malicious HTTP server, which serves the malicious OS command. This command will be ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-40551",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an untrusted data deserialization vulnerability that could lead to remote code execution, which would allow an attacker to run commands on the host machine. This could be exploited without authentication."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-6978",
    "descripcion": "Diagnostics command injection vulnerability"
  }
]