[
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-65018",
    "descripcion": "LIBPNG is a reference library for use in applications that read, create, and manipulate PNG (Portable Network Graphics) raster image files. From version 1.6.0 to before 1.6.51, there is a heap buffer overflow vulnerability in the libpng simplified API function ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-6554",
    "descripcion": "Type confusion in V8 in Google Chrome prior to 138.0.7204.96 allowed a remote attacker to perform arbitrary read/write via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-54236",
    "descripcion": "Adobe Commerce versions 2.4.9-alpha2, 2.4.8-p2, 2.4.7-p7, 2.4.6-p12, 2.4.5-p14, 2.4.4-p15 and earlier are affected by an Improper Input Validation vulnerability. A successful attacker can abuse this to achieve session takeover, increasing the confidentiality, and integrity ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-21479",
    "descripcion": "Memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-58360",
    "descripcion": "GeoServer is an open source server that allows users to share and edit geospatial data. From version 2.26.0 to before 2.26.2 and before 2.25.6, an XML External Entity (XXE) vulnerability was identified. The application accepts XML input through a specific endpoint /geoserver/wms ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-12970",
    "descripcion": "The extract_name function in Fluent Bit in_docker input plugin copies container names into a fixed size stack buffer without validating length. An attacker who can create containers or control container names, can supply a long name that overflows the buffer, leading to process ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-12972",
    "descripcion": "Fluent Bit out_file plugin does not properly sanitize tag values when deriving output file names. When the File option is omitted, the plugin uses untrusted tag input to construct file paths. This allows attackers with network access to craft tags containing path traversal ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-11001",
    "descripcion": "7-Zip ZIP File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of 7-Zip. Interaction with this product is required to exploit this vulnerability but attack vectors may ..."
  },
  {
    "fecha": "2025-11-26",
    "cve": "CVE-2025-13016",
    "descripcion": "Incorrect boundary conditions in the JavaScript: WebAssembly component. This vulnerability affects Firefox < 145, Firefox ESR < 140.5, Thunderbird < 145, and Thunderbird < 140.5."
  }
]