[
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-66032",
    "descripcion": "Claude Code is an agentic coding tool. Prior to 1.0.93, Due to errors in parsing shell commands related to $IFS and short CLI flags, it was possible to bypass the Claude Code read-only validation and trigger arbitrary code execution. Reliably exploiting this requires the ability ..."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-68668",
    "descripcion": "n8n is an open source workflow automation platform. From version 1.0.0 to before 2.0.0, a sandbox bypass vulnerability exists in the Python Code Node that uses Pyodide. An authenticated user with permission to create or modify workflows can exploit this vulnerability to execute ..."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-68493",
    "descripcion": "Missing XML Validation vulnerability in Apache Struts, Apache Struts. This issue affects Apache Struts: from 2.0.0 before 2.2.1; Apache Struts: from 2.2.1 through 6.1.0. Users are recommended to upgrade to version 6.1.1, which fixes the issue."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-46285",
    "descripcion": "An integer overflow was addressed by adopting 64-bit timestamps. This issue is fixed in watchOS 26.2, macOS Sonoma 14.8.3, iOS 18.7.3 and iPadOS 18.7.3, iOS 26.2 and iPadOS 26.2, macOS Tahoe 26.2, macOS Sequoia 15.7.3, visionOS 26.2, tvOS 26.2. An app may be able to gain root ..."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-38352",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: posix-cpu-timers: fix race between handle_posix_cpu_timers() and posix_cpu_timer_del() If an exiting non-autoreaping task has already passed exit_notify() and calls handle_posix_cpu_timers() from IRQ, it can ..."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-8110",
    "descripcion": "Improper Symbolic link handling in the PutContents API in Gogs allows Local Execution of Code."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-61686",
    "descripcion": "React Router is a router for React. In @react-router/node versions 7.0.0 through 7.9.3, @remix-run/deno prior to version 2.17.2, and @remix-run/node prior to version 2.17.2, if createFileSessionStorage() is being used from @react-router/node (or @remix-run/node/@remix-run/deno ..."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-4275",
    "descripcion": "A vulnerability in the digital signature verification process does not properly validate variable attributes which allows an attacker to bypass signature verification by creating a non-authenticated NVRAM variable. An attacker may to execute arbitrary signed UEFI code and bypass ..."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-69258",
    "descripcion": "A LoadLibraryEX vulnerability in Trend Micro Apex Central could allow an unauthenticated remote attacker to load an attacker-controlled DLL into a key executable, leading to execution of attacker-supplied code under the context of SYSTEM on affected installations."
  },
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2025-29927",
    "descripcion": "Next.js is a React framework for building full-stack web applications. Starting in version 1.11.4 and prior to versions 12.3.5, 13.5.9, 14.2.25, and 15.2.3, it is possible to bypass authorization checks within a Next.js application, if the authorization check occurs in ..."
  }
]