[
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-20352",
    "descripcion": "A vulnerability in the Simple Network Management Protocol (SNMP) subsystem of Cisco IOS Software and Cisco IOS XE Software could allow the following: An authenticated, remote attacker with low privileges could cause a denial of service (DoS) condition on an affected device ..."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2024-4701",
    "descripcion": "A path traversal issue potentially leading to remote code execution in Genie for all versions prior to 4.3.18"
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-9252",
    "descripcion": "A weakness has been identified in Linksys RE6250, RE6300, RE6350, RE6500, RE7000 and RE9000 1.0.013.001/1.0.04.001/1.0.04.002/1.1.05.003/1.2.07.001. Affected by this vulnerability is the function DisablePasswordAlertRedirect of the file /goform/DisablePasswordAlertRedirect. ..."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-10230",
    "descripcion": "Currently trending CVE - Hype Score: 33"
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-25257",
    "descripcion": "An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability [CWE-89] in Fortinet FortiWeb version 7.6.0 through 7.6.3, 7.4.0 through 7.4.7, 7.2.0 through 7.2.10 and below 7.0.10 allows an unauthenticated attacker to execute unauthorized ..."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2021-38003",
    "descripcion": "Inappropriate implementation in V8 in Google Chrome prior to 95.0.4638.69 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-24071",
    "descripcion": "Exposure of sensitive information to an unauthorized actor in Windows File Explorer allows an unauthorized attacker to perform spoofing over a network."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-24054",
    "descripcion": "External control of file name or path in Windows NTLM allows an unauthorized attacker to perform spoofing over a network."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-48983",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-48984",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  }
]