[
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-59230",
    "descripcion": "Improper access control in Windows Remote Access Connection Manager allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-49144",
    "descripcion": "Notepad++ is a free and open-source source code editor. In versions 8.8.1 and prior, a privilege escalation vulnerability exists in the Notepad++ v8.8.1 installer that allows unprivileged users to gain SYSTEM-level privileges through insecure executable search paths. An attacker ..."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-62168",
    "descripcion": "Squid is a caching proxy for the Web. In Squid versions prior to 7.2, a failure to redact HTTP authentication credentials in error handling allows information disclosure. The vulnerability allows a script to bypass browser security protections and learn the credentials a trusted ..."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-49844",
    "descripcion": "Redis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem ..."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-21420",
    "descripcion": "Windows Disk Cleanup Tool Elevation of Privilege Vulnerability"
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-29927",
    "descripcion": "Next.js is a React framework for building full-stack web applications. Starting in version 1.11.4 and prior to versions 12.3.5, 13.5.9, 14.2.25, and 15.2.3, it is possible to bypass authorization checks within a Next.js application, if the authorization check occurs in ..."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-8941",
    "descripcion": "A flaw was found in linux-pam. The pam_namespace module may improperly handle user-controlled paths, allowing local users to exploit symlink attacks and race conditions to elevate their privileges to root. This CVE provides a \"complete\" fix for CVE-2025-6020."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-11001",
    "descripcion": "Currently trending CVE - Hype Score: 16"
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-59282",
    "descripcion": "Concurrent execution using shared resource with improper synchronization ('race condition') in Inbox COM Objects allows an unauthorized attacker to execute code locally."
  }
]