[
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-66478",
    "descripcion": "Rejected reason: This CVE is a duplicate of CVE-2025-55182."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-12762",
    "descripcion": "pgAdmin versions up to 9.9 are affected by a Remote Code Execution (RCE) vulnerability that occurs when running in server mode and performing restores from PLAIN-format dump files. This issue allows attackers to inject and execute arbitrary commands on the server hosting ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-66516",
    "descripcion": "Critical XXE in Apache Tika tika-core (1.13-3.2.1), tika-pdf-module (2.0.0-3.2.1) and tika-parsers (1.13-1.28.5) modules on all platforms allows an attacker to carry out XML External Entity injection via a crafted XFA file inside of a PDF. This CVE covers the same ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-9242",
    "descripcion": "An Out-of-bounds Write vulnerability in WatchGuard Fireware OS may allow a remote unauthenticated attacker to execute arbitrary code. This vulnerability affects both the Mobile User VPN with IKEv2 and the Branch Office VPN using IKEv2 when configured with a dynamic gateway ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-21836",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: io_uring/kbuf: reallocate buf lists on upgrade IORING_REGISTER_PBUF_RING can reuse an old struct io_buffer_list if it was created for legacy selected buffer and has been emptied. It violates the requirement ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-33183",
    "descripcion": "NVIDIA Isaac-GR00T for all platforms contains a vulnerability in a Python component, where an attacker could cause a code injection issue. A successful exploit of this vulnerability might lead to code execution, escalation of privileges, information disclosure, and data ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-66624",
    "descripcion": "BACnet Protocol Stack library provides a BACnet application layer, network layer and media access (MAC) layer communications services. Prior to 1.5.0.rc2, The npdu_is_expected_reply function in src/bacnet/npdu.c indexes request_pdu[offset+2/3/5] and reply_pdu[offset+1/2/4] ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-20386",
    "descripcion": "In Splunk Enterprise for Windows versions below 10.0.2, 9.4.6, 9.3.8, and 9.2.10, a new installation of or an upgrade to an affected version can result in incorrect permissions assignment in the Splunk Enterprise for Windows Installation directory. This lets non-administrator ..."
  },
  {
    "fecha": "2025-12-07",
    "cve": "CVE-2025-20387",
    "descripcion": "In Splunk Universal Forwarder for Windows versions below 10.0.2, 9.4.6, 9.3.8, and 9.2.10, a new installation of or an upgrade to an affected version can result in incorrect permissions assignment in the Universal Forwarder for Windows Installation directory. This lets ..."
  }
]