[
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-67303",
    "descripcion": "An issue in ComfyUI-Manager prior to version 3.38 allowed remote attackers to potentially manipulate its configuration and critical data. This was due to the application storing its files in an insufficiently protected location that was accessible via the web interface"
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-68668",
    "descripcion": "n8n is an open source workflow automation platform. From version 1.0.0 to before 2.0.0, a sandbox bypass vulnerability exists in the Python Code Node that uses Pyodide. An authenticated user with permission to create or modify workflows can exploit this vulnerability to execute ..."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-14847",
    "descripcion": "Mismatched length fields in Zlib compressed protocol headers may allow a read of uninitialized heap memory by an unauthenticated client. This issue affects all MongoDB Server v7.0 prior to 7.0.28 versions, MongoDB Server v8.0 versions prior to 8.0.17, MongoDB Server v8.2 ..."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-6389",
    "descripcion": "The Sneeit Framework plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 8.3 via the sneeit_articles_pagination_callback() function. This is due to the function accepting user input and then passing that through call_user_func(). ..."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2024-44133",
    "descripcion": "This issue was addressed by removing the vulnerable code. This issue is fixed in macOS Sequoia 15. On MDM managed devices, an app may be able to bypass certain Privacy preferences."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-59470",
    "descripcion": "Currently trending CVE - Hype Score: 15"
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-66478",
    "descripcion": "Rejected reason: This CVE is a duplicate of CVE-2025-55182."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2024-21574",
    "descripcion": "The issue stems from a missing validation of the pip field in a POST request sent to the /customnode/install endpoint used to install custom nodes which is added to the server by the extension. This allows an attacker to craft a request that triggers a pip install on a user ..."
  },
  {
    "fecha": "2026-01-08",
    "cve": "CVE-2025-68926",
    "descripcion": "RustFS is a distributed object storage system built in Rust. In versions prior to 1.0.0-alpha.78, RustFS implements gRPC authentication using a hardcoded static token `\"rustfs rpc\"` that is publicly exposed in the source code repository, hardcoded on both client and server ..."
  }
]