[
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-52665",
    "descripcion": "A malicious actor with access to the management network could exploit a misconfiguration in UniFi’s door access application, UniFi Access, that exposed a management API without proper authentication. This vulnerability was introduced in Version 3.3.22 and was fixed in Version ..."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2023-20198",
    "descripcion": "Cisco is providing an update for the ongoing investigation into observed exploitation of the web UI feature in Cisco IOS XE Software. We are updating the list of fixed releases and adding the Software Checker. Our investigation has determined that the actors exploited two ..."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-64095",
    "descripcion": "DNN (formerly DotNetNuke) is an open-source web content management platform (CMS) in the Microsoft ecosystem. Prior to 10.1.1, the default HTML editor provider allows unauthenticated file uploads and images can overwrite existing files. An unauthenticated user can upload and ..."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-11202",
    "descripcion": "win-cli-mcp-server resolveCommandPath Command Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of win-cli-mcp-server. Authentication is not required to exploit this vulnerability. The ..."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-64132",
    "descripcion": "Jenkins MCP Server Plugin 0.84.v50ca_24ef83f2 and earlier does not perform permission checks in multiple MCP tools, allowing attackers to trigger builds and obtain information about job and cloud configuration they should not be able to access."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-40778",
    "descripcion": "Under certain circumstances, BIND is too lenient when accepting records from answers, allowing an attacker to inject forged data into the cache. This issue affects BIND 9 versions 9.11.0 through 9.16.50, 9.18.0 through 9.18.39, 9.20.0 through 9.20.13, 9.21.0 through 9.21.12, ..."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-38352",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: posix-cpu-timers: fix race between handle_posix_cpu_timers() and posix_cpu_timer_del() If an exiting non-autoreaping task has already passed exit_notify() and calls handle_posix_cpu_timers() from IRQ, it can ..."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2025-50168",
    "descripcion": "Access of resource using incompatible type ('type confusion') in Windows Win32K - ICOMP allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-11-03",
    "cve": "CVE-2024-1086",
    "descripcion": "A use-after-free vulnerability in the Linux kernel's netfilter: nf_tables component can be exploited to achieve local privilege escalation. The nft_verdict_init() function allows positive values as drop error within the hook verdict, and hence the nf_hook_slow() function can ..."
  }
]