[
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-25257",
    "descripcion": "An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability [CWE-89] in Fortinet FortiWeb version 7.6.0 through 7.6.3, 7.4.0 through 7.4.7, 7.2.0 through 7.2.10 and below 7.0.10 allows an unauthenticated attacker to execute unauthorized ..."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-59230",
    "descripcion": "Improper access control in Windows Remote Access Connection Manager allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-49144",
    "descripcion": "Notepad++ is a free and open-source source code editor. In versions 8.8.1 and prior, a privilege escalation vulnerability exists in the Notepad++ v8.8.1 installer that allows unprivileged users to gain SYSTEM-level privileges through insecure executable search paths. An attacker ..."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2024-4701",
    "descripcion": "A path traversal issue potentially leading to remote code execution in Genie for all versions prior to 4.3.18"
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2021-38003",
    "descripcion": "Inappropriate implementation in V8 in Google Chrome prior to 95.0.4638.69 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-59282",
    "descripcion": "Concurrent execution using shared resource with improper synchronization ('race condition') in Inbox COM Objects allows an unauthorized attacker to execute code locally."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-33073",
    "descripcion": "Improper access control in Windows SMB allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-21420",
    "descripcion": "Windows Disk Cleanup Tool Elevation of Privilege Vulnerability"
  },
  {
    "fecha": "2025-10-19",
    "cve": "CVE-2025-9242",
    "descripcion": "An Out-of-bounds Write vulnerability in WatchGuard Fireware OS may allow a remote unauthenticated attacker to execute arbitrary code. This vulnerability affects both the Mobile User VPN with IKEv2 and the Branch Office VPN using IKEv2 when configured with a dynamic gateway ..."
  }
]