[
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-48561",
    "descripcion": "In multiple locations, there is a possible way to access data displayed on the screen due to side channel information disclosure. This could lead to local information disclosure with no additional execution privileges needed. User interaction is not needed for exploitation."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-32463",
    "descripcion": "Sudo before 1.9.17p1 allows local users to obtain root access because /etc/nsswitch.conf from a user-controlled directory is used with the --chroot option."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-38001",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: net_sched: hfsc: Address reentrant enqueue adding class to eltree twice Savino says: \"We are writing to report that this recent patch (141d34391abbb315d68556b7c67ad97885407547) [1] can be bypassed, ..."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2021-27878",
    "descripcion": "An issue was discovered in Veritas Backup Exec before 21.2. The communication between a client and an Agent requires successful authentication, which is typically completed over a secure TLS communication. However, due to a vulnerability in the SHA Authentication scheme, an ..."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2021-27877",
    "descripcion": "An issue was discovered in Veritas Backup Exec before 21.2. It supports multiple authentication schemes: SHA authentication is one of these. This authentication scheme is no longer used in current versions of the product, but hadn't yet been disabled. An attacker could remotely ..."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2021-26857",
    "descripcion": "Microsoft Exchange Server Remote Code Execution Vulnerability"
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-61884",
    "descripcion": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Runtime UI). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle ..."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-11001",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-11002",
    "descripcion": "Currently trending CVE - Hype Score: 5"
  }
]