[
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2024-21413",
    "descripcion": "Microsoft Outlook Remote Code Execution Vulnerability"
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2024-50629",
    "descripcion": "Improper encoding or escaping of output vulnerability in the webapi component in Synology BeeStation OS (BSM) before 1.1-65374 and Synology DiskStation Manager (DSM) before 7.1.1-42962-7, 7.2-64570-4, 7.2.1-69057-6 and 7.2.2-72806-1 allow remote attackers to read limited files ..."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-48633",
    "descripcion": "Currently trending CVE - Hype Score: 26"
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-48572",
    "descripcion": "Currently trending CVE - Hype Score: 26"
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-11001",
    "descripcion": "7-Zip ZIP File Parsing Directory Traversal Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of 7-Zip. Interaction with this product is required to exploit this vulnerability but attack vectors may ..."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-48593",
    "descripcion": "In bta_hf_client_cb_init of bta_hf_client_main.cc, there is a possible remote code execution due to a use after free. This could lead to remote code execution with no additional execution privileges needed. User interaction is not needed for exploitation."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-61727",
    "descripcion": "Currently trending CVE - Hype Score: 21"
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-61729",
    "descripcion": "Within HostnameError.Error(), when constructing an error string, there is no limit to the number of hosts that will be printed out. Furthermore, the error string is constructed by repeated string concatenation, leading to quadratic runtime. Therefore, a certificate provided by a ..."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-60709",
    "descripcion": "Out-of-bounds read in Windows Common Log File System Driver allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2021-27877",
    "descripcion": "An issue was discovered in Veritas Backup Exec before 21.2. It supports multiple authentication schemes: SHA authentication is one of these. This authentication scheme is no longer used in current versions of the product, but hadn't yet been disabled. An attacker could remotely ..."
  }
]