[
  {
    "fecha": "2026-01-13",
    "cve": "CVE-2026-20805",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Desktop Windows Manager contains an information disclosure vulnerability that allows an authorized attacker to disclose information locally."
  },
  {
    "fecha": "2026-01-12",
    "cve": "CVE-2025-8110",
    "vendor": "Gogs",
    "producto": "Gogs",
    "descripcion": "Gogs contains a path traversal vulnerability affecting improper Symbolic link handling in the PutContents API that could allow for code execution."
  },
  {
    "fecha": "2026-01-07",
    "cve": "CVE-2009-0556",
    "vendor": "Microsoft",
    "producto": "Office",
    "descripcion": "Microsoft Office PowerPoint contains a code injection vulnerability that allows remote attackers to execute arbitrary code via a PowerPoint file with an OutlineTextRefAtom containing an invalid index value that triggers memory corruption."
  },
  {
    "fecha": "2026-01-07",
    "cve": "CVE-2025-37164",
    "vendor": "Hewlett Packard Enterprise (HPE)",
    "producto": "OneView",
    "descripcion": "Hewlett Packard Enterprise (HPE) OneView contains a code injection vulnerability that allows a remote unauthenticated user to perform remote code execution."
  },
  {
    "fecha": "2025-12-29",
    "cve": "CVE-2025-14847",
    "vendor": "MongoDB",
    "producto": "MongoDB and MongoDB Server",
    "descripcion": "MongoDB Server contains an improper handling of length parameter inconsistency vulnerability in Zlib compressed protocol headers. This vulnerability may allow a read of uninitialized heap memory by an unauthenticated client."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2023-52163",
    "vendor": "Digiever",
    "producto": "DS-2105 Pro",
    "descripcion": "Digiever DS-2105 Pro contains a missing authorization vulnerability which could allow for command injection via time_tzsetup.cgi."
  },
  {
    "fecha": "2025-12-19",
    "cve": "CVE-2025-14733",
    "vendor": "WatchGuard",
    "producto": "Firebox",
    "descripcion": "WatchGuard Fireware OS iked process contains an out of bounds write vulnerability in the OS iked process. This vulnerability may allow a remote unauthenticated attacker to execute arbitrary code and affects both the mobile user VPN with IKEv2 and the branch office VPN using IKEv2 when configured with a dynamic gateway peer."
  },
  {
    "fecha": "2025-12-17",
    "cve": "CVE-2025-59374",
    "vendor": "ASUS",
    "producto": "Live Update",
    "descripcion": "ASUS Live Update contains an embedded malicious code vulnerability client were distributed with unauthorized modifications introduced through a supply chain compromise. The modified builds could cause devices meeting specific targeting conditions to perform unintended actions. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-12-17",
    "cve": "CVE-2025-40602",
    "vendor": "SonicWall",
    "producto": "SMA1000 appliance",
    "descripcion": "SonicWall SMA1000 contains a missing authorization vulnerability that could allow for privilege escalation appliance management console (AMC) of affected devices."
  },
  {
    "fecha": "2025-12-17",
    "cve": "CVE-2025-20393",
    "vendor": "Cisco",
    "producto": "Multiple Products",
    "descripcion": "Cisco Secure Email Gateway, Secure Email, AsyncOS Software, and Web Manager appliances contains an improper input validation vulnerability that allows threat actors to execute arbitrary commands with root privileges on the underlying operating system of an affected appliance."
  },
  {
    "fecha": "2025-12-16",
    "cve": "CVE-2025-59718",
    "vendor": "Fortinet",
    "producto": "Multiple Products",
    "descripcion": "Fortinet FortiOS, FortiSwitchMaster, FortiProxy, and FortiWeb contain an improper verification of cryptographic signature vulnerability that may allow an unauthenticated attacker to bypass the FortiCloud SSO login authentication via a crafted SAML message. Please be aware that CVE-2025-59719 pertains to the same problem and is mentioned in the same vendor advisory. Ensure to apply all patches mentioned in the advisory."
  },
  {
    "fecha": "2025-12-15",
    "cve": "CVE-2025-14611",
    "vendor": "Gladinet",
    "producto": "CentreStack and Triofox",
    "descripcion": "Gladinet CentreStack and TrioFox contain a hardcoded cryptographic keys vulnerability for their implementation of the AES cryptoscheme. This vulnerability degrades security for public exposed endpoints that may make use of it and may offer arbitrary local file inclusion when provided a specially crafted request without authentication."
  },
  {
    "fecha": "2025-12-15",
    "cve": "CVE-2025-43529",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple iOS, iPadOS, macOS, and other Apple products contain a use-after-free vulnerability in WebKit. Processing maliciously crafted web content may lead to memory corruption. This vulnerability could impact HTML parsers that use WebKit, including but not limited to Apple Safari and non-Apple products which rely on WebKit for HTML processing."
  },
  {
    "fecha": "2025-12-12",
    "cve": "CVE-2018-4063",
    "vendor": "Sierra Wireless",
    "producto": "AirLink ALEOS",
    "descripcion": "Sierra Wireless AirLink ALEOS contains an unrestricted upload of file with dangerous type vulnerability. A specially crafted HTTP request can upload a file, resulting in executable code being uploaded, and routable, to the webserver. An attacker can make an authenticated HTTP request to trigger this vulnerability. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-12-12",
    "cve": "CVE-2025-14174",
    "vendor": "Google",
    "producto": "Chromium",
    "descripcion": "Google Chromium contains an out of bounds memory access vulnerability in ANGLE that could allow a remote attacker to perform out of bounds memory access via a crafted HTML page. This vulnerability could affect multiple web browsers that utilize Chromium, including, but not limited to, Google Chrome, Microsoft Edge, and Opera."
  },
  {
    "fecha": "2025-12-11",
    "cve": "CVE-2025-58360",
    "vendor": "OSGeo",
    "producto": "GeoServer",
    "descripcion": "OSGeo GeoServer contains an improper restriction of XML external entity reference vulnerability that occurs when the application accepts XML input through a specific endpoint /geoserver/wms operation GetMap and could allow an attacker to define external entities within the XML request."
  },
  {
    "fecha": "2025-12-09",
    "cve": "CVE-2025-6218",
    "vendor": "RARLAB",
    "producto": "WinRAR",
    "descripcion": "RARLAB WinRAR contains a path traversal vulnerability allowing an attacker to execute code in the context of the current user."
  },
  {
    "fecha": "2025-12-09",
    "cve": "CVE-2025-62221",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Cloud Files Mini Filter Driver contains a use after free vulnerability that can allow an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-12-08",
    "cve": "CVE-2022-37055",
    "vendor": "D-Link",
    "producto": "Routers",
    "descripcion": "D-Link Routers contains a buffer overflow vulnerability that has a high impact on confidentiality, integrity, and availability. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-12-08",
    "cve": "CVE-2025-66644",
    "vendor": "Array Networks ",
    "producto": "ArrayOS AG",
    "descripcion": "Array Networks ArrayOS AG contains an OS command injection vulnerability that could allow an attacker to execute arbitrary commands."
  },
  {
    "fecha": "2025-12-05",
    "cve": "CVE-2025-55182",
    "vendor": "Meta",
    "producto": "React Server Components",
    "descripcion": "Meta React Server Components contains a remote code execution vulnerability that could allow unauthenticated remote code execution by exploiting a flaw in how React decodes payloads sent to React Server Function endpoints. Please note CVE-2025-66478 has been rejected, but it is associated with CVE-2025- 55182."
  },
  {
    "fecha": "2025-12-03",
    "cve": "CVE-2021-26828",
    "vendor": "OpenPLC",
    "producto": "ScadaBR",
    "descripcion": "OpenPLC ScadaBR contains an unrestricted upload of file with dangerous type vulnerability that allows remote authenticated users to upload and execute arbitrary JSP files via view_edit.shtm."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-48633",
    "vendor": "Android",
    "producto": "Framework",
    "descripcion": "Android Framework contains an unspecified vulnerability that allows for information disclosure."
  },
  {
    "fecha": "2025-12-02",
    "cve": "CVE-2025-48572",
    "vendor": "Android",
    "producto": "Framework",
    "descripcion": "Android Framework contains an unspecified vulnerability that allows for privilege escalation."
  },
  {
    "fecha": "2025-11-28",
    "cve": "CVE-2021-26829",
    "vendor": "OpenPLC",
    "producto": "ScadaBR",
    "descripcion": "OpenPLC ScadaBR contains a cross-site scripting vulnerability via system_settings.shtm."
  },
  {
    "fecha": "2025-11-21",
    "cve": "CVE-2025-61757",
    "vendor": "Oracle",
    "producto": "Fusion Middleware",
    "descripcion": "Oracle Fusion Middleware contains a missing authentication for critical function vulnerability, allowing unauthenticated remote attackers to take over Identity Manager."
  },
  {
    "fecha": "2025-11-19",
    "cve": "CVE-2025-13223",
    "vendor": "Google",
    "producto": "Chromium V8",
    "descripcion": "Google Chromium V8 contains a type confusion vulnerability that allows for heap corruption."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-58034",
    "vendor": "Fortinet",
    "producto": "FortiWeb",
    "descripcion": "Fortinet FortiWeb contains an OS command Injection vulnerability that may allow an authenticated attacker to execute unauthorized code on the underlying system via crafted HTTP requests or CLI commands."
  },
  {
    "fecha": "2025-11-14",
    "cve": "CVE-2025-64446",
    "vendor": "Fortinet",
    "producto": "FortiWeb",
    "descripcion": "Fortinet FortiWeb contains a relative path traversal vulnerability that may allow an unauthenticated attacker to execute administrative commands on the system via crafted HTTP or HTTPS requests."
  },
  {
    "fecha": "2025-11-12",
    "cve": "CVE-2025-12480",
    "vendor": "Gladinet",
    "producto": "Triofox",
    "descripcion": "Gladinet Triofox contains an improper access control vulnerability that allows access to initial setup pages even after setup is complete."
  },
  {
    "fecha": "2025-11-12",
    "cve": "CVE-2025-62215",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Kernel contains a race condition vulnerability that allows a local attacker with low-level privileges to escalate privileges. Successful exploitation of this vulnerability could enable the attacker to gain SYSTEM-level access."
  },
  {
    "fecha": "2025-11-12",
    "cve": "CVE-2025-9242",
    "vendor": "WatchGuard",
    "producto": "Firebox",
    "descripcion": "WatchGuard Firebox contains an out-of-bounds write vulnerability in the OS iked process that may allow a remote unauthenticated attacker to execute arbitrary code."
  },
  {
    "fecha": "2025-11-10",
    "cve": "CVE-2025-21042",
    "vendor": "Samsung",
    "producto": "Mobile Devices",
    "descripcion": "Samsung mobile devices contain an out-of-bounds write vulnerability in libimagecodec.quram.so. This vulnerability could allow remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-11-04",
    "cve": "CVE-2025-48703",
    "vendor": "CWP",
    "producto": "Control Web Panel",
    "descripcion": "CWP Control Web Panel (formerly CentOS Web Panel) contains an OS command Injection vulnerability that allows unauthenticated remote code execution via shell metacharacters in the t_total parameter in a filemanager changePerm request. A valid non-root username must be known."
  },
  {
    "fecha": "2025-11-04",
    "cve": "CVE-2025-11371",
    "vendor": "Gladinet",
    "producto": "CentreStack and Triofox",
    "descripcion": "Gladinet CentreStack and Triofox contains a files or directories accessible to external parties vulnerability that allows unintended disclosure of system files."
  },
  {
    "fecha": "2025-10-30",
    "cve": "CVE-2025-41244",
    "vendor": "Broadcom",
    "producto": "VMware Aria Operations and VMware Tools",
    "descripcion": "Broadcom VMware Aria Operations and VMware Tools contain a privilege defined with unsafe actions vulnerability. A malicious local actor with non-administrative privileges having access to a VM with VMware Tools installed and managed by Aria Operations with SDMP enabled may exploit this vulnerability to escalate privileges to root on the same VM."
  },
  {
    "fecha": "2025-10-30",
    "cve": "CVE-2025-24893",
    "vendor": "XWiki",
    "producto": "Platform",
    "descripcion": "XWiki Platform contains an eval injection vulnerability that could allow any guest to perform arbitrary remote code execution through a request to SolrSearch."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-6204",
    "vendor": "Dassault Systèmes",
    "producto": "DELMIA Apriso",
    "descripcion": "Dassault Systèmes DELMIA Apriso contains a code injection vulnerability that could allow an attacker to execute arbitrary code."
  },
  {
    "fecha": "2025-10-28",
    "cve": "CVE-2025-6205",
    "vendor": "Dassault Systèmes",
    "producto": "DELMIA Apriso",
    "descripcion": "Dassault Systèmes DELMIA Apriso contains a missing authorization vulnerability that could allow an attacker to gain privileged access to the application."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-54236",
    "vendor": "Adobe",
    "producto": "Commerce and Magento",
    "descripcion": "Adobe Commerce and Magento Open Source contain an improper input validation vulnerability that could allow an attacker to take over customer accounts through the Commerce REST API."
  },
  {
    "fecha": "2025-10-24",
    "cve": "CVE-2025-59287",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Server Update Service (WSUS) contains a deserialization of untrusted data vulnerability that allows for remote code execution."
  },
  {
    "fecha": "2025-10-22",
    "cve": "CVE-2025-61932",
    "vendor": "Motex",
    "producto": "LANSCOPE Endpoint Manager",
    "descripcion": "Motex LANSCOPE Endpoint Manager contains an improper verification of source of a communication channel vulnerability allowing an attacker to execute arbitrary code by sending specially crafted packets."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2022-48503",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple macOS, iOS, tvOS, Safari, and watchOS contain an unspecified vulnerability in JavaScriptCore that when processing web content may lead to arbitrary code execution. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-2746",
    "vendor": "Kentico",
    "producto": "Xperience CMS",
    "descripcion": "Kentico Xperience CMS contains an authentication bypass using an alternate path or channel vulnerability that could allow an attacker to control administrative objects."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-2747",
    "vendor": "Kentico",
    "producto": "Xperience CMS",
    "descripcion": "Kentico Xperience CMS contains an authentication bypass using an alternate path or channel vulnerability that could allow an attacker to control administrative objects."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-33073",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows SMB Client contains an improper access control vulnerability that could allow for privilege escalation. An attacker could execute a specially crafted malicious script to coerce the victim machine to connect back to the attack system using SMB and authenticate."
  },
  {
    "fecha": "2025-10-20",
    "cve": "CVE-2025-61884",
    "vendor": "Oracle",
    "producto": "E-Business Suite",
    "descripcion": "Oracle E-Business Suite contains a server-side request forgery (SSRF) vulnerability in the Runtime component of Oracle Configurator. This vulnerability is remotely exploitable without authentication."
  },
  {
    "fecha": "2025-10-15",
    "cve": "CVE-2025-54253",
    "vendor": "Adobe",
    "producto": "Experience Manager (AEM) Forms",
    "descripcion": "Adobe Experience Manager Forms in JEE contains an unspecified vulnerability that allows for arbitrary code execution."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2025-47827",
    "vendor": "IGEL",
    "producto": "IGEL OS",
    "descripcion": "IGEL OS contains a use of a key past its expiration date vulnerability that allows for Secure Boot bypass. The igel-flash-driver module improperly verifies a cryptographic signature. Ultimately, a crafted root filesystem can be mounted from an unverified SquashFS image."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2025-24990",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Agere Modem Driver contains an untrusted pointer dereference vulnerability that allows for privilege escalation. An attacker who successfully exploited this vulnerability could gain administrator privileges."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2025-59230",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows contains an improper access control vulnerability in Windows Remote Access Connection Manager which could allow an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-14",
    "cve": "CVE-2016-7836",
    "vendor": "SKYSEA",
    "producto": "Client View",
    "descripcion": "SKYSEA Client View contains an improper authentication vulnerability that allows remote code execution via a flaw in processing authentication on the TCP connection with the management console program."
  },
  {
    "fecha": "2025-10-09",
    "cve": "CVE-2021-43798",
    "vendor": "Grafana Labs",
    "producto": "Grafana",
    "descripcion": "Grafana contains a path traversal vulnerability that could allow access to local files."
  },
  {
    "fecha": "2025-10-07",
    "cve": "CVE-2025-27915",
    "vendor": "Synacor",
    "producto": "Zimbra Collaboration Suite (ZCS)",
    "descripcion": "Synacor Zimbra Collaboration Suite (ZCS) contains a cross-site scripting vulnerability that exists in the Classic Web Client due to insufficient sanitization of HTML content in ICS files. When a user views an e-mail message containing a malicious ICS entry, its embedded JavaScript executes via an ontoggle event inside a tag. This allows an attacker to run arbitrary JavaScript within the victim's session, potentially leading to unauthorized actions such as setting e-mail filters to redirect messages to an attacker-controlled address. As a result, an attacker can perform unauthorized actions on the victim's account, including e-mail redirection and data exfiltration."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2021-22555",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux Kernel contains a heap out-of-bounds write vulnerability that could allow an attacker to gain privileges or cause a DoS (via heap memory corruption) through user name space."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2010-3962",
    "vendor": "Microsoft",
    "producto": "Internet Explorer",
    "descripcion": "Microsoft Internet Explorer contains an uninitialized memory corruption vulnerability that could allow for remote code execution. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2021-43226",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Common Log File System Driver contains a privilege escalation vulnerability that could allow a local, privileged attacker to bypass certain security mechanisms."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2013-3918",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows contains an out-of-bounds write vulnerability in the InformationCardSigninHelper Class ActiveX control, icardie.dll. An attacker could exploit the vulnerability by constructing a specially crafted webpage. When a user views the webpage, the vulnerability could allow remote code execution. An attacker who successfully exploited this vulnerability could gain the same user rights as the current user. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2011-3402",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Kernel contains an unspecified vulnerability in the TrueType font parsing engine in win32k.sys in the kernel-mode drivers that allows remote attackers to execute arbitrary code via crafted font data in a Word document or web page."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2010-3765",
    "vendor": "Mozilla",
    "producto": "Multiple Products",
    "descripcion": "Mozilla Firefox, SeaMonkey, and Thunderbird contain an unspecified vulnerability when JavaScript is enabled. This allows remote attackers to execute arbitrary code via vectors related to nsCSSFrameConstructor::ContentAppended, the appendChild method, incorrect index tracking, and the creation of multiple frames, which triggers memory corruption."
  },
  {
    "fecha": "2025-10-06",
    "cve": "CVE-2025-61882",
    "vendor": "Oracle",
    "producto": "E-Business Suite",
    "descripcion": "Oracle E-Business Suite contains an unspecified vulnerability in the BI Publisher Integration component. The vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Concurrent Processing. Successful attacks can result in takeover of Oracle Concurrent Processing."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2014-6278",
    "vendor": "GNU",
    "producto": "GNU Bash",
    "descripcion": "GNU Bash contains an OS command injection vulnerability which allows remote attackers to execute arbitrary commands via a crafted environment."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2017-1000353",
    "vendor": "Jenkins",
    "producto": "Jenkins",
    "descripcion": "Jenkins contains a remote code execution vulnerability. This vulnerability that could allowed attackers to transfer a serialized Java SignedObject object to the remoting-based Jenkins CLI, that would be deserialized using a new ObjectInputStream, bypassing the existing blocklist-based protection mechanism."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2015-7755",
    "vendor": "Juniper",
    "producto": "ScreenOS",
    "descripcion": "Juniper ScreenOS contains an improper authentication vulnerability that could allow unauthorized remote administrative access to the device."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2025-21043",
    "vendor": "Samsung",
    "producto": "Mobile Devices",
    "descripcion": "Samsung mobile devices contain an out-of-bounds write vulnerability in libimagecodec.quram.so which allows remote attackers to execute arbitrary code."
  },
  {
    "fecha": "2025-10-02",
    "cve": "CVE-2025-4008",
    "vendor": "Smartbedded",
    "producto": "Meteobridge",
    "descripcion": "Smartbedded Meteobridge contains a command injection vulnerability that could allow remote unauthenticated attackers to gain arbitrary command execution with elevated privileges (root) on affected devices."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-32463",
    "vendor": "Sudo",
    "producto": "Sudo",
    "descripcion": "Sudo contains an inclusion of functionality from untrusted control sphere vulnerability. This vulnerability could allow local attacker to leverage sudo’s -R (--chroot) option to run arbitrary commands as root, even if they are not listed in the sudoers file."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-59689",
    "vendor": "Libraesva",
    "producto": "Email Security Gateway",
    "descripcion": "Libraesva Email Security Gateway (ESG) contains a command injection vulnerability which allows command injection via a compressed e-mail attachment."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-10035",
    "vendor": "Fortra",
    "producto": "GoAnywhere MFT",
    "descripcion": "Fortra GoAnywhere MFT contains a deserialization of untrusted data vulnerability allows an actor with a validly forged license response signature to deserialize an arbitrary actor-controlled object, possibly leading to command injection."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2025-20352",
    "vendor": "Cisco",
    "producto": "IOS and IOS XE",
    "descripcion": "Cisco IOS and IOS XE contains a stack-based buffer overflow vulnerability in the Simple Network Management Protocol (SNMP) subsystem that could allow for denial of service or remote code execution. A successful exploit could allow a low-privileged attacker to cause the affected system to reload, resulting in a DoS condition, or allow a high-privileged attacker to execute arbitrary code as the root user and obtain full control of the affected system."
  },
  {
    "fecha": "2025-09-29",
    "cve": "CVE-2021-21311",
    "vendor": "Adminer",
    "producto": "Adminer",
    "descripcion": "Adminer contains a server-side request forgery vulnerability that, when exploited, allows a remote attacker to obtain potentially sensitive information."
  },
  {
    "fecha": "2025-09-25",
    "cve": "CVE-2025-20362",
    "vendor": "Cisco",
    "producto": "Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense",
    "descripcion": "Cisco Secure Firewall Adaptive Security (ASA) Appliance and Secure Firewall Threat Defense (FTD) Software VPN Web Server contain a missing authorization vulnerability. This vulnerability could be chained with CVE-2025-20333."
  },
  {
    "fecha": "2025-09-25",
    "cve": "CVE-2025-20333",
    "vendor": "Cisco",
    "producto": "Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense",
    "descripcion": "Cisco Secure Firewall Adaptive Security (ASA) Appliance and Secure Firewall Threat Defense (FTD) Software VPN Web Server contain a buffer overflow vulnerability that allows for remote code execution. This vulnerability could be chained with CVE-2025-20362."
  },
  {
    "fecha": "2025-09-23",
    "cve": "CVE-2025-10585",
    "vendor": "Google",
    "producto": "Chromium V8",
    "descripcion": "Google Chromium contains a type confusion vulnerability in the V8 JavaScript and WebAssembly engine."
  },
  {
    "fecha": "2025-09-11",
    "cve": "CVE-2025-5086",
    "vendor": "Dassault Systèmes",
    "producto": "DELMIA Apriso",
    "descripcion": "Dassault Systèmes DELMIA Apriso contains a deserialization of untrusted data vulnerability that could lead to a remote code execution."
  },
  {
    "fecha": "2025-09-04",
    "cve": "CVE-2025-38352",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux kernel contains a time-of-check time-of-use (TOCTOU) race condition vulnerability that has a high impact on confidentiality, integrity, and availability."
  },
  {
    "fecha": "2025-09-04",
    "cve": "CVE-2025-48543",
    "vendor": "Android",
    "producto": "Runtime",
    "descripcion": "Android Runtime contains a use-after-free vulnerability potentially allowing a chrome sandbox escape leading to local privilege escalation."
  },
  {
    "fecha": "2025-09-04",
    "cve": "CVE-2025-53690",
    "vendor": "Sitecore",
    "producto": "Multiple Products",
    "descripcion": "Sitecore Experience Manager (XM), Experience Platform (XP), Experience Commerce (XC), and Managed Cloud contain a deserialization of untrusted data vulnerability involving the use of default machine keys. This flaw allows attackers to exploit exposed ASP.NET machine keys to achieve remote code execution."
  },
  {
    "fecha": "2025-09-03",
    "cve": "CVE-2023-50224",
    "vendor": "TP-Link",
    "producto": "TL-WR841N",
    "descripcion": "TP-Link TL-WR841N contains an authentication bypass by spoofing vulnerability within the httpd service, which listens on TCP port 80 by default, leading to the disclose of stored credentials. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-09-03",
    "cve": "CVE-2025-9377",
    "vendor": "TP-Link",
    "producto": "Multiple Routers",
    "descripcion": "TP-Link Archer C7(EU) and TL-WR841N/ND(MS) contain an OS command injection vulnerability that exists in the Parental Control page. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-09-02",
    "cve": "CVE-2020-24363",
    "vendor": "TP-Link",
    "producto": "TL-WA855RE",
    "descripcion": "TP-link TL-WA855RE contains a missing authentication for critical function vulnerability. This vulnerability could allow an unauthenticated attacker (on the same network) to submit a TDDP_RESET POST request for a factory reset and reboot. The attacker can then obtain incorrect access control by setting a new administrative password. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-09-02",
    "cve": "CVE-2025-55177",
    "vendor": "Meta Platforms",
    "producto": "WhatsApp",
    "descripcion": "Meta Platforms WhatsApp contains an incorrect authorization vulnerability due to an incomplete authorization of linked device synchronization messages. This vulnerability could allow an unrelated user to trigger processing of content from an arbitrary URL on a target’s device."
  },
  {
    "fecha": "2025-08-29",
    "cve": "CVE-2025-57819",
    "vendor": "Sangoma",
    "producto": "FreePBX",
    "descripcion": "Sangoma FreePBX contains an authentication bypass vulnerability due to insufficiently sanitized user-supplied data allows unauthenticated access to FreePBX Administrator leading to arbitrary database manipulation and remote code execution."
  },
  {
    "fecha": "2025-08-26",
    "cve": "CVE-2025-7775",
    "vendor": "Citrix",
    "producto": "NetScaler",
    "descripcion": "Citrix NetScaler ADC and NetScaler Gateway contain a memory overflow vulnerability that could allow for remote code execution and/or denial of service."
  },
  {
    "fecha": "2025-08-25",
    "cve": "CVE-2025-48384",
    "vendor": "Git",
    "producto": "Git",
    "descripcion": "Git contains a link following vulnerability that stems from Git’s inconsistent handling of carriage return characters in configuration files."
  },
  {
    "fecha": "2025-08-25",
    "cve": "CVE-2024-8068",
    "vendor": "Citrix",
    "producto": "Session Recording",
    "descripcion": "Citrix Session Recording contains an improper privilege management vulnerability that could allow for privilege escalation to NetworkService Account access. An attacker must be an authenticated user in the same Windows Active Directory domain as the session recording server domain."
  },
  {
    "fecha": "2025-08-25",
    "cve": "CVE-2024-8069",
    "vendor": "Citrix",
    "producto": "Session Recording",
    "descripcion": "Citrix Session Recording contains a deserialization of untrusted data vulnerability that allows limited remote code execution with privilege of a NetworkService Account access. Attacker must be an authenticated user on the same intranet as the session recording server."
  },
  {
    "fecha": "2025-08-21",
    "cve": "CVE-2025-43300",
    "vendor": "Apple",
    "producto": "iOS, iPadOS, and macOS",
    "descripcion": "Apple iOS, iPadOS, and macOS contain an out-of-bounds write vulnerability in the Image I/O framework."
  },
  {
    "fecha": "2025-08-18",
    "cve": "CVE-2025-54948",
    "vendor": "Trend Micro",
    "producto": "Apex One",
    "descripcion": "Trend Micro Apex One Management Console (on-premise) contains an OS command injection vulnerability that could allow a pre-authenticated remote attacker to upload malicious code and execute commands on affected installations."
  },
  {
    "fecha": "2025-08-13",
    "cve": "CVE-2025-8876",
    "vendor": "N-able",
    "producto": "N-Central",
    "descripcion": "N-able N-Central contains a command injection vulnerability via improper sanitization of user input."
  },
  {
    "fecha": "2025-08-13",
    "cve": "CVE-2025-8875",
    "vendor": "N-able",
    "producto": "N-Central",
    "descripcion": "N-able N-Central contains an insecure deserialization vulnerability that could lead to command execution."
  },
  {
    "fecha": "2025-08-12",
    "cve": "CVE-2025-8088",
    "vendor": "RARLAB",
    "producto": "WinRAR",
    "descripcion": "RARLAB WinRAR contains a path traversal vulnerability affecting the Windows version of WinRAR. This vulnerability could allow an attacker to execute arbitrary code by crafting malicious archive files."
  },
  {
    "fecha": "2025-08-12",
    "cve": "CVE-2007-0671",
    "vendor": "Microsoft",
    "producto": "Office",
    "descripcion": "Microsoft Office Excel contains a remote code execution vulnerability that can be exploited when a specially crafted Excel file is opened. This malicious file could be delivered as an email attachment or hosted on a malicious website. An attacker could leverage this vulnerability by creating a specially crafted Excel file, which, when opened, allowing an attacker to execute remote code on the affected system."
  },
  {
    "fecha": "2025-08-12",
    "cve": "CVE-2013-3893",
    "vendor": "Microsoft",
    "producto": "Internet Explorer",
    "descripcion": "Microsoft Internet Explorer contains a memory corruption vulnerability that allows for remote code execution. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-08-05",
    "cve": "CVE-2020-25078",
    "vendor": "D-Link",
    "producto": "DCS-2530L and DCS-2670L Devices",
    "descripcion": "D-Link DCS-2530L and DCS-2670L devices contains an unspecified vulnerability that could allow for remote administrator password disclosure. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-08-05",
    "cve": "CVE-2020-25079",
    "vendor": "D-Link",
    "producto": "DCS-2530L and DCS-2670L Devices",
    "descripcion": "D-Link DCS-2530L and DCS-2670L devices contains a command injection vulnerability in the cgi-bin/ddns_enc.cgi. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-08-05",
    "cve": "CVE-2022-40799",
    "vendor": "D-Link",
    "producto": "DNR-322L",
    "descripcion": "D-Link DNR-322L contains a download of code without integrity check vulnerability that could allow an authenticated attacker to execute OS level commands on the device. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-07-28",
    "cve": "CVE-2023-2533",
    "vendor": "PaperCut",
    "producto": "NG/MF",
    "descripcion": "PaperCut NG/MF contains a cross-site request forgery (CSRF) vulnerability, which, under specific conditions, could potentially enable an attacker to alter security settings or execute arbitrary code."
  },
  {
    "fecha": "2025-07-28",
    "cve": "CVE-2025-20337",
    "vendor": "Cisco",
    "producto": "Identity Services Engine",
    "descripcion": "Cisco Identity Services Engine contains an injection vulnerability in a specific API of Cisco ISE and Cisco ISE-PIC due to insufficient validation of user-supplied input allowing an attacker to exploit this vulnerability by submitting a crafted API request. Successful exploitation could allow an attacker to perform remote code execution and obtaining root privileges on an affected device."
  },
  {
    "fecha": "2025-07-28",
    "cve": "CVE-2025-20281",
    "vendor": "Cisco",
    "producto": "Identity Services Engine",
    "descripcion": "Cisco Identity Services Engine contains an injection vulnerability in a specific API of Cisco ISE and Cisco ISE-PIC due to insufficient validation of user-supplied input allowing an attacker to exploit this vulnerability by submitting a crafted API request. Successful exploitation could allow an attacker to perform remote code execution and obtaining root privileges on an affected device."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-2775",
    "vendor": "SysAid",
    "producto": "SysAid On-Prem",
    "descripcion": "SysAid On-Prem contains an improper restriction of XML external entity reference vulnerability in the Checkin processing functionality, allowing for administrator account takeover and file read primitives."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-2776",
    "vendor": "SysAid",
    "producto": "SysAid On-Prem",
    "descripcion": "SysAid On-Prem contains an improper restriction of XML external entity reference vulnerability in the Server URL processing functionality, allowing for administrator account takeover and file read primitives."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-6558",
    "vendor": "Google",
    "producto": "Chromium",
    "descripcion": "Google Chromium contains an improper input validation vulnerability in ANGLE and GPU. This vulnerability could allow a remote attacker to potentially perform a sandbox escape via a crafted HTML page. This vulnerability could affect multiple web browsers that utilize Chromium, including, but not limited to, Google Chrome, Microsoft Edge, and Opera."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-54309",
    "vendor": "CrushFTP",
    "producto": "CrushFTP",
    "descripcion": "CrushFTP contains an unprotected alternate channel vulnerability. When the DMZ proxy feature is not used, mishandles AS2 validation and consequently allows remote attackers to obtain admin access via HTTPS."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-49704",
    "vendor": "Microsoft",
    "producto": "SharePoint",
    "descripcion": "Microsoft SharePoint contains a code injection vulnerability that could allow an authorized attacker to execute code over a network. This vulnerability could be chained with CVE-2025-49706. CVE-2025-53770 is a patch bypass for CVE-2025-49704, and the updates for CVE-2025-53770 include more robust protection than those for CVE-2025-49704."
  },
  {
    "fecha": "2025-07-22",
    "cve": "CVE-2025-49706",
    "vendor": "Microsoft",
    "producto": "SharePoint",
    "descripcion": "Microsoft SharePoint contains an improper authentication vulnerability that allows an authorized attacker to perform spoofing over a network. Successfully exploitation could allow an attacker to view sensitive information and make some changes to disclosed information. This vulnerability could be chained with CVE-2025-49704. CVE-2025-53771 is a patch bypass for CVE-2025-49706, and the updates for CVE-2025-53771 include more robust protection than those for CVE-2025-49706."
  },
  {
    "fecha": "2025-07-20",
    "cve": "CVE-2025-53770",
    "vendor": "Microsoft",
    "producto": "SharePoint",
    "descripcion": "Microsoft SharePoint Server on-premises contains a deserialization of untrusted data vulnerability that could allow an unauthorized attacker to execute code over a network. This vulnerability could be chained with CVE-2025-53771. CVE-2025-53770 is a patch bypass for CVE-2025-49704, and the updates for CVE-2025-53770 include more robust protection than those for CVE-2025-49704."
  },
  {
    "fecha": "2025-07-18",
    "cve": "CVE-2025-25257",
    "vendor": "Fortinet",
    "producto": "FortiWeb",
    "descripcion": "Fortinet FortiWeb contains a SQL injection vulnerability that may allow an unauthenticated attacker to execute unauthorized SQL code or commands via crafted HTTP or HTTPs requests."
  },
  {
    "fecha": "2025-07-14",
    "cve": "CVE-2025-47812",
    "vendor": "Wing FTP Server",
    "producto": "Wing FTP Server",
    "descripcion": "Wing FTP Server contains an improper neutralization of null byte or NUL character vulnerability that can allow injection of arbitrary Lua code into user session files. This can be used to execute arbitrary system commands with the privileges of the FTP service (root or SYSTEM by default)."
  },
  {
    "fecha": "2025-07-10",
    "cve": "CVE-2025-5777",
    "vendor": "Citrix",
    "producto": "NetScaler ADC and Gateway",
    "descripcion": "Citrix NetScaler ADC and Gateway contain an out-of-bounds read vulnerability due to insufficient input validation. This vulnerability can lead to memory overread when the NetScaler is configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) OR AAA virtual server."
  },
  {
    "fecha": "2025-07-07",
    "cve": "CVE-2019-9621",
    "vendor": "Synacor",
    "producto": "Zimbra Collaboration Suite (ZCS)",
    "descripcion": "Synacor Zimbra Collaboration Suite (ZCS) contains a server-side request forgery (SSRF) vulnerability via the ProxyServlet component."
  },
  {
    "fecha": "2025-07-07",
    "cve": "CVE-2019-5418",
    "vendor": "Rails",
    "producto": "Ruby on Rails",
    "descripcion": "Rails Ruby on Rails contains a path traversal vulnerability in Action View. Specially crafted accept headers in combination with calls to `render file:` can cause arbitrary files on the target server to be rendered, disclosing the file contents."
  },
  {
    "fecha": "2025-07-07",
    "cve": "CVE-2016-10033",
    "vendor": "PHP",
    "producto": "PHPMailer",
    "descripcion": "PHPMailer contains a command injection vulnerability because it fails to sanitize user-supplied input. Specifically, this issue affects the 'mail()' function of 'class.phpmailer.php' script. An attacker can exploit this issue to execute arbitrary code within the context of the application. Failed exploit attempts will result in a denial-of-service condition."
  },
  {
    "fecha": "2025-07-07",
    "cve": "CVE-2014-3931",
    "vendor": "Looking Glass",
    "producto": "Multi-Router Looking Glass (MRLG)",
    "descripcion": "Multi-Router Looking Glass (MRLG) contains a buffer overflow vulnerability that could allow remote attackers to cause an arbitrary memory write and memory corruption."
  },
  {
    "fecha": "2025-07-02",
    "cve": "CVE-2025-6554",
    "vendor": "Google",
    "producto": "Chromium V8",
    "descripcion": "Google Chromium V8 contains a type confusion vulnerability that could allow a remote attacker to perform arbitrary read/write via a crafted HTML page. This vulnerability could affect multiple web browsers that utilize Chromium, including, but not limited to, Google Chrome, Microsoft Edge, and Opera."
  },
  {
    "fecha": "2025-07-01",
    "cve": "CVE-2025-48928",
    "vendor": "TeleMessage",
    "producto": "TM SGNL",
    "descripcion": "TeleMessage TM SGNL contains an exposure of core dump file to an unauthorized control sphere Vulnerability. This vulnerability is based on a JSP application in which the heap content is roughly equivalent to a \"core dump\" in which a password previously sent over HTTP would be included in this dump."
  },
  {
    "fecha": "2025-07-01",
    "cve": "CVE-2025-48927",
    "vendor": "TeleMessage",
    "producto": "TM SGNL",
    "descripcion": "TeleMessage TM SGNL contains an initialization of a resource with an insecure default vulnerability. This vulnerability relies on how the Spring Boot Actuator is configured with an exposed heap dump endpoint at a /heapdump URI."
  },
  {
    "fecha": "2025-06-30",
    "cve": "CVE-2025-6543",
    "vendor": "Citrix",
    "producto": "NetScaler ADC and Gateway",
    "descripcion": "Citrix NetScaler ADC and Gateway contain a buffer overflow vulnerability leading to unintended control flow and Denial of Service. NetScaler must be configured as Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) OR AAA virtual server."
  },
  {
    "fecha": "2025-06-25",
    "cve": "CVE-2019-6693",
    "vendor": "Fortinet",
    "producto": "FortiOS",
    "descripcion": "Fortinet FortiOS contains a use of hard-coded credentials vulnerability that could allow an attacker to cipher sensitive data in FortiOS configuration backup file via knowledge of the hard-coded key."
  },
  {
    "fecha": "2025-06-25",
    "cve": "CVE-2024-0769",
    "vendor": "D-Link",
    "producto": "DIR-859 Router",
    "descripcion": "D-Link DIR-859 routers contain a path traversal vulnerability in the file /hedwig.cgi of the component HTTP POST Request Handler. Manipulation of the argument service with the input ../../../../htdocs/webinc/getcfg/DHCPS6.BRIDGE-1.xml allows for the leakage of session data potentially enabling privilege escalation and unauthorized control of the device. This vulnerability affects legacy D-Link products. All associated hardware revisions have reached their end-of-life (EOL) or end-of-service (EOS) life cycle and should be retired and replaced per vendor instructions."
  },
  {
    "fecha": "2025-06-25",
    "cve": "CVE-2024-54085",
    "vendor": "AMI",
    "producto": "MegaRAC SPx",
    "descripcion": "AMI MegaRAC SPx contains an authentication bypass by spoofing vulnerability in the Redfish Host Interface. A successful exploitation of this vulnerability may lead to a loss of confidentiality, integrity, and/or availability."
  },
  {
    "fecha": "2025-06-17",
    "cve": "CVE-2023-0386",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux Kernel contains an improper ownership management vulnerability, where unauthorized access to the execution of the setuid file with capabilities was found in the Linux kernel’s OverlayFS subsystem in how a user copies a capable file from a nosuid mount into another mount. This uid mapping bug allows a local user to escalate their privileges on the system."
  },
  {
    "fecha": "2025-06-16",
    "cve": "CVE-2023-33538",
    "vendor": "TP-Link",
    "producto": "Multiple Routers",
    "descripcion": "TP-Link TL-WR940N V2/V4, TL-WR841N V8/V10, and TL-WR740N V1/V2 contain a command injection vulnerability via the component /userRpm/WlanNetworkRpm. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-06-16",
    "cve": "CVE-2025-43200",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple iOS, iPadOS, macOS, watchOS, and visionOS, contain an unspecified vulnerability when processing a maliciously crafted photo or video shared via an iCloud Link."
  },
  {
    "fecha": "2025-06-10",
    "cve": "CVE-2025-33053",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows contains an external control of file name or path vulnerability that could allow an attacker to execute code from a remote WebDAV location specified by the WorkingDirectory attribute of Internet Shortcut files."
  },
  {
    "fecha": "2025-06-10",
    "cve": "CVE-2025-24016",
    "vendor": "Wazuh",
    "producto": "Wazuh Server",
    "descripcion": "Wazuh contains a deserialization of untrusted data vulnerability that allows for remote code execution on Wazuh servers."
  },
  {
    "fecha": "2025-06-09",
    "cve": "CVE-2024-42009",
    "vendor": "Roundcube",
    "producto": "Webmail",
    "descripcion": "RoundCube Webmail contains a cross-site scripting vulnerability. This vulnerability could allow a remote attacker to steal and send emails of a victim via a crafted e-mail message that abuses a Desanitization issue in message_body() in program/actions/mail/show.php."
  },
  {
    "fecha": "2025-06-09",
    "cve": "CVE-2025-32433",
    "vendor": "Erlang",
    "producto": "Erlang/OTP",
    "descripcion": "Erlang Erlang/OTP SSH server contains a missing authentication for critical function vulnerability. This could allow an attacker to execute arbitrary commands without valid credentials, potentially leading to unauthenticated remote code execution (RCE). By exploiting a flaw in how SSH protocol messages are handled, a malicious actor could gain unauthorized access to affected systems. This vulnerability could affect various products that implement Erlang/OTP SSH server, including—but not limited to—Cisco, NetApp, and SUSE."
  },
  {
    "fecha": "2025-06-05",
    "cve": "CVE-2025-5419",
    "vendor": "Google",
    "producto": "Chromium V8",
    "descripcion": "Google Chromium V8 contains an out-of-bounds read and write vulnerability that could allow a remote attacker to potentially exploit heap corruption via a crafted HTML page. This vulnerability could affect multiple web browsers that utilize Chromium, including, but not limited to, Google Chrome, Microsoft Edge, and Opera."
  },
  {
    "fecha": "2025-06-03",
    "cve": "CVE-2025-21479",
    "vendor": "Qualcomm",
    "producto": "Multiple Chipsets",
    "descripcion": "Multiple Qualcomm chipsets contain an incorrect authorization vulnerability. This vulnerability allows for memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-06-03",
    "cve": "CVE-2025-21480",
    "vendor": "Qualcomm",
    "producto": "Multiple Chipsets",
    "descripcion": "Multiple Qualcomm chipsets contain an incorrect authorization vulnerability. This vulnerability allows for memory corruption due to unauthorized command execution in GPU micronode while executing specific sequence of commands."
  },
  {
    "fecha": "2025-06-03",
    "cve": "CVE-2025-27038",
    "vendor": "Qualcomm",
    "producto": "Multiple Chipsets",
    "descripcion": "Multiple Qualcomm chipsets contain a use-after-free vulnerability. This vulnerability allows for memory corruption while rendering graphics using Adreno GPU drivers in Chrome."
  },
  {
    "fecha": "2025-06-02",
    "cve": "CVE-2021-32030",
    "vendor": "ASUS",
    "producto": "Routers",
    "descripcion": "ASUS Lyra Mini and ASUS GT-AC2900 devices contain an improper authentication vulnerability that allows an attacker to gain unauthorized access to the administrative interface. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-06-02",
    "cve": "CVE-2025-3935",
    "vendor": "ConnectWise",
    "producto": "ScreenConnect",
    "descripcion": "ConnectWise ScreenConnect contains an improper authentication vulnerability. This vulnerability could allow a ViewState code injection attack, which could allow remote code execution if machine keys are compromised."
  },
  {
    "fecha": "2025-06-02",
    "cve": "CVE-2025-35939",
    "vendor": "Craft CMS",
    "producto": "Craft CMS",
    "descripcion": "Craft CMS contains an external control of assumed-immutable web parameter vulnerability. This vulnerability could allow an unauthenticated client to introduce arbitrary values, such as PHP code, to a known local file location on the server. This vulnerability could be chained with CVE-2024-58136 as represented by CVE-2025-32432."
  },
  {
    "fecha": "2025-06-02",
    "cve": "CVE-2024-56145",
    "vendor": "Craft CMS",
    "producto": "Craft CMS",
    "descripcion": "Craft CMS contains a code injection vulnerability. Users with affected versions are vulnerable to remote code execution if their php.ini configuration has `register_argc_argv` enabled."
  },
  {
    "fecha": "2025-06-02",
    "cve": "CVE-2023-39780",
    "vendor": "ASUS",
    "producto": "RT-AX55 Routers",
    "descripcion": "ASUS RT-AX55 devices contain an OS command injection vulnerability that could allow a remote, authenticated attacker to execute arbitrary commands. As represented by CVE-2023-41346."
  },
  {
    "fecha": "2025-05-22",
    "cve": "CVE-2025-4632",
    "vendor": "Samsung",
    "producto": "MagicINFO 9 Server",
    "descripcion": "Samsung MagicINFO 9 Server contains a path traversal vulnerability that allows an attacker to write arbitrary file as system authority."
  },
  {
    "fecha": "2025-05-19",
    "cve": "CVE-2023-38950",
    "vendor": "ZKTeco",
    "producto": "BioTime",
    "descripcion": "ZKTeco BioTime contains a path traversal vulnerability in the iclock API that allows an unauthenticated attacker to read arbitrary files via supplying a crafted payload."
  },
  {
    "fecha": "2025-05-19",
    "cve": "CVE-2024-27443",
    "vendor": "Synacor",
    "producto": "Zimbra Collaboration Suite (ZCS)",
    "descripcion": "Zimbra Collaboration contains a cross-site scripting (XSS) vulnerability in the CalendarInvite feature of the Zimbra webmail classic user interface. An attacker can exploit this vulnerability via an email message containing a crafted calendar header, leading to the execution of arbitrary JavaScript code."
  },
  {
    "fecha": "2025-05-19",
    "cve": "CVE-2025-27920",
    "vendor": "Srimax",
    "producto": "Output Messenger",
    "descripcion": "Srimax Output Messenger contains a directory traversal vulnerability that allows an attacker to access sensitive files outside the intended directory, potentially leading to configuration leakage or arbitrary file access."
  },
  {
    "fecha": "2025-05-19",
    "cve": "CVE-2024-11182",
    "vendor": "MDaemon",
    "producto": "Email Server",
    "descripcion": "MDaemon Email Server contains a cross-site scripting (XSS) vulnerability that allows a remote attacker to load arbitrary JavaScript code via an HTML e-mail message."
  },
  {
    "fecha": "2025-05-19",
    "cve": "CVE-2025-4428",
    "vendor": "Ivanti",
    "producto": "Endpoint Manager Mobile (EPMM)",
    "descripcion": "Ivanti Endpoint Manager Mobile (EPMM) contains a code injection vulnerability in the API component that allows an authenticated attacker to remotely execute arbitrary code via crafted API requests. This vulnerability results from an insecure implementation of the Hibernate Validator open-source library, as represented by CVE-2025-35036."
  },
  {
    "fecha": "2025-05-19",
    "cve": "CVE-2025-4427",
    "vendor": "Ivanti",
    "producto": "Endpoint Manager Mobile (EPMM)",
    "descripcion": "Ivanti Endpoint Manager Mobile (EPMM) contains an authentication bypass vulnerability in the API component that allows an attacker to access protected resources without proper credentials via crafted API requests. This vulnerability results from an insecure implementation of the Spring Framework open-source library."
  },
  {
    "fecha": "2025-05-15",
    "cve": "CVE-2025-42999",
    "vendor": "SAP",
    "producto": "NetWeaver",
    "descripcion": "SAP NetWeaver Visual Composer Metadata Uploader contains a deserialization vulnerability that allows a privileged attacker to compromise the confidentiality, integrity, and availability of the host system by deserializing untrusted or malicious content."
  },
  {
    "fecha": "2025-05-15",
    "cve": "CVE-2024-12987",
    "vendor": "DrayTek",
    "producto": "Vigor Routers",
    "descripcion": "DrayTek Vigor2960, Vigor300B, and Vigor3900 routers contain an OS command injection vulnerability due to an unknown function of the file /cgi-bin/mainfunction.cgi/apmcfgupload of the component web management interface."
  },
  {
    "fecha": "2025-05-14",
    "cve": "CVE-2025-32756",
    "vendor": "Fortinet",
    "producto": "Multiple Products",
    "descripcion": "Fortinet FortiFone, FortiVoice, FortiNDR and FortiMail contain a stack-based overflow vulnerability that may allow a remote unauthenticated attacker to execute arbitrary code or commands via crafted HTTP requests."
  },
  {
    "fecha": "2025-05-13",
    "cve": "CVE-2025-32709",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Ancillary Function Driver for WinSock contains a use-after-free vulnerability that allows an authorized attacker to escalate privileges to administrator."
  },
  {
    "fecha": "2025-05-13",
    "cve": "CVE-2025-30397",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Scripting Engine contains a type confusion vulnerability that allows an unauthorized attacker to execute code over a network via a specially crafted URL."
  },
  {
    "fecha": "2025-05-13",
    "cve": "CVE-2025-32706",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Common Log File System (CLFS) Driver contains a heap-based buffer overflow vulnerability that allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-05-13",
    "cve": "CVE-2025-32701",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Common Log File System (CLFS) Driver contains a use-after-free vulnerability that allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-05-13",
    "cve": "CVE-2025-30400",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows DWM Core Library contains a use-after-free vulnerability that allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-05-12",
    "cve": "CVE-2025-47729",
    "vendor": "TeleMessage",
    "producto": "TM SGNL",
    "descripcion": "TeleMessage TM SGNL contains a hidden functionality vulnerability in which the archiving backend holds cleartext copies of messages from TM SGNL application users."
  },
  {
    "fecha": "2025-05-07",
    "cve": "CVE-2024-11120",
    "vendor": "GeoVision",
    "producto": "Multiple Devices",
    "descripcion": "Multiple GeoVision devices contain an OS command injection vulnerability that allows a remote, unauthenticated attacker to inject and execute arbitrary system commands. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-05-07",
    "cve": "CVE-2024-6047",
    "vendor": "GeoVision",
    "producto": "Multiple Devices",
    "descripcion": "Multiple GeoVision devices contain an OS command injection vulnerability that allows a remote, unauthenticated attacker to inject and execute arbitrary system commands. The impacted products could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-05-06",
    "cve": "CVE-2025-27363",
    "vendor": "FreeType",
    "producto": "FreeType",
    "descripcion": "FreeType contains an out-of-bounds write vulnerability when attempting to parse font subglyph structures related to TrueType GX and variable font files that may allow for arbitrary code execution."
  },
  {
    "fecha": "2025-05-05",
    "cve": "CVE-2025-3248",
    "vendor": "Langflow",
    "producto": "Langflow",
    "descripcion": "Langflow contains a missing authentication vulnerability in the /api/v1/validate/code endpoint that allows a remote, unauthenticated attacker to execute arbitrary code via crafted HTTP requests."
  },
  {
    "fecha": "2025-05-02",
    "cve": "CVE-2025-34028",
    "vendor": "Commvault",
    "producto": "Command Center",
    "descripcion": "Commvault Command Center contains a path traversal vulnerability that allows a remote, unauthenticated attacker to execute arbitrary code."
  },
  {
    "fecha": "2025-05-02",
    "cve": "CVE-2024-58136",
    "vendor": "Yiiframework",
    "producto": "Yii",
    "descripcion": "Yii Framework contains an improper protection of alternate path vulnerability that may allow a remote attacker to execute arbitrary code. This vulnerability could affect other products that implement Yii, including—but not limited to—Craft CMS, as represented by CVE-2025-32432."
  },
  {
    "fecha": "2025-05-01",
    "cve": "CVE-2024-38475",
    "vendor": "Apache",
    "producto": "HTTP Server",
    "descripcion": "Apache HTTP Server contains an improper escaping of output vulnerability in mod_rewrite that allows an attacker to map URLs to filesystem locations that are permitted to be served by the server but are not intentionally/directly reachable by any URL, resulting in code execution or source code disclosure."
  },
  {
    "fecha": "2025-05-01",
    "cve": "CVE-2023-44221",
    "vendor": "SonicWall",
    "producto": "SMA100 Appliances",
    "descripcion": "SonicWall SMA100 appliances contain an OS command injection vulnerability in the SSL-VPN management interface that allows a remote, authenticated attacker with administrative privilege to inject arbitrary commands as a 'nobody' user."
  },
  {
    "fecha": "2025-04-29",
    "cve": "CVE-2025-31324",
    "vendor": "SAP",
    "producto": "NetWeaver",
    "descripcion": "SAP NetWeaver Visual Composer Metadata Uploader contains an unrestricted file upload vulnerability that allows an unauthenticated agent to upload potentially malicious executable binaries."
  },
  {
    "fecha": "2025-04-28",
    "cve": "CVE-2025-1976",
    "vendor": "Broadcom",
    "producto": "Brocade Fabric OS",
    "descripcion": "Broadcom Brocade Fabric OS contains a code injection vulnerability that allows a local user with administrative privileges to execute arbitrary code with full root privileges."
  },
  {
    "fecha": "2025-04-28",
    "cve": "CVE-2025-42599",
    "vendor": "Qualitia",
    "producto": "Active! Mail",
    "descripcion": "Qualitia Active! Mail contains a stack-based buffer overflow vulnerability that allows a remote, unauthenticated attacker to execute arbitrary or trigger a denial-of-service via a specially crafted request."
  },
  {
    "fecha": "2025-04-28",
    "cve": "CVE-2025-3928",
    "vendor": "Commvault",
    "producto": "Web Server",
    "descripcion": "Commvault Web Server contains an unspecified vulnerability that allows a remote, authenticated attacker to create and execute webshells."
  },
  {
    "fecha": "2025-04-17",
    "cve": "CVE-2025-24054",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows NTLM contains an external control of file name or path vulnerability that allows an unauthorized attacker to perform spoofing over a network."
  },
  {
    "fecha": "2025-04-17",
    "cve": "CVE-2025-31201",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple iOS, iPadOS, macOS, and other Apple products contain an arbitrary read and write vulnerability that allows an attacker to bypass Pointer Authentication."
  },
  {
    "fecha": "2025-04-17",
    "cve": "CVE-2025-31200",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple iOS, iPadOS, macOS, and other Apple products contain a memory corruption vulnerability that allows for code execution when processing an audio stream in a maliciously crafted media file."
  },
  {
    "fecha": "2025-04-16",
    "cve": "CVE-2021-20035",
    "vendor": "SonicWall",
    "producto": "SMA100 Appliances",
    "descripcion": "SonicWall SMA100 appliances contain an OS command injection vulnerability in the management interface that allows a remote authenticated attacker to inject arbitrary commands as a 'nobody' user, which could potentially lead to code execution."
  },
  {
    "fecha": "2025-04-09",
    "cve": "CVE-2024-53150",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux Kernel contains an out-of-bounds read vulnerability in the USB-audio driver that allows a local, privileged attacker to obtain potentially sensitive information."
  },
  {
    "fecha": "2025-04-09",
    "cve": "CVE-2024-53197",
    "vendor": "Linux",
    "producto": "Kernel",
    "descripcion": "Linux Kernel contains an out-of-bounds access vulnerability in the USB-audio driver that allows an attacker with physical access to the system to use a malicious USB device to potentially manipulate system memory, escalate privileges, or execute arbitrary code."
  },
  {
    "fecha": "2025-04-08",
    "cve": "CVE-2025-29824",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Common Log File System (CLFS) Driver contains a use-after-free vulnerability that allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-04-08",
    "cve": "CVE-2025-30406",
    "vendor": "Gladinet",
    "producto": "CentreStack",
    "descripcion": "Gladinet CentreStack and Triofox contains a use of hard-coded cryptographic key vulnerability in the way that the application manages keys used for ViewState integrity verification. Successful exploitation allows an attacker to forge ViewState payloads for server-side deserialization, allowing for remote code execution."
  },
  {
    "fecha": "2025-04-07",
    "cve": "CVE-2025-31161",
    "vendor": "CrushFTP",
    "producto": "CrushFTP",
    "descripcion": "CrushFTP contains an authentication bypass vulnerability in the HTTP authorization header that allows a remote unauthenticated attacker to authenticate to any known or guessable user account (e.g., crushadmin), potentially leading to a full compromise."
  },
  {
    "fecha": "2025-04-04",
    "cve": "CVE-2025-22457",
    "vendor": "Ivanti",
    "producto": "Connect Secure, Policy Secure, and ZTA Gateways",
    "descripcion": "Ivanti Connect Secure, Policy Secure, and ZTA Gateways contains a stack-based buffer overflow vulnerability that allows a remote unauthenticated attacker to achieve remote code execution."
  },
  {
    "fecha": "2025-04-01",
    "cve": "CVE-2025-24813",
    "vendor": "Apache",
    "producto": "Tomcat",
    "descripcion": "Apache Tomcat contains a path equivalence vulnerability that allows a remote attacker to execute code, disclose information, or inject malicious content via a partial PUT request."
  },
  {
    "fecha": "2025-03-31",
    "cve": "CVE-2024-20439",
    "vendor": "Cisco",
    "producto": "Smart Licensing Utility",
    "descripcion": "Cisco Smart Licensing Utility contains a static credential vulnerability that allows an unauthenticated, remote attacker to log in to an affected system and gain administrative credentials."
  },
  {
    "fecha": "2025-03-27",
    "cve": "CVE-2025-2783",
    "vendor": "Google",
    "producto": "Chromium Mojo",
    "descripcion": "Google Chromium Mojo on Windows contains a sandbox escape vulnerability caused by a logic error, which results from an incorrect handle being provided in unspecified circumstances. This vulnerability could affect multiple web browsers that utilize Chromium, including, but not limited to, Google Chrome, Microsoft Edge, and Opera."
  },
  {
    "fecha": "2025-03-26",
    "cve": "CVE-2019-9875",
    "vendor": "Sitecore",
    "producto": "CMS and Experience Platform (XP)",
    "descripcion": "Sitecore CMS and Experience Platform (XP) contain a deserialization vulnerability in the Sitecore.Security.AntiCSRF module that allows an authenticated attacker to execute arbitrary code by sending a serialized .NET object in the HTTP POST parameter __CSRFTOKEN."
  },
  {
    "fecha": "2025-03-26",
    "cve": "CVE-2019-9874",
    "vendor": "Sitecore",
    "producto": "CMS and Experience Platform (XP)",
    "descripcion": "Sitecore CMS and Experience Platform (XP) contain a deserialization vulnerability in the Sitecore.Security.AntiCSRF module that allows an unauthenticated attacker to execute arbitrary code by sending a serialized .NET object in the HTTP POST parameter __CSRFTOKEN."
  },
  {
    "fecha": "2025-03-24",
    "cve": "CVE-2025-30154",
    "vendor": "reviewdog",
    "producto": "action-setup GitHub Action",
    "descripcion": "reviewdog action-setup GitHub Action contains an embedded malicious code vulnerability that dumps exposed secrets to Github Actions Workflow Logs."
  },
  {
    "fecha": "2025-03-19",
    "cve": "CVE-2017-12637",
    "vendor": "SAP",
    "producto": "NetWeaver",
    "descripcion": "SAP NetWeaver Application Server (AS) Java contains a directory traversal vulnerability in scheduler/ui/js/ffffffffbca41eb4/UIUtilJavaScriptJS that allows a remote attacker to read arbitrary files via a .. (dot dot) in the query string."
  },
  {
    "fecha": "2025-03-19",
    "cve": "CVE-2024-48248",
    "vendor": "NAKIVO",
    "producto": "Backup and Replication",
    "descripcion": "NAKIVO Backup and Replication contains an absolute path traversal vulnerability that enables an attacker to read arbitrary files."
  },
  {
    "fecha": "2025-03-19",
    "cve": "CVE-2025-1316",
    "vendor": "Edimax",
    "producto": "IC-7100 IP Camera",
    "descripcion": "Edimax IC-7100 IP camera contains an OS command injection vulnerability due to improper input sanitization that allows an attacker to achieve remote code execution via specially crafted requests. The impacted product could be end-of-life (EoL) and/or end-of-service (EoS). Users should discontinue product utilization."
  },
  {
    "fecha": "2025-03-18",
    "cve": "CVE-2025-30066",
    "vendor": "tj-actions",
    "producto": "changed-files GitHub Action",
    "descripcion": "tj-actions/changed-files GitHub Action contains an embedded malicious code vulnerability that allows a remote attacker to discover secrets by reading Github Actions Workflow Logs. These secrets may include, but are not limited to, valid AWS access keys, GitHub personal access tokens (PATs), npm tokens, and private RSA keys."
  },
  {
    "fecha": "2025-03-18",
    "cve": "CVE-2025-24472",
    "vendor": "Fortinet",
    "producto": "FortiOS and FortiProxy",
    "descripcion": "Fortinet FortiOS and FortiProxy contain an authentication bypass vulnerability that allows a remote attacker to gain super-admin privileges via crafted CSF proxy requests."
  },
  {
    "fecha": "2025-03-13",
    "cve": "CVE-2025-21590",
    "vendor": "Juniper",
    "producto": "Junos OS",
    "descripcion": "Juniper Junos OS contains an improper isolation or compartmentalization vulnerability. This vulnerability could allows a local attacker with high privileges to inject arbitrary code."
  },
  {
    "fecha": "2025-03-13",
    "cve": "CVE-2025-24201",
    "vendor": "Apple",
    "producto": "Multiple Products",
    "descripcion": "Apple iOS, iPadOS, macOS, and other Apple products contain an out-of-bounds write vulnerability in WebKit that may allow maliciously crafted web content to break out of Web Content sandbox. This vulnerability could impact HTML parsers that use WebKit, including but not limited to Apple Safari and non-Apple products which rely on WebKit for HTML processing."
  },
  {
    "fecha": "2025-03-11",
    "cve": "CVE-2025-24993",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows New Technology File System (NTFS) contains a heap-based buffer overflow vulnerability that allows an unauthorized attacker to execute code locally."
  },
  {
    "fecha": "2025-03-11",
    "cve": "CVE-2025-24991",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows New Technology File System (NTFS) contains an out-of-bounds read vulnerability that allows an authorized attacker to disclose information locally."
  },
  {
    "fecha": "2025-03-11",
    "cve": "CVE-2025-24985",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Fast FAT File System Driver contains an integer overflow or wraparound vulnerability that allows an unauthorized attacker to execute code locally."
  },
  {
    "fecha": "2025-03-11",
    "cve": "CVE-2025-24984",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows New Technology File System (NTFS) contains an insertion of sensitive Information into log file vulnerability that allows an unauthorized attacker to disclose information with a physical attack. An attacker who successfully exploited this vulnerability could potentially read portions of heap memory."
  },
  {
    "fecha": "2025-03-11",
    "cve": "CVE-2025-24983",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Win32 Kernel Subsystem contains a use-after-free vulnerability that allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-03-11",
    "cve": "CVE-2025-26633",
    "vendor": "Microsoft",
    "producto": "Windows",
    "descripcion": "Microsoft Windows Management Console (MMC) contains an improper neutralization vulnerability that allows an unauthorized attacker to bypass a security feature locally."
  },
  {
    "fecha": "2025-03-10",
    "cve": "CVE-2024-13161",
    "vendor": "Ivanti",
    "producto": "Endpoint Manager (EPM)",
    "descripcion": "Ivanti Endpoint Manager (EPM) contains an absolute path traversal vulnerability that allows a remote unauthenticated att