[
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-13223",
    "descripcion": "Type Confusion in V8 in Google Chrome prior to 142.0.7444.175 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-64446",
    "descripcion": "A relative path traversal vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 through 7.0.11 may allow an attacker to execute administrative commands on the system via ..."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-12762",
    "descripcion": "pgAdmin versions up to 9.9 are affected by a Remote Code Execution (RCE) vulnerability that occurs when running in server mode and performing restores from PLAIN-format dump files. This issue allows attackers to inject and execute arbitrary commands on the server hosting ..."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-20298",
    "descripcion": "In Universal Forwarder for Windows versions below 9.4.2, 9.3.4, 9.2.6, and 9.1.9, a new installation of or an upgrade to an affected version can result in incorrect permissions assignment in the Universal Forwarder for Windows Installation directory (by default, C:\\Program ..."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-36250",
    "descripcion": "IBM AIX 7.2, and 7.3 and IBM VIOS 3.1, and 4.1 NIM server (formerly known as NIM master) service (nimesis) could allow a remote attacker to execute arbitrary commands due to improper process controls. This addresses additional attack vectors for a vulnerability that was ..."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-36251",
    "descripcion": "IBM AIX 7.2, and 7.3 and IBM VIOS 3.1, and 4.1 nimsh service SSL/TLS implementations could allow a remote attacker to execute arbitrary commands due to improper process controls. This addresses additional attack vectors for a vulnerability that was previously addressed in ..."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-36096",
    "descripcion": "IBM AIX 7.2, and 7.3 and IBM VIOS 3.1, and 4.1 stores NIM private keys used in NIM environments in an insecure way which is susceptible to unauthorized access by an attacker using man in the middle techniques."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-64459",
    "descripcion": "An issue was discovered in 5.1 before 5.1.14, 4.2 before 4.2.26, and 5.2 before 5.2.8. The methods `QuerySet.filter()`, `QuerySet.exclude()`, and `QuerySet.get()`, and the class `Q()`, are subject to SQL injection when using a suitably crafted dictionary, with dictionary ..."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-24071",
    "descripcion": "Exposure of sensitive information to an unauthorized actor in Windows File Explorer allows an unauthorized attacker to perform spoofing over a network."
  },
  {
    "fecha": "2025-11-18",
    "cve": "CVE-2025-24893",
    "descripcion": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Any guest can perform arbitrary remote code execution through a request to `SolrSearch`. This impacts the confidentiality, integrity and availability of the whole XWiki ..."
  }
]