[
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-32433",
    "descripcion": "Erlang/OTP is a set of libraries for the Erlang programming language. Prior to versions OTP-27.3.3, OTP-26.2.5.11, and OTP-25.3.2.20, a SSH server may allow an attacker to perform unauthenticated remote code execution (RCE). By exploiting a flaw in SSH protocol message handling, ..."
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-32355",
    "descripcion": "Currently trending CVE - Hype Score: 5"
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-59793",
    "descripcion": "Currently trending CVE - Hype Score: 5"
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2024-43468",
    "descripcion": "Microsoft Configuration Manager Remote Code Execution Vulnerability"
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-13176",
    "descripcion": "Planting a custom configuration file in ESET Inspect Connector allow load a malicious DLL."
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-68947",
    "descripcion": "NSecsoft 'NSecKrnl' is a Windows driver that allows a local, authenticated attacker to terminate processes owned by other users, including SYSTEM and Protected Processes by issuing crafted IOCTL requests to the driver."
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-40536",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to a security control bypass vulnerability that if exploited, could allow an unauthenticated attacker to gain access to certain restricted functionality."
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2026-20700",
    "descripcion": "A memory corruption issue was addressed with improved state management. This issue is fixed in watchOS 26.3, tvOS 26.3, macOS Tahoe 26.3, visionOS 26.3, iOS 26.3 and iPadOS 26.3. An attacker with memory write capability may be able to execute arbitrary code. Apple is aware of a ..."
  },
  {
    "fecha": "2026-02-17",
    "cve": "CVE-2025-15556",
    "descripcion": "Notepad++ versions prior to 8.8.9, when using the WinGUp updater, contain an update integrity verification vulnerability where downloaded update metadata and installers are not cryptographically verified. An attacker able to intercept or redirect update traffic can cause the ..."
  }
]