[
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-66032",
    "descripcion": "Claude Code is an agentic coding tool. Prior to 1.0.93, Due to errors in parsing shell commands related to $IFS and short CLI flags, it was possible to bypass the Claude Code read-only validation and trigger arbitrary code execution. Reliably exploiting this requires the ability ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-68668",
    "descripcion": "n8n is an open source workflow automation platform. From version 1.0.0 to before 2.0.0, a sandbox bypass vulnerability exists in the Python Code Node that uses Pyodide. An authenticated user with permission to create or modify workflows can exploit this vulnerability to execute ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-68493",
    "descripcion": "Missing XML Validation vulnerability in Apache Struts, Apache Struts. This issue affects Apache Struts: from 2.0.0 before 2.2.1; Apache Struts: from 2.2.1 through 6.1.0. Users are recommended to upgrade to version 6.1.1, which fixes the issue."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-8110",
    "descripcion": "Improper Symbolic link handling in the PutContents API in Gogs allows Local Execution of Code."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-38352",
    "descripcion": "In the Linux kernel, the following vulnerability has been resolved: posix-cpu-timers: fix race between handle_posix_cpu_timers() and posix_cpu_timer_del() If an exiting non-autoreaping task has already passed exit_notify() and calls handle_posix_cpu_timers() from IRQ, it can ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-46285",
    "descripcion": "An integer overflow was addressed by adopting 64-bit timestamps. This issue is fixed in watchOS 26.2, macOS Sonoma 14.8.3, iOS 18.7.3 and iPadOS 18.7.3, iOS 26.2 and iPadOS 26.2, macOS Tahoe 26.2, macOS Sequoia 15.7.3, visionOS 26.2, tvOS 26.2. An app may be able to gain root ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-12420",
    "descripcion": "A vulnerability has been identified in the ServiceNow AI Platform that could enable an unauthenticated user to impersonate another user and perform the operations that the impersonated user is entitled to perform. ServiceNow has addressed this vulnerability by deploying a ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-68472",
    "descripcion": "MindsDB is a platform for building artificial intelligence from enterprise data. Prior to version 25.11.1, an unauthenticated path traversal in the file upload API lets any caller read arbitrary files from the server filesystem and move them into MindsDB’s storage, exposing ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2025-65018",
    "descripcion": "LIBPNG is a reference library for use in applications that read, create, and manipulate PNG (Portable Network Graphics) raster image files. From version 1.6.0 to before 1.6.51, there is a heap buffer overflow vulnerability in the libpng simplified API function ..."
  },
  {
    "fecha": "2026-01-14",
    "cve": "CVE-2026-22695",
    "descripcion": "LIBPNG is a reference library for use in applications that read, create, and manipulate PNG (Portable Network Graphics) raster image files. From 1.6.51 to 1.6.53, there is a heap buffer over-read in the libpng simplified API function png_image_finish_read when processing ..."
  }
]