[
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-14847",
    "descripcion": "Mismatched length fields in Zlib compressed protocol headers may allow a read of uninitialized heap memory by an unauthenticated client. This issue affects all MongoDB Server v7.0 prior to 7.0.28 versions, MongoDB Server v8.0 versions prior to 8.0.17, MongoDB Server v8.2 ..."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-37164",
    "descripcion": "A remote code execution issue exists in HPE OneView."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-14282",
    "descripcion": "Currently trending CVE - Hype Score: 12"
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2024-10441",
    "descripcion": "Improper encoding or escaping of output vulnerability in the system plugin daemon in Synology BeeStation OS (BSM) before 1.1-65374 and Synology DiskStation Manager (DSM) before 7.2-64570-4, 7.2.1-69057-6 and 7.2.2-72806-1 allows remote attackers to execute arbitrary code via ..."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-68664",
    "descripcion": "LangChain is a framework for building agents and LLM-powered applications. Prior to versions 0.3.81 and 1.2.5, a serialization injection vulnerability exists in LangChain's dumps() and dumpd() functions. The functions do not escape dictionaries with 'lc' keys when serializing ..."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-62215",
    "descripcion": "Concurrent execution using shared resource with improper synchronization ('race condition') in Windows Kernel allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-54322",
    "descripcion": "Xspeeder SXZOS through 2025-12-26 allows root remote code execution via base64-encoded Python code in the chkid parameter to vLogin.py. The title and oIP parameters are also used."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-68613",
    "descripcion": "n8n is an open source workflow automation platform. Versions starting with 0.211.0 and prior to 1.120.4, 1.121.1, and 1.122.0 contain a critical Remote Code Execution (RCE) vulnerability in their workflow expression evaluation system. Under certain conditions, expressions ..."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-65964",
    "descripcion": "n8n is an open source workflow automation platform. Versions 0.123.1 through 1.119.1 do not have adequate protections to prevent RCE through the project's pre-commit hooks. The Add Config operation allows workflows to set arbitrary Git configuration values, including ..."
  },
  {
    "fecha": "2025-12-28",
    "cve": "CVE-2025-62726",
    "descripcion": "n8n is an open source workflow automation platform. Prior to 1.113.0, a remote code execution vulnerability exists in the Git Node component available in both Cloud and Self-Hosted versions of n8n. When a malicious actor clones a remote repository containing a pre-commit hook, ..."
  }
]