[
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-62725",
    "descripcion": "Docker Compose trusts the path information embedded in remote OCI compose artifacts. When a layer includes the annotations com.docker.compose.extends or com.docker.compose.envfile, Compose joins the attacker‑supplied value from com.docker.compose.file/com.docker.compose.envfile ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-61481",
    "descripcion": "An issue in MikroTik RouterOS v.7.14.2 and SwitchOS v.2.18 allows a remote attacker to execute arbitrary code via the HTTP- only WebFig management component"
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-55315",
    "descripcion": "Inconsistent interpretation of http requests ('http request/response smuggling') in ASP.NET Core allows an authorized attacker to bypass a security feature over a network."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-58726",
    "descripcion": "Improper access control in Windows SMB Server allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-49844",
    "descripcion": "Redis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-55754",
    "descripcion": "Improper Neutralization of Escape, Meta, or Control Sequences vulnerability in Apache Tomcat. Tomcat did not escape ANSI escape sequences in log messages. If Tomcat was running in a console on a Windows operating system, and the console supported ANSI escape sequences, it was ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-55752",
    "descripcion": "Relative Path Traversal vulnerability in Apache Tomcat. The fix for bug 60013 introduced a regression where the rewritten URL was normalized before it was decoded. This introduced the possibility that, for rewrite rules that rewrite query parameters to the ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-61795",
    "descripcion": "Improper Resource Shutdown or Release vulnerability in Apache Tomcat. If an error occurred (including exceeding limits) during the processing of a multipart upload, temporary copies of the uploaded parts written to disc were not cleaned up immediately but left for the garbage ..."
  },
  {
    "fecha": "2025-10-31",
    "cve": "CVE-2025-2783",
    "descripcion": "Incorrect handle provided in unspecified circumstances in Mojo in Google Chrome on Windows prior to 134.0.6998.177 allowed a remote attacker to perform a sandbox escape via a malicious file. (Chromium security severity: High)"
  }
]