[
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-59718",
    "descripcion": "A improper verification of cryptographic signature vulnerability in Fortinet FortiOS 7.6.0 through 7.6.3, FortiOS 7.4.0 through 7.4.8, FortiOS 7.2.0 through 7.2.11, FortiOS 7.0.0 through 7.0.17, FortiProxy 7.6.0 through 7.6.3, FortiProxy 7.4.0 through 7.4.10, FortiProxy 7.2.0 ..."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-59719",
    "descripcion": "An improper verification of cryptographic signature vulnerability in Fortinet FortiWeb 8.0.0, FortiWeb 7.6.0 through 7.6.4, FortiWeb 7.4.0 through 7.4.9 may allow an unauthenticated attacker to bypass the FortiCloud SSO login authentication via a crafted SAML response message."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-20393",
    "descripcion": "Cisco is aware of a potential vulnerability. Cisco is currently investigating and will update these details as appropriate as more information becomes available."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-64669",
    "descripcion": "Improper access control in Windows Admin Center allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-61678",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. In versions prior to 16.0.92 for FreePBX 16 and versions prior to 17.0.6 for FreePBX 17, the Endpoint Manager module contains an authenticated arbitrary file upload vulnerability affecting ..."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-66039",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. Versions are vulnerable to authentication bypass when the authentication type is set to \"webserver.\" When providing an Authorization header with an arbitrary value, a session is associated ..."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-61675",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. In versions prior to 16.0.92 for FreePBX 16 and versions prior to 17.0.6 for FreePBX 17, the Endpoint Manager module contains authenticated SQL injection vulnerabilities affecting multiple ..."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-13780",
    "descripcion": "pgAdmin versions up to 9.10 are affected by a Remote Code Execution (RCE) vulnerability that occurs when running in server mode and performing restores from PLAIN-format dump files. This issue allows attackers to inject and execute arbitrary commands on the server hosting ..."
  },
  {
    "fecha": "2025-12-18",
    "cve": "CVE-2025-59230",
    "descripcion": "Improper access control in Windows Remote Access Connection Manager allows an authorized attacker to elevate privileges locally."
  }
]