[
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-59718",
    "descripcion": "A improper verification of cryptographic signature vulnerability in Fortinet FortiOS 7.6.0 through 7.6.3, FortiOS 7.4.0 through 7.4.8, FortiOS 7.2.0 through 7.2.11, FortiOS 7.0.0 through 7.0.17, FortiProxy 7.6.0 through 7.6.3, FortiProxy 7.4.0 through 7.4.10, FortiProxy 7.2.0 ..."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-34164",
    "descripcion": "A heap-based buffer overflow vulnerability in NetSupport Manager 14.x versions prior to 14.12.0000 allows a remote, unauthenticated attacker to cause a denial of service (DoS) or potentially result in arbitrary code execution."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-34165",
    "descripcion": "A stack-based buffer overflow vulnerability in NetSupport Manager 14.x versions prior to 14.12.0000 allows a remote, unauthenticated attacker to cause a denial of service (DoS) or potentially leak a limited amount of memory."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-33073",
    "descripcion": "Improper access control in Windows SMB allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-54918",
    "descripcion": "Improper authentication in Windows NTLM allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-13878",
    "descripcion": "Malformed BRID/HHIT records can cause `named` to terminate unexpectedly. This issue affects BIND 9 versions 9.18.40 through 9.18.43, 9.20.13 through 9.20.17, 9.21.12 through 9.21.16, 9.18.40-S1 through 9.18.43-S1, and 9.20.13-S1 through 9.20.17-S1."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-2294",
    "descripcion": "The Kubio AI Page Builder plugin for WordPress is vulnerable to Local File Inclusion in all versions up to, and including, 2.5.1 via thekubio_hybrid_theme_load_template function. This makes it possible for unauthenticated attackers to include and execute arbitrary files on the ..."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2025-54068",
    "descripcion": "Livewire is a full-stack framework for Laravel. In Livewire v3 up to and including v3.6.3, a vulnerability allows unauthenticated attackers to achieve remote command execution in specific scenarios. The issue stems from how certain component property updates are hydrated. This ..."
  },
  {
    "fecha": "2026-01-24",
    "cve": "CVE-2024-23265",
    "descripcion": "A memory corruption vulnerability was addressed with improved locking. This issue is fixed in macOS Monterey 12.7.4, macOS Ventura 13.6.5, macOS Sonoma 14.4, visionOS 1.1, iOS 17.4 and iPadOS 17.4, watchOS 10.4, iOS 16.7.6 and iPadOS 16.7.6, tvOS 17.4. An app may be able to ..."
  }
]