[
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-59536",
    "descripcion": "Claude Code is an agentic coding tool. Versions before 1.0.111 were vulnerable to Code Injection due to a bug in the startup trust dialog implementation. Claude Code could be tricked to execute code contained in a project before the user accepted the startup trust dialog. ..."
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2026-21852",
    "descripcion": "Claude Code is an agentic coding tool. Prior to version 2.0.65, vulnerability in Claude Code's project-load flow allowed malicious repositories to exfiltrate data including Anthropic API keys before users confirmed trust. An attacker-controlled repository could include a ..."
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-5959",
    "descripcion": "Type Confusion in V8 in Google Chrome prior to 137.0.7151.103 allowed a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page. (Chromium security severity: High)"
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-64328",
    "descripcion": "FreePBX Endpoint Manager is a module for managing telephony endpoints in FreePBX systems. In versions 17.0.2.36 and above before 17.0.3, the filestore module within the Administrative interface is vulnerable to a post-authentication command injection by an authenticated known ..."
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-71210",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-15060",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-71211",
    "descripcion": "Currently trending CVE - Hype Score: 5"
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2025-61882",
    "descripcion": "Vulnerability in the Oracle Concurrent Processing product of Oracle E-Business Suite (component: BI Publisher Integration). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to ..."
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2026-24423",
    "descripcion": "SmarterTools SmarterMail versions prior to build 9511 contain an unauthenticated remote code execution vulnerability in the ConnectToHub API method. The attacker could point the SmarterMail to the malicious HTTP server, which serves the malicious OS command. This command will be ..."
  },
  {
    "fecha": "2026-02-28",
    "cve": "CVE-2026-20941",
    "descripcion": "Improper link resolution before file access ('link following') in Host Process for Windows Tasks allows an authorized attacker to elevate privileges locally."
  }
]