[
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-13176",
    "descripcion": "Planting a custom configuration file in ESET Inspect Connector allow load a malicious DLL."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-32433",
    "descripcion": "Erlang/OTP is a set of libraries for the Erlang programming language. Prior to versions OTP-27.3.3, OTP-26.2.5.11, and OTP-25.3.2.20, a SSH server may allow an attacker to perform unauthenticated remote code execution (RCE). By exploiting a flaw in SSH protocol message handling, ..."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-32355",
    "descripcion": "Rocket TRUfusion Enterprise through 7.10.4.0 uses a reverse proxy to handle incoming connections. However, the proxy is misconfigured in a way that allows specifying absolute URLs in the HTTP request line, causing the proxy to load the given resource."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-59793",
    "descripcion": "Rocket TRUfusion Enterprise through 7.10.5 exposes the endpoint at /axis2/services/WsPortalV6UpDwAxis2Impl to authenticated users to be able to upload files. However, the application doesn't properly sanitize the jobDirectory parameter, which allows path traversal sequences to ..."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2024-7694",
    "descripcion": "ThreatSonar Anti-Ransomware from TeamT5 does not properly validate the content of uploaded files. Remote attackers with administrator privileges on the product platform can upload malicious files, which can be used to execute arbitrary system command on the server."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2020-7796",
    "descripcion": "Zimbra Collaboration Suite (ZCS) before 8.8.15 Patch 7 allows SSRF when WebEx zimlet is installed and zimlet JSP is enabled."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-68947",
    "descripcion": "NSecsoft 'NSecKrnl' is a Windows driver that allows a local, authenticated attacker to terminate processes owned by other users, including SYSTEM and Protected Processes by issuing crafted IOCTL requests to the driver."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2025-31125",
    "descripcion": "Vite is a frontend tooling framework for javascript. Vite exposes content of non-allowed files using ?inline&import or ?raw?import. Only apps explicitly exposing the Vite dev server to the network (using --host or server.host config option) are affected. This vulnerability is ..."
  },
  {
    "fecha": "2026-02-18",
    "cve": "CVE-2024-43468",
    "descripcion": "Microsoft Configuration Manager Remote Code Execution Vulnerability"
  }
]