[
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-30208",
    "descripcion": "Vite, a provider of frontend development tooling, has a vulnerability in versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10. `@fs` denies access to files outside of Vite serving allow list. Adding `?raw??` or `?import&raw??` to the URL bypasses this limitation and ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-15566",
    "descripcion": "A security issue was discovered in ingress-nginx where the `nginx.ingress.kubernetes.io/auth-proxy-set-headers` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-3052",
    "descripcion": "An arbitrary write vulnerability in Microsoft signed UEFI firmware allows for code execution of untrusted software. This allows an attacker to control its value, leading to arbitrary memory writes, including modification of critical firmware settings stored in NVRAM. Exploiting ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-20393",
    "descripcion": "A vulnerability in the Spam Quarantine feature of Cisco AsyncOS Software for Cisco Secure Email Gateway and Cisco Secure Email and Web Manager could allow an unauthenticated, remote attacker to execute arbitrary system commands on an affected device with root privileges. This ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-59473",
    "descripcion": "SQL Injection vulnerability in the Structure for Admin authenticated user"
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2024-5242",
    "descripcion": "TP-Link Omada ER605 Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-11953",
    "descripcion": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2026-24423",
    "descripcion": "SmarterTools SmarterMail versions prior to build 9511 contain an unauthenticated remote code execution vulnerability in the ConnectToHub API method. The attacker could point the SmarterMail to the malicious HTTP server, which serves the malicious OS command. This command will be ..."
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-6978",
    "descripcion": "Diagnostics command injection vulnerability"
  },
  {
    "fecha": "2026-02-08",
    "cve": "CVE-2025-68947",
    "descripcion": "NSecsoft 'NSecKrnl' is a Windows driver that allows a local, authenticated attacker to terminate processes owned by other users, including SYSTEM and Protected Processes by issuing crafted IOCTL requests to the driver."
  }
]