[
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-20352",
    "descripcion": "A vulnerability in the Simple Network Management Protocol (SNMP) subsystem of Cisco IOS Software and Cisco IOS XE Software could allow the following: An authenticated, remote attacker with low privileges could cause a denial of service (DoS) condition on an affected device ..."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-9252",
    "descripcion": "A weakness has been identified in Linksys RE6250, RE6300, RE6350, RE6500, RE7000 and RE9000 1.0.013.001/1.0.04.001/1.0.04.002/1.1.05.003/1.2.07.001. Affected by this vulnerability is the function DisablePasswordAlertRedirect of the file /goform/DisablePasswordAlertRedirect. ..."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-10230",
    "descripcion": "Currently trending CVE - Hype Score: 29"
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-55682",
    "descripcion": "Improper enforcement of behavioral workflow in Windows BitLocker allows an unauthorized attacker to bypass a security feature with a physical attack."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-55330",
    "descripcion": "Improper enforcement of behavioral workflow in Windows BitLocker allows an unauthorized attacker to bypass a security feature with a physical attack."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-55338",
    "descripcion": "Missing Ability to Patch ROM Code in Windows BitLocker allows an unauthorized attacker to bypass a security feature with a physical attack."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-48983",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-48984",
    "descripcion": "Currently trending CVE - Hype Score: 6"
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-2611",
    "descripcion": "The ICTBroadcast application unsafely passes session cookie data to shell processing, allowing an attacker to inject shell commands into a session cookie that get executed on the server. This results in unauthenticated remote code execution in the session handling. Versions ..."
  },
  {
    "fecha": "2025-10-17",
    "cve": "CVE-2025-55333",
    "descripcion": "Incomplete comparison with missing factors in Windows BitLocker allows an unauthorized attacker to bypass a security feature with a physical attack."
  }
]