[
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-68121",
    "descripcion": "Currently trending CVE - Hype Score: 27"
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-22225",
    "descripcion": "VMware ESXi contains an arbitrary write vulnerability. A malicious actor with privileges within the VMX process may trigger an arbitrary kernel write leading to an escape of the sandbox."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-40551",
    "descripcion": "SolarWinds Web Help Desk was found to be susceptible to an untrusted data deserialization vulnerability that could lead to remote code execution, which would allow an attacker to run commands on the host machine. This could be exploited without authentication."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-68613",
    "descripcion": "n8n is an open source workflow automation platform. Versions starting with 0.211.0 and prior to 1.120.4, 1.121.1, and 1.122.0 contain a critical Remote Code Execution (RCE) vulnerability in their workflow expression evaluation system. Under certain conditions, expressions ..."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2026-25049",
    "descripcion": "n8n is an open source workflow automation platform. Prior to versions 1.123.17 and 2.5.2, an authenticated user with permission to create or modify workflows could abuse crafted expressions in workflow parameters to trigger unintended system command execution on the host running ..."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-46285",
    "descripcion": "An integer overflow was addressed by adopting 64-bit timestamps. This issue is fixed in watchOS 26.2, macOS Sonoma 14.8.3, iOS 18.7.3 and iPadOS 18.7.3, iOS 26.2 and iPadOS 26.2, macOS Tahoe 26.2, macOS Sequoia 15.7.3, visionOS 26.2, tvOS 26.2. An app may be able to gain root ..."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-61732",
    "descripcion": "A discrepancy between how Go and C/C++ comments were parsed allowed for code smuggling into the resulting cgo binary."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2026-02-05",
    "cve": "CVE-2025-11953",
    "descripcion": "The Metro Development Server, which is opened by the React Native Community CLI, binds to external interfaces by default. The server exposes an endpoint that is vulnerable to OS command injection. This allows unauthenticated network attackers to send a POST request to the server ..."
  }
]