[
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2024-21413",
    "descripcion": "Microsoft Outlook Remote Code Execution Vulnerability"
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2024-50629",
    "descripcion": "Improper encoding or escaping of output vulnerability in the webapi component in Synology BeeStation OS (BSM) before 1.1-65374 and Synology DiskStation Manager (DSM) before 7.1.1-42962-7, 7.2-64570-4, 7.2.1-69057-6 and 7.2.2-72806-1 allow remote attackers to read limited files ..."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2022-27510",
    "descripcion": "Unauthorized access to Gateway user capabilities"
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2024-40766",
    "descripcion": "An improper access control vulnerability has been identified in the SonicWall SonicOS management access, potentially leading to unauthorized resource access and in specific conditions, causing the firewall to crash. This issue affects SonicWall Firewall Gen 5 and Gen 6 devices, ..."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2021-27877",
    "descripcion": "An issue was discovered in Veritas Backup Exec before 21.2. It supports multiple authentication schemes: SHA authentication is one of these. This authentication scheme is no longer used in current versions of the product, but hadn't yet been disabled. An attacker could remotely ..."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2021-27876",
    "descripcion": "An issue was discovered in Veritas Backup Exec before 21.2. The communication between a client and an Agent requires successful authentication, which is typically completed over a secure TLS communication. However, due to a vulnerability in the SHA Authentication scheme, an ..."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2025-13315",
    "descripcion": "Twonky Server 8.5.2 on Linux and Windows is vulnerable to an access control flaw. An unauthenticated attacker can bypass web service API authentication controls to leak a log file and read the administrator's username and encrypted password."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2025-59789",
    "descripcion": "Uncontrolled recursion in the json2pb component in Apache bRPC (version < 1.15.0) on all platforms allows remote attackers to make the server crash via sending deep recursive json data. Root Cause: The bRPC json2pb component uses rapidjson to parse json data from the network. ..."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2025-11411",
    "descripcion": "NLnet Labs Unbound up to and including version 1.24.2 is vulnerable to possible domain hijack attacks. Promiscuous NS RRSets that complement positive DNS replies in the authority section can be used to trick resolvers to update their delegation information for the zone. Usually ..."
  },
  {
    "fecha": "2025-12-01",
    "cve": "CVE-2025-2011",
    "descripcion": "The Slider & Popup Builder by Depicter plugin for WordPress is vulnerable to generic SQL Injection via the ‘s' parameter in all versions up to, and including, 3.6.1 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL ..."
  }
]