[
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2024-4367",
    "descripcion": "A type check was missing when handling fonts in PDF.js, which would allow arbitrary JavaScript execution in the PDF.js context. This vulnerability affects Firefox < 126, Firefox ESR < 115.11, and Thunderbird < 115.11."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-58034",
    "descripcion": "An Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') vulnerability [CWE-78] vulnerability in Fortinet FortiWeb 8.0.0 through 8.0.1, FortiWeb 7.6.0 through 7.6.5, FortiWeb 7.4.0 through 7.4.10, FortiWeb 7.2.0 through 7.2.11, FortiWeb 7.0.0 ..."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-31201",
    "descripcion": "This issue was addressed by removing the vulnerable code. This issue is fixed in tvOS 18.4.1, visionOS 2.4.1, iOS iOS 18.4.1 and iPadOS 18.4.1, macOS Sequoia 15.4.1. An attacker with arbitrary read and write capability may be able to bypass Pointer Authentication. Apple is aware ..."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-20393",
    "descripcion": "Cisco is aware of a potential vulnerability. Cisco is currently investigating and will update these details as appropriate as more information becomes available."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-55182",
    "descripcion": "A pre-authentication remote code execution vulnerability exists in React Server Components versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 including the following packages: react-server-dom-parcel, react-server-dom-turbopack, and react-server-dom-webpack. The vulnerable code ..."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-11901",
    "descripcion": "An uncontrolled resource consumption vulnerability affects certain ASUS motherboards using Intel B460, B560, B660, B760, H410, H510, H610, H470, Z590, Z690, Z790, W480, W680 series chipsets. Exploitation requires physical access to internal expansion slots to install a ..."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-37164",
    "descripcion": "A remote code execution issue exists in HPE OneView."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-59718",
    "descripcion": "A improper verification of cryptographic signature vulnerability in Fortinet FortiOS 7.6.0 through 7.6.3, FortiOS 7.4.0 through 7.4.8, FortiOS 7.2.0 through 7.2.11, FortiOS 7.0.0 through 7.0.17, FortiProxy 7.6.0 through 7.6.3, FortiProxy 7.4.0 through 7.4.10, FortiProxy 7.2.0 ..."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-14733",
    "descripcion": "An Out-of-bounds Write vulnerability in WatchGuard Fireware OS may allow a remote unauthenticated attacker to execute arbitrary code. This vulnerability affects both the Mobile User VPN with IKEv2 and the Branch Office VPN using IKEv2 when configured with a dynamic gateway ..."
  },
  {
    "fecha": "2025-12-22",
    "cve": "CVE-2025-68461",
    "descripcion": "Roundcube Webmail before 1.5.12 and 1.6 before 1.6.12 is prone to a Cross-Site-Scripting (XSS) vulnerability via the animate tag in an SVG document."
  }
]