[
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-62168",
    "descripcion": "Squid is a caching proxy for the Web. In Squid versions prior to 7.2, a failure to redact HTTP authentication credentials in error handling allows information disclosure. The vulnerability allows a script to bypass browser security protections and learn the credentials a trusted ..."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-59287",
    "descripcion": "Deserialization of untrusted data in Windows Server Update Service allows an unauthorized attacker to execute code over a network."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-33073",
    "descripcion": "Improper access control in Windows SMB allows an authorized attacker to elevate privileges over a network."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-8088",
    "descripcion": "A path traversal vulnerability affecting the Windows version of WinRAR allows the attackers to execute arbitrary code by crafting malicious archive files. This vulnerability was exploited in the wild and was discovered by Anton Cherepanov, Peter Košinár, and Peter Strýček ..."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-61884",
    "descripcion": "Vulnerability in the Oracle Configurator product of Oracle E-Business Suite (component: Runtime UI). Supported versions that are affected are 12.2.3-12.2.14. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle ..."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-29927",
    "descripcion": "Next.js is a React framework for building full-stack web applications. Starting in version 1.11.4 and prior to versions 12.3.5, 13.5.9, 14.2.25, and 15.2.3, it is possible to bypass authorization checks within a Next.js application, if the authorization check occurs in ..."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-55315",
    "descripcion": "Inconsistent interpretation of http requests ('http request/response smuggling') in ASP.NET Core allows an authorized attacker to bypass a security feature over a network."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-49844",
    "descripcion": "Redis is an open source, in-memory database that persists on disk. Versions 8.2.1 and below allow an authenticated user to use a specially crafted Lua script to manipulate the garbage collector, trigger a use-after-free and potentially lead to remote code execution. The problem ..."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-59230",
    "descripcion": "Improper access control in Windows Remote Access Connection Manager allows an authorized attacker to elevate privileges locally."
  },
  {
    "fecha": "2025-10-21",
    "cve": "CVE-2025-49144",
    "descripcion": "Notepad++ is a free and open-source source code editor. In versions 8.8.1 and prior, a privilege escalation vulnerability exists in the Notepad++ v8.8.1 installer that allows unprivileged users to gain SYSTEM-level privileges through insecure executable search paths. An attacker ..."
  }
]