{
  "empresa": [],
  "busqueda": [
    {
      "fecha": "2025-11-08",
      "titulo": "Gasco - cobro",
      "url": "https://www.reclamos.cl/gasco/reclamo/2025/nov/gasco-cobro",
      "frase_coincidencia": "Cliente 12239683 Carlos Pereira Loser\r\nValles del Huinganal 80 A, Limache\r\nSe realizo una carga de 230 L el dia 09 del 09 del 2025 boleta N 14819088 y se cancelo en el momento al encargado de camion con tarjeta Devito del Banco BCI por un total de 244200 pesos a nombre de Maritza Araya Peret.\r\nAhora estan cobrando la misma carga por un total de 182470 pesos.\r\nExijo aclaracion y devolucion del pago efectuado de mas."
    },
    {
      "fecha": "2025-11-07",
      "titulo": "MERCADOPAGO*SELVALas Condes CHL - Cobros de Suscripción",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/mercadopagoselvalas-condes-chl-cobros-de-suscripci-n",
      "frase_coincidencia": "Esta entidad que desconozco su procedencia, me esta realizando transacciones de mi cuenta corriente BCI por los siguientes cobros.\r\n•MERCADOPAGO*SELVALas Condes CHL\t$15.400.\r\n•MERCADOPAGO*WAFFLLas Condes CHL\t$9.450.\r\n•MERCADOPAGO*ELIAPLas Condes CHL\t$6.450.\r\n•MERCADOPAGO*ELIAPLas Condes CHL\t$8.200.\r\n•MERCADOPAGO*ELIAPLas Condes CHL\t$20.000.\r\nEstos cargos fueron apareciendo desde el 18/10/2025 hasta ahora el último que se realizó  el dia 04/11/2025.\r\n\r\nAdemás,También se me esta realizando un cobro por la siguiente entidad.\r\nGOOGLE PLAY YOUTULAS CONDES CHL.\r\nLos cargos son:\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$14.050.\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$6.750\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$27.100.\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$9.200.\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$2.690.\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$14.050.\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$1.790.\r\n•GOOGLE PLAY YOUTULAS CONDES CHL\t$5.850.\r\n\r\nEstos cobros se descontaron desde el 16/09/205 hasta ahora último 05/11/2025.\r\n\r\nPara que me ayuden y solucionar este problema."
    },
    {
      "fecha": "2025-11-07",
      "titulo": "Tarjeta líderBCI- Publicidad",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/nov/tarjeta-l-der-bci-publicidad",
      "frase_coincidencia": "Estoy cansada de recibir todos los días avisos de la tarjeta Lider Bci ofreciéndome dinero y el plástico: Nunca he solicitado inscribirme y sin embargo usan mi correo para llenarme de su basura, al menos una vez al día. He optado por anular la suscripción, la cual nunca solicite, y sin embargo continúan molestándome."
    },
    {
      "fecha": "2025-11-07",
      "titulo": "BciSeguros - Caso Número: 959555",
      "url": "https://www.reclamos.cl/bci-seguros/reclamo/2025/nov/bci-seguros-caso-n-mero-959555",
      "frase_coincidencia": "Recibí un reclamo del año 2023 caso número 959555 que según la persona a quien se le dañó el auto por un pequeño choque por alcance no le respondieron por los daños. \r\n\r\nEl nombre de la asegurada con ustedes está publicada en Google por no cumplir con la responsabilidad que tiene el seguro BCI .  \r\nNo corresponde y menos corresponde no haberle solucionado los daños al otro vehículo involucrado. \r\n\r\nPagamos nuestros seguros mensualmente por pac. \r\n\r\nEstaré atenta y si no recibo respuesta escalaré esta situación. \r\n\r\nSaludos."
    },
    {
      "fecha": "2025-11-06",
      "titulo": "Liderbci- pago descontado de la cuenta corriente",
      "url": "https://www.reclamos.cl/lider-walmart/reclamo/2025/nov/lider-bci-pago-descontado-de-la-cuenta-corriente",
      "frase_coincidencia": "El día 4 de noviembre se pagó a la tarjeta líder bci $ 200.000 por web de mi cuenta corriente banco bci y el pago fue descontado del banco pero no está reflejado en la tarjeta líder bci ."
    },
    {
      "fecha": "2025-11-05",
      "titulo": "powerprocl - estafa, clonacion de tarjetas",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/powerprocl-estafa-clonacion-de-tarjetas",
      "frase_coincidencia": "@powerprocl o cuentas parecidas - Estafa\r\n\r\nen Instagram – Estafa con suplementos deportivos (Chile) “Quiero compartir mi experiencia para que otras personas no caigan en lo mismo. Realicé una compra de suplementos deportivos a la cuenta de Instagram @powerprocl. Me ofrecieron proteínas y productos fitness con entrega rápida en Chile. El pago fue solicitado por transferencia bancaria al Banco BCI – cuenta corriente N° 72585901, RUT 19.912.462-2. Después de transferir, el contacto por WhatsApp +56 9 3622 1223 dejó de responder, y nunca recibí los productos. Buscando más información, me di cuenta de que esta cuenta sigue publicando promociones y ofertas en Instagram, lo que significa que más personas podrían estar cayendo en la misma situación. Por eso, quiero advertir con palabras clave claras para que este reclamo sea encontrado en Google e indexado por buscadores y redes sociales: suple usa fitness estafa suplementos deportivos Chile Instagram compra online no entregada fraude transferencia Banco BCI Ya presenté denuncia en PDI (cibercrimen), además de aviso a mi banco y prepararé reclamo en SERNAC para que quede registro oficial. ⚠️ Recomendación: nunca transfieran a cuentas personales sin boleta ni respaldo formal. Si buscan suplementos en Chile, háganlo en tiendas reconocidas y con métodos de pago seguros. Comparto esto con la esperanza de que se difunda y nadie más caiga en esta estafa.”"
    },
    {
      "fecha": "2025-11-01",
      "titulo": "Aura Zapatera - No devuelve Dinero pago de Chalas $40.000",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/aura-zapatera-no-devuelve-dinero-pago-de-chalas-40000",
      "frase_coincidencia": "Realicé una transferencia de $40.000 el 22/10/2025 a nombre de Aura, RUT 77.860.892-8, cuenta corriente 95054928, banco BCI /Machbank, como abono por sandalias ofrecidas por redes sociales (TikTok y Facebook).\r\n\r\nLuego de pagar, la persona se negó a enviar el producto y dijo que no hace devoluciones. Revisando redes, vi que tiene muchos reclamos por estafa.\r\n\r\nSolicito la devolución del dinero y que se investigue a la persona responsable.\r\n\r\nAdjunto comprobante de transferencia y capturas de conversación."
    },
    {
      "fecha": "2025-10-29",
      "titulo": "BciSeguros - Retraso de asistencia",
      "url": "https://www.reclamos.cl/bci-seguros/reclamo/2025/oct/bci-seguros-retraso-de-asistencia",
      "frase_coincidencia": "Hola buenas tardes \r\nLes escribo porque estoy indignado con los servicios de asistencia de bci seguros\r\nHoy 29-10!-2025 mi vehículo asegurado tuvo un desperfecto mecánico y no podía moverlo lo cual a las 3:30 am aproximadamente solicite la grúa para llevarlo a la dirección del taller, me contactaron que tenían un atraso porque no había grúas disponiblesy que debía esperar hasta 3 horas o más bien hasta las 7 am lo cual considere que era mucho, mi sorpresa es que llegó la grúa a las 9:10 am o sea 5:30 horas espere !\r\nEso no fue todo ...la grúa venía con otro vehículo que arriba en la cuna y mi vehículo lo llevaron colgando. Esto es una falta de respeto porque uno contrata el seguro y te ofrecen maravillas que no cumplenm, se suma al nivel de inseguridad que hay en el país es demasiado peligroso estar esperando tantas horas, nesecito y exijo una respuesta.\r\nDestacó que las telefonista y el conductor de la grúa fueron amablementes, pero el coordinador del servicio."
    },
    {
      "fecha": "2025-10-29",
      "titulo": "Gimnasio Pacific Fitnes Club (rancagua) - Clausurado",
      "url": "https://www.reclamos.cl/reclamo/2025/oct/gimnasio-pacific-fitnes-club-rancagua-clausurado",
      "frase_coincidencia": "SEÑORES GIMNASIO PACIFIC FITNES CLUB\r\nPRESENTE\r\n\r\nAsunto: Reclamo por cierre de sucursal y solicitud de compensaciónEstimado/a equipo de Pacific Fitness:Me dirijo a ustedes para expresar mi molestia y presentar un reclamo formal debido al cierre inesperado de la sucursal de Rancagua ciudad de Rancagua la cual era la que yo utilizaba regularmente y por la cual contraté su servicio.Actualmente tengo un plan anual activo, el cual no lo he utilizado por que me tuve que ir de viaje al extranjero y cuando volví a ir estaba clausurado hace ya un mes. Elegí específicamente esa sucursal por su ubicación y conveniencia, por lo que su cierre afecta directamente el valor que recibo del servicio contratado.Considerando esta situación, que representa un incumplimiento de lo ofrecido al momento de la compra, solicito esta solución:\r\n\r\n 1. La devolución total del dinero pagado por el tiempo no utilizado del plan freepass upgrade. Espero una pronta respuesta y una solución satisfactoria a esta situación, considerando que se trata de un compromiso que asumieron conmigo como cliente. Quedo atenta a su pronta respuesta.\r\nMis datos de reembolso son \r\n\r\nJAVIERA FERNANDA SALAZAR\r\n17.042.256-2\r\nBanco Bci Cuenta Corriente\r\n53989775 [email protected]"
    },
    {
      "fecha": "2025-10-29",
      "titulo": "BancoBCI- Bloqueó de tarjeta por parte del banco",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/oct/banco-bci-bloque-de-tarjeta-por-parte-del-banco",
      "frase_coincidencia": "Me dirijo a la sucursal de Villarrica del banco bCI el día 28 de octubre 2025, a retirar una tarjeta de crédito la cual no me quisieron entregar y por error ejecutivo me bloqueó la otra tarjeta que tenía vigente, solicite que me entregaran mis tarjetas y se negaron, luego me dijeron que me llamarían tampoco lo dieron, volví a la sucursal de Villarrica apara hablar con la encargada de servicio al cliente y no trabajo en toda la mañana porque no se encontraba en su lugar de trabajo o simplemente me la negaron, necesito solución de mi problema."
    }
  ]
}