{
  "empresa": [],
  "busqueda": [
    {
      "fecha": "2025-11-01",
      "titulo": "Aura Zapatera - No devuelve Dinero pago de Chalas $40.000",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/aura-zapatera-no-devuelve-dinero-pago-de-chalas-40000",
      "frase_coincidencia": "Realicé una transferencia de $40.000 el 22/10/2025 a nombre de Aura, RUT 77.860.892-8, cuenta corriente 95054928, banco BCI /Machbank, como abono por sandalias ofrecidas por redes sociales (TikTok y Facebook).\r\n\r\nLuego de pagar, la persona se negó a enviar el producto y dijo que no hace devoluciones. Revisando redes, vi que tiene muchos reclamos por estafa.\r\n\r\nSolicito la devolución del dinero y que se investigue a la persona responsable.\r\n\r\nAdjunto comprobante de transferencia y capturas de conversación."
    },
    {
      "fecha": "2025-10-29",
      "titulo": "BciSeguros - Retraso de asistencia",
      "url": "https://www.reclamos.cl/bci-seguros/reclamo/2025/oct/bci-seguros-retraso-de-asistencia",
      "frase_coincidencia": "Hola buenas tardes \r\nLes escribo porque estoy indignado con los servicios de asistencia de bci seguros\r\nHoy 29-10!-2025 mi vehículo asegurado tuvo un desperfecto mecánico y no podía moverlo lo cual a las 3:30 am aproximadamente solicite la grúa para llevarlo a la dirección del taller, me contactaron que tenían un atraso porque no había grúas disponiblesy que debía esperar hasta 3 horas o más bien hasta las 7 am lo cual considere que era mucho, mi sorpresa es que llegó la grúa a las 9:10 am o sea 5:30 horas espere !\r\nEso no fue todo ...la grúa venía con otro vehículo que arriba en la cuna y mi vehículo lo llevaron colgando. Esto es una falta de respeto porque uno contrata el seguro y te ofrecen maravillas que no cumplenm, se suma al nivel de inseguridad que hay en el país es demasiado peligroso estar esperando tantas horas, nesecito y exijo una respuesta.\r\nDestacó que las telefonista y el conductor de la grúa fueron amablementes, pero el coordinador del servicio."
    },
    {
      "fecha": "2025-10-29",
      "titulo": "Gimnasio Pacific Fitnes Club (rancagua) - Clausurado",
      "url": "https://www.reclamos.cl/reclamo/2025/oct/gimnasio-pacific-fitnes-club-rancagua-clausurado",
      "frase_coincidencia": "SEÑORES GIMNASIO PACIFIC FITNES CLUB\r\nPRESENTE\r\n\r\nAsunto: Reclamo por cierre de sucursal y solicitud de compensaciónEstimado/a equipo de Pacific Fitness:Me dirijo a ustedes para expresar mi molestia y presentar un reclamo formal debido al cierre inesperado de la sucursal de Rancagua ciudad de Rancagua la cual era la que yo utilizaba regularmente y por la cual contraté su servicio.Actualmente tengo un plan anual activo, el cual no lo he utilizado por que me tuve que ir de viaje al extranjero y cuando volví a ir estaba clausurado hace ya un mes. Elegí específicamente esa sucursal por su ubicación y conveniencia, por lo que su cierre afecta directamente el valor que recibo del servicio contratado.Considerando esta situación, que representa un incumplimiento de lo ofrecido al momento de la compra, solicito esta solución:\r\n\r\n 1. La devolución total del dinero pagado por el tiempo no utilizado del plan freepass upgrade. Espero una pronta respuesta y una solución satisfactoria a esta situación, considerando que se trata de un compromiso que asumieron conmigo como cliente. Quedo atenta a su pronta respuesta.\r\nMis datos de reembolso son \r\n\r\nJAVIERA FERNANDA SALAZAR\r\n17.042.256-2\r\nBanco Bci Cuenta Corriente\r\n53989775 [email protected]"
    },
    {
      "fecha": "2025-10-29",
      "titulo": "BancoBCI- Bloqueó de tarjeta por parte del banco",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/oct/banco-bci-bloque-de-tarjeta-por-parte-del-banco",
      "frase_coincidencia": "Me dirijo a la sucursal de Villarrica del banco bCI el día 28 de octubre 2025, a retirar una tarjeta de crédito la cual no me quisieron entregar y por error ejecutivo me bloqueó la otra tarjeta que tenía vigente, solicite que me entregaran mis tarjetas y se negaron, luego me dijeron que me llamarían tampoco lo dieron, volví a la sucursal de Villarrica apara hablar con la encargada de servicio al cliente y no trabajo en toda la mañana porque no se encontraba en su lugar de trabajo o simplemente me la negaron, necesito solución de mi problema."
    },
    {
      "fecha": "2025-10-29",
      "titulo": "Tomas Aitken / Odontólogo - Estafa",
      "url": "https://www.reclamos.cl/reclamo/2025/oct/tomas-aitken-odont-logo-estafa",
      "frase_coincidencia": "TOMAS AITKEN LEIVA REGISTRO EN LA SUPERINTENDENCIA N° 67877 \r\nEste estafador profesional de profesión odontólogo de la Universidad de los Andes nos estafó enviándonos comprobantes falsos del Banco BCI por arriendo de box dental. Nos hemos ido enterando que también estafa a sus pacientes y otros colegas que le han arrendado box. Se aprovecha de la confianza de la gente para estafar sin ningún pudor. No se realicen tratamientos con este \"profesional de la estafa\" por que seguramente los engañará. Lo mismo a los colegas que piensen hacer algún trato con este delincuente."
    },
    {
      "fecha": "2025-10-28",
      "titulo": "BancoBci- cobro indebido y no autorizado",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/oct/banco-bci-cobro-indebido-y-no-autorizado",
      "frase_coincidencia": "Estimados.\r\nDesde hace tres meses me han aparecido cobros indebidos, de una empresa que se llama \"Servicios Digitales Las Condes\" código de referencia 061054598632,  monto $29.755, último cobro 04-10-25, cabe señalar, que NUNCA he solicitado algún servicio a esta empresa, el cargo se ha realizado a mi TC visa.\r\nPor favor existen muchísimos reclamos en relación a este fraude.\r\nAdjunto investigación de TVN en relación a lo mencionado.\r\nhttps://www.youtube.com/watch?v=WGZ8K_KQibg"
    },
    {
      "fecha": "2025-10-28",
      "titulo": "BBancobci- Entrega de tarjeta débito",
      "url": "https://www.reclamos.cl/reclamo/2025/oct/bbanco-bci-entrega-de-tarjeta-d-bito",
      "frase_coincidencia": "Me robaron mi billetera con todos mis documentos. Lame por teléfono a estos call centenario extranjeros que no me explicaron nada y me dijeron que en 4 días fuera a buscar  mi tarjeta débito. Cuando llegue hoy martes 28-10 la seta de la caja me dice que no puede darme la tarjeta x no tener el carnet identidad. Solo el comprobante del registro civil no sirve. Fui a mi sucursal de origen en la cisterna pero ninguna solución. Espero cuando ellos me llamen para cambiar mi seguro no se los voy aceptar solo para eso acosan con llamadas y para solución de un problema de un \"cliente \" ninguna solución en bci ."
    },
    {
      "fecha": "2025-10-27",
      "titulo": "BancoBci- cobros tarjeta de crédito",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/oct/banco-bci-cobros-tarjeta-de-cr-dito",
      "frase_coincidencia": "Durante la jornada de hoy, después de revisar mi cartola bancaria, me percato que me han realizado 6 descuentos de una página llamada Dlocal*prime video santiago por el total de $23 que no corresponde en nada al descuento que me realiza el streaming de Amazon Prime. Hice el reclamo directamente en mi banco BCI y la única solución que me dieron fue bloquear la tarjeta, además de iniciar el proceso de denuncia por fraude, en que se me hizo hincapié en que a pesar de ser la perjudicada en esta situación, si ellos luego de la investigación determinaban que yo había realizado los pagos, se cursarían demandas en mi contra; no está demás señalar que el nivel de vulneración a los derechos de los consumidores es altísima, y que es mi banco el principal responsable de evitar estos tipos de fraude. Sin perjuicio de todo esto, para mas inri, el ejecutivo que me atendió para realizar el proceso de bloqueo, hizo mal la denuncia, anotando gastos que yo no había objetado, lo que puede efectivamente darse el supuesto de que se me castigue por esos gastos que si autorice, por realizar mal el procedimiento. Cuando le solicité modificarlo, me dijo que ya no podía, pero que yo rellenara mejor el documento y lo enviará, cosa que hice. Lamentablemente todo esto es un chiste."
    },
    {
      "fecha": "2025-10-23",
      "titulo": "BancoBCI- No responder por el robo de información de tarjetas de debito",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/oct/banco-bci-no-responder-por-el-robo-de-informaci-n-de-tarjetas-de-debito",
      "frase_coincidencia": "El día 20 de septiembre al intentar utilizar mi cuenta para una transferencia descubrí que la tenía bloqueada, tuve que ir presencialmente al banco el día 23 de septiembre para desbloquearla y en ningún momento me dijeron por que estaba bloqueada en primer lugar. El día 23 de septiembre LUEGO de que la cuenta fuera desbloqueada ocurrieron varios pagos en comercios en la ciudades de concepción y talcahuano, en las que yo nunca he estado.\r\n\r\nLa tarjeta nunca fue robada por lo que creemos que los datos habían sido obtenidos de forma online, se hizo el reclamo, la denuncia y se enviaron los papeles requeridos. Su respuesta fue cuanto menos insultante:\r\n\r\nAsumieron que porque las compras fueron realizadas por una billetera digital implicaba que la tarjeta fue asociada siguiendo protocolos de seguridad como confirmaciones por mensaje de texto o correo electrónico, la verdad es que su banco no solo no realiza ninguna de esos procedimientos sino que es sabido que en billeteras digitales como mercado pago NO piden ninguna especie de confirmación bancaria además de los datos de la tarjeta y el rut de la persona; datos que probablemente fueron robados de BCI cuando la cuenta fue bloqueada y la verdad, hoy en día solo se necesita saber el nombre de alguien para averiguar su rut utilizando google.\r\n\r\nNo es un agregado menor que yo NO poseo billeteras digitales.\r\n\r\nSi los datos de una persona están comprometidos, es DEBER del banco insistir en el cambio del plástico de la tarjeta y no simplemente desbloquear cuentas comprometidas sin explicar las circunstancias que llevaron a esa brecha de seguridad.\r\n\r\nFinalmente cuando pido algo de guía en que hacer, los ejecutivos sugieren que vaya personalmente a los comercios donde ocurrió la estafa, ¿A qué exactamente? ¿Cómo podría resolver algo ir a un local de carnes en una ciudad desconocida para mí, a pedir respuestas si el banco es el responsable de mantener la seguridad de los datos del cliente? ¿Cómo se atreven a desestimar un caso aludiendo que sus ejecutivos conocen el funcionamiento de las billeteras digitales cuando su propio banco no tiene idea sobre las falencias de seguridad relacionadas a ese tipo de comercio electrónico?\r\n\r\nComo solución quiero la restitución de los dineros robados y una investigación profunda que indique cual fue la billetera digital utilizada en esta estafa."
    }
  ]
}