{
  "empresa": [],
  "busqueda": [
    {
      "fecha": "2025-11-24",
      "titulo": "Uber Eats - Dinero",
      "url": "https://www.reclamos.cl/uber-eats/reclamo/2025/nov/uber-eats-dinero",
      "frase_coincidencia": "Una vez iba a pedir y me cancelaron la transacción del dinero por tarjeta bloqueada y hoy me descontaron 7 mil pesos del bci por el Uber eat por un pedido que nunca me llegó y quiero mi dinero de vuelta porque si no me llegó es plata robada."
    },
    {
      "fecha": "2025-11-23",
      "titulo": "BancoBCI- no alzamiento de propiedad",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/nov/banco-bci-no-alzamiento-de-propiedad",
      "frase_coincidencia": "hace dos años que pague la deuda \r\ny todavia no alza la propiedad\r\nhe perdido negocio , porque la voy ha vender y como esta en hipoteca no se puede vender."
    },
    {
      "fecha": "2025-11-19",
      "titulo": "temu.com 2 las condes chl - Producto Nunca Llego",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/temucom-2-las-condes-chl-producto-nunca-llego",
      "frase_coincidencia": "pague con tarjeta credito terminada en 5043 bci $50599 y los productos nunca llegaron"
    },
    {
      "fecha": "2025-11-17",
      "titulo": "Corredora Houm - Apropiación Ilicita de dinero",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/corredora-houm-apropiaci-n-ilicita-de-dinero",
      "frase_coincidencia": "Por medio de la presente, vengo a formular un reclamo formal por la gestión realizada en el proceso de reserva del departamento ubicado en Los Abetos Sur 1047, Depto. 24, Vitacura.\r\n\r\nCon fecha 26 de agosto de 2025, efectué una transferencia por $862.750 a la Corredora Houm en concepto de reserva del inmueble indicado. La transferencia se realizó a solicitud expresa de la corredora para “asegurar” la propiedad, luego de haber visitado personalmente el departamento —instancia en la que el propietario señaló que entregaría respuesta al día siguiente—, y considerando además que debía desocupar mi domicilio anterior el 31 de agosto.\r\n\r\nNo obstante, transcurrieron más de quince (15) días sin respuesta del dueño. Durante este periodo, la corredora reiteró que, con la transferencia y antecedentes solicitados, el proceso estaba en curso. Al cabo de dicho plazo, se me informó que el propietario rechazó nuestro perfil, por lo que solicité de inmediato la devolución del dinero.\r\n\r\nA partir de entonces, la corredora me ofreció otras propiedades que no se ajustaban a mis necesidades y me indicó completar un formulario con el ID de la propiedad original. Sin recibir respuesta oportuna, insistí telefónicamente y, transcurrido más de un mes, se me comunicó que no encontraban la transferencia y que, de forma interna, habían reasignado mi depósito a otras propiedades —argumentando la necesidad de “dejar nuevamente en línea” el inmueble de Los Abetos—, exigiendo completar nuevos formularios con IDs distintos. Esta situación se repitió en cuatro ocasiones.\r\n\r\nAdicionalmente, se me informó que mi cuenta BCI MACH —desde la cual se realizó la transferencia— presentaba rechazo del sistema, pese a existir convenio con dicha entidad. Envié dos cuentas adicionales y, finalmente, una tercera cuenta BCI MACH (de mi marido) fue aceptada. Para entonces, ya habían transcurrido dos meses desde mi solicitud de devolución.\r\n\r\nFinalmente, la corredora retuvo unilateralmente el 20% del monto transferido, esto es $172.550, pese a que el rechazo provino del propietario y no de mi parte. Tal retención carece de fundamento y, a lo menos, constituye una práctica abusiva e improcedente, en tanto se ampara en cambios unilaterales del “destino” de los fondos y en una supuesta “política interna” que no fue informada ni aceptada por mí al momento de efectuar la reserva.\r\n\r\nLamento haber confiado en la seriedad de la empresa sin revisar previamente antecedentes públicos, donde constan reclamos de tenor similar que refieren a retenciones indebidas y reasignaciones internas de depósitos."
    },
    {
      "fecha": "2025-11-13",
      "titulo": "BciSeguros - Demora En La Entrega De Mi Auto",
      "url": "https://www.reclamos.cl/bci-seguros/reclamo/2025/nov/bci-seguros-demora-en-la-entrega-de-mi-auto",
      "frase_coincidencia": "ref.siniestro 10319428\r\n\r\ndesde el mes de abril que entregue mi auto al taller y hasta el dia de hoy ( nov.13, 2025) no tengo ningun respuesta clara de parte de bci seguros.\r\nhe hecho bastantes reclamos y las respuestas son las mismas , nadie tiene claridad de mi siniestro y las versiones que entregan son todas difereentes.\r\n\r\nliquidador sr. que esta viendo mi caso nunca ha tomado contacto conmigo y desde la gerencia piden que yo me contacte con un señor que no tengo idea que hace y que solucion puede dar.\r\n\r\nrealmente esta compañia es un desastre y nadie se hace responsable de nada ."
    },
    {
      "fecha": "2025-11-12",
      "titulo": "Banco Santander Chile - Cobro duplicado",
      "url": "https://www.reclamos.cl/banco-santander-chile/reclamo/2025/nov/banco-santander-chile-cobro-duplicado",
      "frase_coincidencia": "El 05 de noviembre pagué por la web, con TC ViSA BCI , la cuota n80 de un consumo.\r\nAl momento de pagar el.portalde pago se cayó, reflejando la cartola dos cargos iguales y un solo abono.\r\nHe llamado varias veces a Banco Santander, sin que den una solución."
    },
    {
      "fecha": "2025-11-12",
      "titulo": "MachbankBci- Cobro indebido",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/machbank-bci-cobro-indebido",
      "frase_coincidencia": "Buenas tardes, tengo un cobro indebido no autorizado de parte de $27.991.- a mi tarjeta MACH.\r\nSolicité a MACHBANK solucionar esto en forma inmediata y bloquear el comercio SGAPLICACION.\r\nEl tipo de respuesta absurda del tipo \"hable con el comercio\" o cambie la tarjeta. Necesito solución inmediata por parte de MACHBANK y BCI"
    },
    {
      "fecha": "2025-11-12",
      "titulo": "Haulmer - Cobro Indebido",
      "url": "https://www.reclamos.cl/haulmer/reclamo/2025/nov/haulmer-cobro-indebido",
      "frase_coincidencia": "Soy cliente del Banco BCI y aparece un cobro en mi cuenta realizado a traves de HAULMER de manera presencial en la comuna de San Ramón. Yo resido en la Comuna de Casablanca . BCI dice que los pagos se hicieron de forma presencial. Haulmer no cuenta con un teléfono de contacto ni niguna otra forma de contactar. Qué puedo hacer?\r\n\r\nel cobro aparece de esta meanera en mi cuenta . 06/10/2025 HAULMER*LYL AUTOM 99.900"
    },
    {
      "fecha": "2025-11-10",
      "titulo": "BancoBCI- Fraude Financiero Débito/crédito",
      "url": "https://www.reclamos.cl/banco-bci/reclamo/2025/nov/banco-bci-fraude-financiero-d-bitocr-dito",
      "frase_coincidencia": "Quiero señalar que soy cliente del banco BCI hace poco más de un mes, en el cual mantengo cuenta corriente. En virtud de lo anterior, es que el día de hoy 04.NOV.2025 a las 02:46 horas me llega una notificación a mi correo electrónico [email protected] , el cual se encuentra debidamente registrado en el banco ya señalado, la cual me señala que \"Realizaste una compra en comercio nacional con tu tarjeta de débito\", por un monto de \"561.800\" de fecha 04/11/2025 hora 02:46 horas en el comercio DLOCAL *HABLAX*.\r\n\r\nEs por lo anterior, que decidí bloquear de manera online tanto la tarjeta de débito como la de crédito del banco BCI , ya que yo no realice ninguna transacción, desconociendo totalmente el cobro que asciende a la suma de $561.800.\r\n\r\nFinalmente, me puse en contacto con un ejecutivo online a través de la aplicación del banco BCI , siendo atendido por FRANCY A, a quien le señalé lo sucedido, recibiendo el reclamo y dándome el número de caso, el cual corresponde al N° 40511782.\r\n\r\nQuiero hacer mención que me acerqué personalmente a la sucursal BCI Placilla Curauma, Valparaíso, donde hice presente que existía el reclamo al N° 40511782, el cual según correo electrónico los hechos denunciados en dicho reclamo no eran constitutivos de FRAUDE ELECTRONICO, por actos sucesivos de verificación de identidad para realizar transacciones. Con relación a lo anterior, la ejecutiva bancaria M. Francisca Penafiel A., verificando el reclamo ya señalado me indica que a mi tarjeta de crédito Visa Signature mantiene una transacción del día 04.NOV.025 de la cual no se me dio aviso, en el comercio DLOCAL *HABLAX*, por un monto de $585.700, correspondiendo a la misma entidad que realiza un cobro a mi tarjeta de débito del mismo banco, generando un nuevo reclamo N° 40660617.\r\n\r\nLos montos defraudados en mi cuenta corriente del Banco BCI , corresponden a la suma de $1.147.500. (tarjeta de débito $561.800 / tarjeta de crédito $585.700)\r\n\r\nPor averiguaciones propias, la entidad que defraudo dicho monto HABLAX, corresponde a una pagina internacional de Recargas móviles, llamadas internacionales y más, de la cual no mantengo cuenta y jamás he hecho uso.\r\n\r\nQuiero dejar en claro, que no he utilizado la cuenta corriente del banco BCI en compras nacionales como internacionales, la cual saque con dicho banco para tramitar un crédito hipotecario. Esta problemática se debe tratar de un tema de robo de bases de datos del banco, problemas con su CIBERSEGURIDAD.\r\n\r\nEs todo en cuanto puedo señalar."
    },
    {
      "fecha": "2025-11-10",
      "titulo": "fullpass chile - se cancela el producto y no se entrega",
      "url": "https://www.reclamos.cl/reclamo/2025/nov/fullpass-chile-se-cancela-el-producto-y-no-se-entrega",
      "frase_coincidencia": "Buenas tardes.\r\n\r\nEl dia sabado 8 de noviembre se transfiere a la Empresa fullpass chile , el monto de $ 29.990 por la compra de un juego digital , el cual hasta la fecha no ha sido cargado , siendo que se comprometieron a realizar la carga virtual en un lapso de 10 a 15 minutos como maximo\r\n\r\nLa transferencia se realizo a Juan Gabriel Sebastian Muñoz Cortes , rut  18.233.350-9 , Banco BCI , Cuenta Vista 777018233550.\r\n\r\nAdemas no responden los llamados ni los mensajes\r\n\r\nDejo este reclamo para que otras personas no caigan en este tipo de estafas y para ver la forma para que alguna autoridad tome cartas en el asunto , ya que por lo averiguado a posterior , ese volvio una mala practica por parte de este inescrupuloso\r\n\r\nCualquier dato para escalar esta denuncia se agradecera\r\n\r\n\r\nAtte\r\nGonzalo Saldias"
    }
  ]
}