[
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Banco Santander presentó caída en tarjetas, app y sitio web",
    "description": "Clientes reportaron problemas para realizar pagos y acceder a la banca en línea durante varias horas.",
    "url": "https://chocale.cl/2025/04/banco-santander-presenta-caida-en-su-app-y-sitio-web-3/",
    "image": "https://i0.wp.com/chocale.cl/wp-content/uploads/2024/07/sucursal-work-cafe-inversiones-vitacura-banco-santander.jpg?resize=800%2C500&ssl=1",
    "source": "Chocale.cl",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "09:15"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Usuarios reportan caída mundial de WhatsApp Web",
    "description": "La aplicación de mensajería sufrió una interrupción global que afectó a millones de usuarios.",
    "url": "https://www.t13.cl/noticia/mundo/no-tu-internet-usuarios-reportan-caida-nivel-mundial-whatsapp-web-13-8-2025",
    "image": "https://s.t13.cl/sites/default/files/styles/manualcrop_1600x800/public/t13/field-imagen/2025-08/AFP__20250417__42MZ6T3__v1__HighRes__BritainTechnologySocialMediaCommunicationWhatsa.jpg.jpeg?itok=8E8VyUNR",
    "source": "T13",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "10:05"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Usuarios experimentan intermitencias en Banco Santander",
    "description": "Clientes informaron caídas parciales en la app y sitio web de la entidad financiera.",
    "url": "https://www.meganoticias.cl/nacional/493321-usuarios-caida-intermitencia-banco-santander-problemas-sistema-aplicacion-sitio-web-brk-25-7-2025.html",
    "image": "https://www.publimetro.cl/resizer/v2/FLIN5I3LW5AE5P4N7JHU75TIRU.jpeg?auth=4d99bed4191df67216128f96b0e0a420ea9564c508d04c8b37b56be4c05268bf&width=1440&height=959",
    "source": "Meganoticias",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "11:20"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Transbank reporta problemas en pagos con tarjetas de crédito",
    "description": "Usuarios de distintos bancos señalaron dificultades para completar compras presenciales y en línea.",
    "url": "https://www.t13.cl/noticia/negocios/transbank-reporto-problemas-pagos-tarjetas-credito-varios-bancos-14-9-2025",
    "image": "https://s.t13.cl/sites/default/files/styles/manualcrop_1600x800/public/t13/field-imagen/2025-09/A_UNO_481417_f8263.jpg.jpeg?itok=xE85s66d",
    "source": "T13",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "12:40"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Falla en Tesorería deja estancada inscripción y venta de 6 mil vehículos nuevos",
    "description": "Un error en la plataforma digital de la Tesorería impidió el registro de automóviles durante varios días.",
    "url": "https://biobiochile.cl/noticias/economia/mercado-automotriz/2025/09/16/un-fallo-en-la-pagina-de-la-tesoreria-tiene-estancada-la-inscripcion-y-venta-de-6-mil-vehiculos-nuevos.shtml",
    "image": "https://media.biobiochile.cl/wp-content/uploads/2025/09/transaccion-de-6-mil-vehiculos-en-pausa-por-fallo-en-la-plataforma-de-la-tesoreria-750x400.jpg",
    "source": "Biobio Chile",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "14:00"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Reportan caída de plataformas digitales del Banco de Chile",
    "description": "La aplicación móvil y servicios en línea de la entidad quedaron inoperativos durante la tarde.",
    "url": "https://chocale.cl/2025/09/reportan-caida-de-plataformas-digitales-del-banco-de-chile/",
    "image": "https://i0.wp.com/chocale.cl/wp-content/uploads/2025/03/banco-de-chile-generico.jpg?resize=800%2C500&ssl=1",
    "source": "Chocale.cl",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "15:30"
  },
  {
    "categoria": "Fraude / Ciberfraude Financiero",
    "title": "[Noticia Test] Hackers roban datos de clientes en banco regional",
    "description": "Se detectó una brecha de seguridad que comprometió información personal y financiera de miles de usuarios.",
    "url": "https://ejemplo.cl/noticia/hackers-roban-datos-banco-regional",
    "image": "https://e3.365dm.com/24/01/1600x900/skynews-hacker-cyberattack_6439404.jpg?20240131153309",
    "source": "Ejemplo.cl",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "16:10"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Clientes reportan intermitencias en BCI Móvil",
    "description": "Usuarios indicaron que la app presentó lentitud y problemas para iniciar sesión durante la jornada.",
    "url": "https://ejemplo.cl/noticia/intermitencia-bci-movil",
    "image": "https://media.istockphoto.com/id/640267784/es/foto/edificio-del-banco.jpg?s=2048x2048&w=is&k=20&c=YFGlZ9MAXUAKP7jN5IJd3MeVwtiIQVOHatwb3qfU5FU=",
    "source": "Ejemplo.cl",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "17:05"
  },
  {
    "categoria": "Problemas en Plataformas Digitales",
    "title": "[Noticia Test] Plataforma de pagos en línea del Estado presentó fallas",
    "description": "Trámites y pagos electrónicos quedaron interrumpidos temporalmente por un error técnico.",
    "url": "https://ejemplo.cl/noticia/falla-plataforma-pagos-estado",
    "image": "https://ichef.bbci.co.uk/ace/ws/509/cpsprodpb/c77b/live/20dada20-8402-11f0-bd2b-c9a8fb561af5.jpg.webp",
    "source": "Ejemplo.cl",
    "date": "Miércoles 24 de septiembre de 2025",
    "time": "18:00"
  },
  {
    "title": "Gobierno descarta daños graves tras ciberataque que afectó a Subsecretaría de Prevención del Delito",
    "description": "",
    "url": "https://www.biobiochile.cl/noticias/nacional/chile/2025/09/26/gobierno-descarta-danos-graves-tras-ciberataque-que-afecto-a-subsecretaria-de-prevencion-del-delito.shtml",
    "image": "https://media.biobiochile.cl/wp-content/uploads/2025/09/ciberataque-subsecretaria-prevencion-del-delito-4.jpg",
    "source": "BioBioChile",
    "categoria": "Problemas en Plataformas Digitales",
    "date": "viernes 26 de septiembre de 2025",
    "time": "17:10"
  },
  {
    "title": "Los efectos del hackeo al Instituto de Salud Pública: no hubo filtración de datos sensibles, pero perdieron seis meses de trabajo",
    "description": "Los detalles del hackeo fueron entregados por la directora del ISP, Catterina Ferreccio, durante una comisión de Salud del Senado. Debido a la ausencia de la ministra Aguilera en la instancia, los parlamentarios presentaron una nota de protesta a la titular de Salud.",
    "url": "https://www.latercera.com/nacional/noticia/los-efectos-del-hackeo-al-instituto-de-salud-publica-no-hubo-filtracion-de-datos-sensibles-pero-perdieron-seis-meses-de-trabajo/",
    "image": "https://www.latercera.com/resizer/v2/6NIJKN2Y5ZBNLMA2D5IVHXBITA.jpg?auth=9a7704ca698d41c9196dd5bbc412ec5297eea81e55c4f86a447ea2bb3bbf9e72&smart=true&width=900&height=600",
    "source": "La Tercera",
    "categoria": "Problemas en Plataformas Digitales",
    "date": "lunes 29 de septiembre de 2025",
    "time": "17:34"
  },
  {
    "title": "Caos en Afganistán: Apagón total y silencio oficial talibán aíslan al país",
    "description": "<p>Los talibanes mantienen el silencio oficial 24 horas después de que <strong>Afganistán</strong> quedara incomunicado por un <strong>apagón nacional de internet y comunicaciones telefónicas</strong>, en un aislamiento generalizado que ha dejado <strong>sin conexión a más de 43 millones de personas.</strong></p>\n<p>El silencio del gobierno se extiende incluso a las redes sociales, su principal herramienta de propaganda. El principal portavoz talibán, <strong>Zabihullah Mujahid</strong>, cuya cuenta en X (<a href=\"https://x.com/zabehulah_m33\" rel=\"link a una nota absoluta 1\" target=\"_blank\"><strong>@Zabehulah_M33</strong></a>) es una de las voces oficiales del régimen, no ha publicado ningún mensaje.</p>\n<p>La interrupción comenzó el lunes a las 17.00 hora local (9.00 hora chilena), según reportan medios locales, cuando <strong>los servicios de fibra óptica fueron cortados y, posteriormente, las redes móviles degradadas</strong>, impidiendo el acceso a internet en todo el país.</p>\n<p>El principal medio local, <em>TOLOnews</em>, ha recogido testimonios de ciudadanos en Kabul que denuncian cómo el apagón ha bloqueado por completo su trabajo y sus actividades diarias.</p>\n<p>Durante el apagón, medios afganos destacados como<em> Amu TV</em> han empezado a difundir comunicaciones limitadas en sus perfiles de redes sociales, denunciando que las agencias internacionales han perdido contacto con sus oficinas en Kabul.</p>\n<p><strong>\"La conectividad a Internet en Afganistán se mantuvo estancada alrededor del 1%\",</strong> dijo <strong>'NetBlocks'</strong>, una organización internacional de monitoreo del acceso a Internet.</p>\n<h2><em><strong>Organizaciones en el exilio acusan desconexión \"deliberada\"</strong></em></h2>\n<p>El apagón sucede semanas después de que <strong>los talibanes prohibieran el acceso a internet por fibra óptica en el norte del país</strong>, con el argumento de prevenir <strong>\"actividades inmorales\",</strong> limitando directamente la infraestructura de red en el país por primera vez.</p>\n<p>En varias ocasiones, las autoridades del régimen han expresado su preocupación por la circulación de pornografía en línea y otros contenidos que consideran contrarios a su interpretación de la sharía, lo que ha servido como justificación para imponer restricciones digitales.</p>\n<p>\"Se establecerá un sistema alternativo dentro del país para las necesidades esenciales\", declaró entonces el gobernador de la provincia norteña de Balj,<strong> Haji Zaid,</strong> sin aclarar las especificaciones de la medida.</p>\n<p><strong>Organizaciones afganas en el exilio</strong> han señalado directamente a los talibanes como responsables del corte, entre ellos, <strong>Afghan Women Activists Coordinating Body (AWACB)</strong> que denunció<strong> la desconexión ha sido \"deliberada por los talibanes\"</strong> y que aísla \"a toda una nación del mundo y silencia las voces civiles\".</p>\n<p>El organismo instó a la comunidad internacional a presionar para restablecer el acceso a las comunicaciones, al considerar el apagón no solo como censura, sino como \"un ataque a la vida, la dignidad y la supervivencia\".</p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Dear <a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@elonmusk</a> ,<br />\n\n<br />\n\nOn behalf of Afghan civil society and especially Afghan women, We are reaching out to you with deep urgency and heavy hearts. In Afghanistan, the Taliban have cut the internet, leaving millions of people – especially women and girls – trapped in silence.<br />\n\n<br />\n\nAs the…</p>\n— Afghan Women Activist´s Coordinating Body (AWACB) (@AWACB_DE) <a href=\"https://twitter.com/AWACB_DE/status/1972944794180530410?ref_src=twsrc%5Etfw\">September 30, 2025</a></blockquote>\n\n<h2><strong><em>Vuelos cancelados</em></strong></h2>\n<p><strong>Todos los vuelos desde el Aeropuerto Internacional de Kabul fueron cancelados este martes</strong>, dejando a Afganistán aislado por aire como consecuencia directa del apagón masivo.</p>\n<p>Funcionarios del aeropuerto confirmaron a la cadena afgana <em>AMU TV</em> que la suspensión de los vuelos, tanto nacionales como internacionales, se debió a la interrupción de las comunicaciones y que no recibieron ningún aviso previo por parte de las autoridades.</p>\n<p>De acuerdo con el servicio de seguimiento de vuelos Flightradar24, los vuelos programados para este martes de aerolíneas afganas como <strong>Ariana Afghan Airlines</strong> y <strong>Kam Air,</strong> se vieron cancelados, sumando al menos ocho operaciones afectadas entre salidas y llegadas.</p>\n<h2><em><strong>1,3 millones de mujeres sin su única ventana al mundo</strong></em></h2>\n<p>El apagón total de internet impuesto en Afganistán ha desconectado del mundo a más de <strong>1,3 millones de mujeres y niñas</strong>, según una estimación que cruza los últimos datos demográficos con el análisis más reciente sobre la brecha digital en el país.</p>\n<p>Para la inmensa mayoría de estas mujeres, <a href=\"https://www.cooperativa.cl/noticias/mundo/afganistan/como-las-normas-talibanes-convirtieron-un-terremoto-en-una-trampa-mortal/2025-09-06/101810.html\" rel=\"link a una nota absoluta 5\" target=\"_blank\">ya sometidas a un encierro forzoso por las severas restricciones del régimen</a>, internet no era un lujo, sino<strong> su única y última ventana al mundo exterior</strong>, un salvavidas que ahora ha sido cortado.</p>\n<p>Un informe previo al apagón, titulado<strong> \"La libertad digital está fuera del alcance de la mayoría de las mujeres afganas\"</strong>, documentaba que solo un 6% de la población femenina de Afganistán lograba tener acceso a la red. Aplicando esta cifra a la población femenina actual del país, estimada en unos 22 millones por organismos como el Banco Mundial, la escala de este nuevo aislamiento supera las 1,3 millones de mujeres.</p>\n<p>La situación en las zonas rurales, donde reside la mayor parte de la población, es de una exclusión casi total con solo un 2% de las mujeres con algún tipo de conexión, según el mismo informe.</p>\n<h2><em><strong>La diáspora afgana pierde la comunicación con sus familiares</strong></em></h2>\n<p>El apagón total de internet en Afganistán también <strong>ha roto los lazos entre los casi seis millones de miembros de la diáspora afgana y sus familias en este país</strong>, que en algunos casos dependen económicamente de ellos.</p>\n<p>\"Normalmente ayudo económicamente a mi familia en casa debido a la crisis económica actual. El lunes envié dinero que mi familia necesitaba con urgencia, pero ahora no puedo comunicarme con ellos de ninguna manera para compartir los detalles de la transferencia\", dijo a <em>EFE</em> Kharotai, de 60 años, y residente en Reino Unido.</p>\n<p>\"Espero que este corte de internet y teléfonos sea temporal y se resuelva pronto. De lo contrario, <strong>los afganos que viven en el extranjero enfrentarán desafíos serios</strong>\", añadió.</p>\n<p>En el mismo sentido se pronunció Huma Dost, de 22 años y residente junto a su esposo y sus tres hijos en España desde agosto de 2021, y que no ha podido hablar con su familia desde el lunes. \"Este día ha parecido un año\", dijo a <em>EFE</em>, y esperó que <strong>\"los talibanes restablezcan pronto el internet y las líneas telefónicas\".</strong></p>\n<p>Por su parte, Tur Almas, de 43 años y residente en Bélgica desde hace una década, declaró a <em>EFE</em> que el apagón tendrá <strong>\"graves consecuencias para los afganos en el extranjero y sus familias\".</strong></p>\n<p>En su caso, su mayor preocupación es su madre anciana y enferma, con la que había hablado todos los días en los últimos meses y que necesita cuidados constantes.</p>\n<p>En redes sociales se han extendido mensajes similares de usuarios residentes en el extranjero, que han utilizado la etiqueta <a href=\"https://x.com/search?q=%23AfghanistanOffline&amp;src=typed_query\" target=\"_blank\"><strong>#AfghanistanOffline</strong></a> (Afganistán desconectado) para reflejar la situación.</p>",
    "url": "https://cooperativa.cl/noticias/mundo/afganistan/caos-en-afganistan-apagon-total-y-silencio-oficial-taliban-aislan-al/2025-09-30/105317.html",
    "image": "https://cooperativa.cl/noticias/site/artic/20250930/imag/foto_0000000220250930105317.jpg",
    "source": "Cooperativa",
    "categoria": "Problemas en Plataformas Digitales",
    "date": "martes 30 de septiembre de 2025",
    "time": "11:22"
  }
]